{"name": "Berry Crisp Cake Recipe", "description": "This cake is rich and tangy with mascarpone cheese, spiked with sweet white wine. Once baked, the berries sink into the cake and burst, becoming a built-in layer of fresh jam, while the crumble melts and crisps into a cookie-like crust that provides wonderful textural contrast. Serve it warm with a scoop of vanilla ice cream or at room temperature with a cup of steaming coffee in the morning.", "servings": "serves 12 to 16", "mainImageUrl": "https://www.seriouseats.com/thmb/bjP1hYs8yuU4CbtQFqbSPmTHdq4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__07__20120703-127677-Crisp-Cake-PRIMARY-84ac977f6bcf4b94aa41cb1f1a7c1d12.jpg", "ingredients": ["For the Crisp Topping :", "1/2 cup (about 3 1/2 ounces) packed light brown sugar", "1/3 cup (about 1 2/3 ounces) all-purpose flour", "6 tablespoons unsalted butter, chilled and cut into small pieces", "2/3 cup rolled oats", "1/2 cup sliced toasted almonds", "1/8 teaspoon salt", " ", "For the Cake:", "Baking spray", "2 1/2 cups (about 12 1/2 ounces) all-purpose flour", "2 teaspoons baking powder", "2 teaspoons baking soda", "1 teaspoon salt", "3/4 cup sweet white wine, such as riesling or moscato", "1/2 cup mascarpone cheese", "2 teaspoons pure vanilla extract", "1 3/4 cups (about 12 1/4 ounces) granulated sugar", "2 sticks (8 ounces) unsalted butter, at room temperature", "2 teaspoons finely grated lemon zest", "3 large eggs, at room temperature", " ", "For the Fruit Layer :", "20 ounces fresh mixed berries, such as blackberries and raspberries", "2 tablespoons granulated sugar", "1 tablespoon lemon juice", "1/8 teaspoon salt"], "steps": [{"order": 0, "description": "For the Crisp Topping: In medium bowl, combine brown sugar and flour. Add butter, and with fingertips, rub together and toss until mixture resembles coarse meal. Stir in oats, almonds, and salt. Refrigerate until needed.", "image_url": null}, {"order": 1, "description": "For the Cake: Adjust oven rack to middle position and preheat oven to 350°F. Coat 13- by 9-inch baking pan with baking spray.", "image_url": null}, {"order": 2, "description": "In medium bowl, whisk together flour, baking powder, baking soda, and salt. In small bowl, whisk together wine, mascarpone, and vanilla until blended.", "image_url": null}, {"order": 3, "description": "Beat sugar, butter, and lemon zest on medium speed until light and fluffy, about 3 minutes. Add eggs, one at a time, beating well after each addition. Reduce speed to low and add flour mixture in 3 additions, alternating with wine mixture, scraping down sides and bottom of bowl with rubber spatula as needed. Scrape batter into prepared pan.", "image_url": null}, {"order": 4, "description": "For the Fruit Layer and Assembly: In large bowl, toss together berries, sugar, lemon juice and salt. Distribute berry mixture in even layer on top of cake batter. Sprinkle berries with reserved crisp topping.", "image_url": null}, {"order": 5, "description": "Bake until cake tester inserted in center of cake comes out clean, about 45 minutes. Transfer cake to cooling rack and cool to room temperature, about 1 hour.", "image_url": null}]}
{"name": "Chocolate Biscoff Truffles Recipe", "description": "Another fun way to use Biscoff spread, these truffles are a melt-in-your-mouth combination of dark chocolate and warming spices.", "servings": "makes about 12 truffles", "mainImageUrl": "https://www.seriouseats.com/thmb/HKZyrOw81xD82rMeGdd6hou81EA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__03__20120314-biscoffcookietruffles-5ac7782b483f42f2a1c9b45cd1eac32f.JPG", "ingredients": ["3 ounces dark chocolate, chopped", "1/4 cup heavy cream", "1/4 teaspoon vanilla", "2 ounces Biscoff Spread", "1/4 cup cinnamon"], "steps": [{"order": 0, "description": "In a medium, heavy-bottomed sauce pan, heat heavy cream over medium low heat until warm. Add chocolate and cook, stirring frequently, until melted. Stir in vanilla, take off heat, and immediately stir in Biscoff spread until mixture is smooth.", "image_url": null}, {"order": 1, "description": "Pour mixture into a bowl and freeze until firm but pliant, about 1 1/2 hours. Pour cinnamon into a shallow bowl. Scoop one tablespoon of mixture and roll between palms of your hand until round. Roll truffle in cinnamon to coat and place on a plate. Continue with remaining mixture. Place truffles back in freezer for 10 minutes to stiffen. Serve. This Recipe Appears In \n Sweet Hacks: Chocolate Biscoff Truffles", "image_url": null}]}
{"name": "Vegan Peanut, Sweet Potato, and Kale Soup With Coconut Recipe", "description": "The version of West African groundnut soup I ate in my youth was a thick, peanut-packed broth made with chicken, spices, and tomatoes, but recipes for maafe (as it&#39;s called in Mali) vary hugely.", "servings": "Makes about 2 quarts, serving 4 to 6", "mainImageUrl": "https://www.seriouseats.com/thmb/Nkcn2CoIrrcfIad-DiJF8kfjtWI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2016__03__20160309-peanut-sweet-potato-kale-coconut-soup-stew-19-42c54db63e5641f98d67f7569eff4938.jpg", "ingredients": ["6 medium cloves garlic", "1 1/2-inch knob of ginger, peeled and roughly chopped", "1 small bunch cilantro (about 1 1/2 ounces; 45g), thick stems reserved separately from leaves and tender small stems", "1 Serrano or jalapeño chili, stemmed and halved, divided", "Kosher salt", "2 (14-ounce; 400ml) cans full-fat coconut milk (see note)", "2 tablespoons vegetable oil, divided (90ml)", "6 scallions, whites and pale green parts only, thinly sliced, divided", "1 teaspoon ground turmeric", "1 quart water or homemade vegetable stock (see note)", "8 ounces sweet potatoes, peeled and cut into 1/2-inch dice (about 2 small sweet potatoes; 225g)", "8 ounces roasted shelled peanuts (about 2 cups; 225g)", "2 teaspoons sugar", "1 (5-ounce; 140g) bunch lacinato kale, thick stems discarded, leaves very roughly chopped", "1 tablespoon (15ml) fresh juice from 1 to 2 limes", "Freshly ground black pepper", "Hot sauce, such as Frank&#39;s Red Hot, to taste", "Rice, for serving (I like using red or black rice)"], "steps": [{"order": 0, "description": "Combine garlic, ginger, thick cilantro stems, and half of the chile in the bowl of a mortar and pestle (see notes). Sprinkle with about 1 teaspoon of salt. Pound into a rough paste and set aside. Thinly slice remaining half chile and set aside for garnish.", "image_url": "https://www.seriouseats.com/thmb/b0Jmo3B46ysKVj-3FkmjxGcvZSQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__images__2016__03__20160309-peanut-sweet-potato-kale-coconut-soup-stew-03-5eabb5d77d514e57ad3c61df022dd927.jpg"}, {"order": 1, "description": "Open 1 can of coconut milk and carefully spoon off about 3 tablespoons of the solid fat from the surface and place it in a large Dutch oven. Add 1 tablespoon of vegetable oil. Heat over medium-high heat, stirring frequently, until coconut fat separates and solids start to sizzle, about 4 minutes. Continue cooking, stirring constantly, until solids turn pale golden brown, about 1 minute longer. Add the pounded garlic/ginger mixture and cook, stirring, until aromatic, about 30 seconds. Add half of sliced scallions and turmeric and cook, stirring, until lightly softened, about 1 minute.", "image_url": "https://www.seriouseats.com/thmb/9iQ6sjXqtZj9zOczenan1iG3tVE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__20160309-peanut-sweet-potato-kale-coconut-soup-stew-06-composite-294f0714edc74432a9bc373814eb57d3.jpg"}, {"order": 2, "description": "Add remaining contents of both cans of coconut milk along with 1 quart of water or stock. Add sweet potatoes. Bring to a boil, and reduce to a bare simmer. Cook until sweet potatoes are totally softened, about 15 minutes.", "image_url": "https://www.seriouseats.com/thmb/3QHdEUO9nbGQoB8a21xEXX3fHcw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__images__2016__03__20160309-peanut-sweet-potato-kale-coconut-soup-stew-11-af907c5610f2462c9db2dec2d8e3f7dd.jpg"}, {"order": 3, "description": "Meanwhile, combine peanuts and remaining tablespoon of oil in a medium skillet set over medium heat. Cook, tossing and stirring frequently, until peanuts are a deep golden brown, about 8 minutes. Immediately transfer to a bowl to prevent scorching.", "image_url": "https://www.seriouseats.com/thmb/hYeFRJm3KcGXazVkkGX9b5OJNl0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__images__2016__03__20160309-peanut-sweet-potato-kale-coconut-soup-stew-10-242870d71ef04d7cb6856bc2c453129f.jpg"}, {"order": 4, "description": "Transfer 1/2 cup of peanuts to a cutting board and roughly chop. Reserve for garnish. Transfer half of the remaining peanuts to the now-empty mortar and pestle. Sprinkle with 1 teaspoon sugar and a pinch of salt. Pound to form a rough paste, then transfer to pot of soup. Repeat with the other half of the remaining peanuts.", "image_url": "https://www.seriouseats.com/thmb/Adugn8INpLElKBjmYqFKnRi7kzE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__20160309-peanut-sweet-potato-kale-coconut-soup-stew-12-bf6e5f118d254a1d8215da8923025701.jpg"}, {"order": 5, "description": "When potatoes are fully softened, blend soup until mostly smooth but a little texture remains using a hand blender directly in the pot or by transferring to a countertop blender in batches. Bring to a simmer, stir in kale, and cook until kale is completely wilted and tender, about 5 minutes. Stir in lime juice. Season soup to taste with salt, pepper, and hot sauce. Stir in cilantro, reserving some for garnish. Serve soup with rice, sprinkled with cilantro, chopped peanuts, scallions, and sliced chiles.", "image_url": "https://www.seriouseats.com/thmb/_r29mcyKgq9VQAgbfd0aceQA69g=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__images__2016__03__20160309-peanut-sweet-potato-kale-coconut-soup-stew-14-d6bd7f9c739c4019864b6ce912ed596e.jpg"}]}
{"name": "Shortbread Sandwiches Recipe", "description": "The beauty of these cookies is their versatility. Play around: you can fill them with jam, Nutella, peanut butter, or chocolate ganache.", "servings": "makes about 15 cookies", "mainImageUrl": "https://www.seriouseats.com/thmb/9MigN2asaCqVI8r_aYoYnUk_HlQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__05__20120514-cookie-monster-shortbread-sandwiches-f03cf7ac535e4e169c367bf8e16fa381.JPG", "ingredients": ["2 cups (about 10 ounces) all-purpose flour", "1/2 teaspoon kosher salt", "2 sticks (8 ounces) unsalted butter, at room temperature", "1/2 cup (about 2 1/2 ounces) sugar", "1/4 cup jam, Nutella, peanut butter, or chocolate ganache"], "steps": [{"order": 0, "description": "Adjust oven rack to upper middle position and preheat oven to 350°F (175°C). Butter an 8-inch springform pan. In a small bowl, whisk together flour and salt; set aside. In the bowl of a food processor, process butter until light and fluffy, about 3 minutes. Add sugar and pulse for 1 minute. Add flour mixture and pulse just until dough comes together.", "image_url": null}, {"order": 1, "description": "Divide dough into two equal portions. Press one half of dough into bottom of prepared pan until even. Spread with filling of choice, leaving 1/3-inch border at edge of pan. On a lightly floured surface, roll second half of dough out into 8-inch circle. Transfer to pan and place on top of filling. Gently press down on edge of dough to seal. Bake until golden, about 45 minutes.", "image_url": null}, {"order": 2, "description": "Let cookies rest in pan for 15 minutes, then transfer to a cooling rack. When cool, cut into wedges or squares.", "image_url": null}]}
{"name": "Quick Gluten-Free Chocolate Cake Recipe", "description": "This cake is best served right from the pan. If you&#39;d prefer to remove it from the pan for serving, place a &#34;foil sling&#34; in the pan before baking. To do this, place one piece of foil in the pan,...", "servings": "serves 9", "mainImageUrl": "https://www.seriouseats.com/thmb/FhEEDN8wA8NaSsGueLoQ-YmSPkE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__01__20120124-188731-GFTues-ChocolateCake-d3bf88462f5f41c0b58e92df6e3ee3bc.jpg", "ingredients": ["1 1/2 ounces (1/2 cup) natural cocoa powder", "1 cup boiling water", "7 ounces (1 cup) granulated sugar", "5 ounces (1 1/4 cups) white rice flour", "1 1/2 ounces (1/4 cup) sweet rice flour", "1 1/4 ounces (1/4 cup) potato starch", "1/2 teaspoon baking powder", "1/2 teaspoon baking soda", "1/2 teaspoon salt", "1/3 cup canola oil", "1 large egg"], "steps": [{"order": 0, "description": "Preheat oven to 375°F (190°C). Spray an 8-inch square baking pan with non-stick cooking spray.", "image_url": null}, {"order": 1, "description": "In small bowl, whisk together cocoa powder and boiling water until smooth. Allow to cool. In large bowl, whisk together granulated sugar, white rice flour, sweet rice flour, potato starch, baking powder, baking soda, and salt.", "image_url": null}, {"order": 2, "description": "Combine canola oil, egg, and cooled cocoa mixture. Whisk until smooth. Pour over dry ingredients. Whisk until a thick batter forms, taking care to get to the bottom of the bowl to ensure all ingredients are thoroughly combined. Spread batter evenly into prepared pan.", "image_url": null}, {"order": 3, "description": "Bake until cake tester inserted into the middle of the cake comes out with a few moist crumbs attached, about 30 minutes. Allow cake to cool in the pan. Ice as desired. Store cake, covered, on the counter for up to three days.", "image_url": null}]}
{"name": "Improved Mendota Recipe", "description": "Think of this beer cocktail as a variation on the mimosa, but full of fresh and tangy flavor from grapefruit juice and hoppy IPA.", "servings": "makes 1 cocktail", "mainImageUrl": "https://www.seriouseats.com/thmb/CajHoW7Sgh3qbqY6TKf9cMGmKBs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__07__20120705-southpaw20bbq-6-25a6ad9071144998831a8e2f70ecd0ca.jpg", "ingredients": ["12 ounces chilled IPA or Double IPA (such as Ninkasi Tricerahops)", "3 ounces (6 tablespoons) freshly squeezed juice from 1 to 2 grapefruits", "Garnish: grapefruit twist"], "steps": [{"order": 0, "description": "Pour IPA into serving glass. Add grapefruit juice and stir very gently. Serve immediately, garnished with a grapefruit twist.", "image_url": null}]}
{"name": "Curry Paste with Peruvian Flair: Red Curry and Pink Peppercorn Meat Sauce Recipe", "description": "Learn more about pink peppercorns here » During the summer my thoughts turn to spicy fare. It makes you sweat, in a good way, and if you can&#39;t beat the heat, you may as well fight it on its own...", "servings": null, "mainImageUrl": null, "ingredients": ["1 pound ground beef, pork, or bison, lean but not devoid of fat", "4 tablespoons of red curry paste", "1 tablespoon of coriander, toasted and ground", "1 tablespoon of pink peppercorns, toasted and ground", "1 can of coconut milk", "1/4 cup of soy sauce", "2 tablespoons of Chinese rice wine", "Up to 1 tablespoon of sugar, to taste", "1 1/2 teaspoons of cornstarch dissolved in two teaspoons of water", "Juice of one lime", "Roughly chopped cilantro, for garnish"], "steps": [{"order": 0, "description": "Heat a large skillet on high heat for several minutes until water sizzles off instantly. Add your meat of choice and brown it well, salting aggressively. When the meat is browned and a little crispy, remove it with a slotted spoon to a plate lined with paper towels.", "image_url": null}, {"order": 1, "description": "Drain off all but a thin film of the fat and add the curry paste. Stir it constantly until it has slightly darkened in color and is intensely aromatic. Add the ground coriander and pink peppercorns and stir to incorporate for about 15 seconds.", "image_url": null}, {"order": 2, "description": "Add the coconut milk, soy sauce, and rice wine, scraping the bottom of the skillet to remove any browned bits. Stir to combine and let it all come to a boil, then reduce it to a simmer for about half an hour, or until the sauce has thickened, the flavors have melded, and the meat is tender.", "image_url": null}, {"order": 3, "description": "Raise the heat to high and pour in the cornstarch mixture to let the sauce thicken, stirring, for about a minute. Taste for salt and sugar, then add the lime juice off the heat.", "image_url": null}, {"order": 4, "description": "Add a good-sized ladle of sauce to a bowl of noodles, rice, or rice cakes, and garnish with some cilantro. This Recipe Appears In \n Spice Hunting: Pink Peppercorns", "image_url": null}]}
{"name": "Reveillon Cocktail Recipe", "description": "During the holidays even the most reluctant cooks take their shot in the kitchen. It&#39;s much the same with drinks. Those who would ordinarily get no more creative than opening a beer find themselves caught with the idea of mixing a fancy seasonal drink.", "servings": null, "mainImageUrl": "https://www.seriouseats.com/thmb/vBdaInVoXafcaBX7r3OmBORi0Vg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2015__12__20110118strainerprimary-db57364943d6467295d8215f2676b32c.jpg", "ingredients": ["2 ounces apple brandy", "1/2 ounce pear brandy (the clear, unsweetened eau de vie - Clear Creek has a good one)", "1/2 ounce St. Elizabeth Allspice Dram", "1/4 ounce good-quality sweet vermouth (Carpano Antica or Punt e Mes, or use Dubonnet)", "1 dash aromatic bitters"], "steps": [{"order": 0, "description": "Combine all ingredients in a mixing glass and fill with ice. Stir well for 30 seconds and strain into chilled cocktail glass. Garnish with a cinnamon stick or a piece of star anise. This Recipe Appears In \n 10 New Year's Eve Cocktails", "image_url": null}]}
{"name": "Toronto Cocktail", "description": "The Toronto Cocktail pairs the Italian bitter with the crispness of rye whiskey and a little sugar.", "servings": "makes 1 cocktail", "mainImageUrl": "https://www.seriouseats.com/thmb/yp16vjJpdE-T3vn5UO1yxKwThxE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2013__10__20131027toronto-39badd9c78bc42839eaf89d3ac7e038a.jpg", "ingredients": ["2 ounces rye whiskey", "1/4 ounce Fernet Branca", "1/4 ounce simple syrup", "2 dashes Angostura bitters"], "steps": [{"order": 0, "description": "Combine rye, Fernet, simple syrup, and bitters in a mixing glass and fill with cracked ice. Stir for 20 seconds and strain into chilled cocktail glass. Squeeze a piece of orange peel over the drink and use as garnish.", "image_url": null}]}
{"name": "Tonkatsu Sauce (Japanese-Style Barbecue Sauce)", "description": "This tonkatsu sauce is easy to throw together and perfect for serving with golden, crispy panko-crusted cutlets.", "servings": "makes about 1/2 cup", "mainImageUrl": "https://www.seriouseats.com/thmb/3ojzjVEZOPGlTK7qGeCjUVhXtMA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__09__20120919-223139-tonkatsu-sauce-d0d2ff91373243848605789d1f79b86f.jpg", "ingredients": ["1/3 cup ketchup", "2 tablespoons Worcestershire sauce", "1 tablespoon soy sauce", "1 tablespoon mirin", "1 tablespoon sugar", "1 teaspoon Dijon mustard", "1/4 teaspoon garlic powder"], "steps": [{"order": 0, "description": "In a small bowl, stir together ketchup, Worcestershire, soy sauce, mirin, sugar, mustard, and garlic powder. Use immediately or store in an airtight container in the refrigerator for up to a month.", "image_url": "https://www.seriouseats.com/thmb/v49idKlDWZw7p7TUu_wQo9Z6DdM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__20120919-223139-tonkatsu-sauce-step-1-4f7a22f65eb54c5283c18d2f2ab46424.jpg"}]}
{"name": "Tonkatsu (Japanese Breaded Pork Cutlets)", "description": "Crispy, golden-brown, and juicy breaded and fried pork cutlets, Japanese-style.", "servings": "Serves 2", "mainImageUrl": "https://www.seriouseats.com/thmb/HDqcye0uVz0epNLTqD3g2hCJr60=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250312PorkTonkatsu-FredHardy-08-26a58d83d15845d998763548d6b4f796.jpg", "ingredients": ["2 boneless, skinless chicken breast halves, about 8 ounces (225g) each; or 4 boneless, skinless chicken thighs, 4 to 5 ounces (110 to 140g) each; or 4 boneless pork sirloin cutlets, 4 to 5 ounces (110 to 140g) each", "Kosher salt and freshly ground black pepper", "1 cup all-purpose flour (about 5 ounces; 140g)", "3 large eggs, thoroughly beaten", "1 1/2 cups Japanese-style panko bread crumbs (about 5 ounces; 140g)", "Vegetable, canola, or peanut oil, for frying", "To Serve:", "Finely shredded green cabbage", "Lemon wedges", "Steamed white rice", "Japanese-style pickles (sunomono), optional", "Homemade or store-bought tonkatsu sauce"], "steps": [{"order": 0, "description": "Place cutlets, one at a time, in a heavy-duty zipper-lock bag and pound gently to 1/4-inch thickness using a meat pounder or the bottom of a heavy 8-inch skillet. Season generously with salt and pepper.", "image_url": "https://www.seriouseats.com/thmb/5F_76drRNsY7g4_s0z9o-wy7Ri4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250312PorkTonkatsu-FredHardy-00-4ea221ed3ca54d1ca5ed4e7e967019e0.jpg"}, {"order": 1, "description": "If using slices of fresh Japanese milk bread: Using a sharp or serrated knife, trim crust from milk bread; discard trimmings. Cut trimmed bread lengthwise into 1 1/2-inch-thick batons. Using a food processor fitted with the grater attachment, process bread into coarse flakes.", "image_url": "https://www.seriouseats.com/thmb/YomwrhPUhYOeadS8-V6xotE17R4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240308-SEA-KatsuSando-TwoBites-03-397927f698e44d07b4c50826b9261798.jpg"}, {"order": 2, "description": "Fill 3 wide, shallow bowls or high-rimmed plates with flour, beaten eggs, and panko, respectively. Working with one cutlet at a time, dredge in flour with your first hand, shaking off excess. Transfer to egg dish, then turn cutlet with your second hand to coat both sides. Lift and allow excess egg to drain off, then transfer to breadcrumb mixture. With your first hand, scoop breadcrumbs on top of cutlet, then gently press, turning to ensure a good layer of crumbs on both sides. Transfer cutlet to a clean plate and repeat with remaining meat. If this is done properly, your first hand should touch only dry ingredients, while your second hand should touch only wet, making the process less messy.", "image_url": "https://www.seriouseats.com/thmb/DZwqFUVe4mBozZzveFDl6x1CgOw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250312PorkTonkatsu-FredHardy-step2-f59eb80f57f0436ca7f90ee62de52e95.jpg"}, {"order": 3, "description": "Fill a large cast iron or stainless steel skillet with 1/3 inch oil. (To speed things up even more, use 2 skillets simultaneously.) Heat over high heat until shimmering and just shy of smoking, about 350°F (175°C) on an instant-read thermometer.", "image_url": "https://www.seriouseats.com/thmb/1YGkU456nmF7B63JXSNgKcMh64w=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250312PorkTonkatsu-FredHardy-05-b898527877f54e7284d447cb1cfcc888.jpg"}, {"order": 4, "description": "Using tongs or your fingers, gently lower cutlets into hot fat, laying them down away from you to prevent hot fat from splashing toward you. (Work in batches if necessary.) Fry, gently swirling pan and rotating cutlets for even browning, and adjusting heat as necessary for a steady, vigorous bubble (around 300 to 325°F; 150 to 160°C), until bottom side is set, about 1 1/2 minutes. Flip cutlets and fry until other side is set, about 1 1/2 minutes longer. Continue cooking, swirling frequently and flipping occasionally, until well browned on both sides, about 3 minutes longer. Transfer to paper towels to drain and season with salt right away. Repeat with remaining cutlets.", "image_url": "https://www.seriouseats.com/thmb/StDSPYNIxmTVfs2zo0IByrOE3ts=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250312PorkTonkatsu-FredHardy-06-b6ac175a89f3492b9e3f2c62f538f820.jpg"}, {"order": 5, "description": "Slice tonkatsu into thin strips and serve immediately with shredded cabbage, lemon wedges, white rice, Japanese pickles (if desired), and tonkatsu sauce.", "image_url": "https://www.seriouseats.com/thmb/-sfFVoxP9gPXIJme76Lyxe3xfFk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20250312PorkTonkatsu-FredHardy-07-3c9fa08a13774c00b194db05bdae7c24.jpg"}]}
{"name": "Summer Tomato Tonnato Salad", "description": "Italian tonnato (creamy blended tuna) sauce makes a nicely creamy accompaniment to peak summer tomatoes in this simple no-cook salad.", "servings": "Serves 4", "mainImageUrl": "https://www.seriouseats.com/thmb/8AE3FMikLOgIAI3RoOyLfjL0pX4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2019__08__20190809-tomato-tonnato-salad-vicky-wasik22-1c5fc90d14594703924c0920fa652493.jpg", "ingredients": ["For the Tonnato:", "1 large egg", "1/4 cup (60ml) fresh lemon juice (from 2 whole lemons), divided", "2 anchovy fillets (about 1/4 ounce; 7g)", "1 teaspoon (5ml) Dijon mustard", "1 teaspoon (5g) capers, drained", "1/2 cup (120ml) vegetable oil", "4 ounces (113g) oil-packed tuna, such as Ortiz, drained", "1/2 cup (120ml) extra-virgin olive oil", "Kosher salt and freshly ground black pepper", "For the Salad:", "2 pounds (900g) mixed ripe tomatoes (see note)", "2 tablespoons (30g) chopped Calabrian chilies", "Toasted black sesame seeds and coarse sea salt, for serving (optional)", "15 to 20 fresh basil leaves, large leaves torn and small leaves left whole"], "steps": [{"order": 0, "description": "For the Tonnato: Place egg, 2 tablespoons (30ml) lemon juice, anchovies, mustard, and capers in the bottom of an immersion blender cup or another tall-sided container that just fits the head of your immersion blender. Pour vegetable oil on top and allow to settle for 15 seconds. Place head of immersion blender at bottom of cup and turn it on high speed. Do not pulse or move the head. As mayonnaise forms, slowly tilt and lift the head of the immersion blender until all oil is emulsified; this should take between 30 and 45 seconds.", "image_url": "https://www.seriouseats.com/thmb/_KnfOnIeQ9A4CfoJCP3DPlu9IKY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2019__08__20190809-tomato-tonnato-salad-vicky-wasik3-1500x1125-9345012c71024c899648b98a9eddb4d9.jpg"}, {"order": 1, "description": "Turn off blender and remove from blender cup. Scrape down sides of cup using a rubber spatula, then add tuna and remaining 2 tablespoons (30ml) lemon juice. Return blender head to blender cup and blend just until tuna is thoroughly incorporated into a smooth sauce, 15 to 30 seconds. Avoid over-blending, as this can cause the sauce to become grainy.", "image_url": "https://www.seriouseats.com/thmb/LKR80yH6HA01pVdDCj4vMTiocW0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2019__08__20190809-tomato-tonnato-salad-vicky-wasik-version1-blending2-1500x1125-e19e9a934d1d49599358e90e6f7444f5.jpg"}, {"order": 2, "description": "Transfer sauce to a medium mixing bowl and slowly drizzle in olive oil while whisking constantly to emulsify. Season to taste with salt and pepper. Refrigerate sauce until ready to serve (see note).", "image_url": "https://www.seriouseats.com/thmb/8cMECUG_6YoKyPbRBXwPX3lV8Sc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2019__08__20190809-tomato-tonnato-salad-vicky-wasik8-1500x1125-9d6ded0e8d8f44679279213bb2e83105.jpg"}, {"order": 3, "description": "For the Salad: Using a sharp chef's knife or serrated knife , cut tomatoes into an assortment of slices, wedges, and bite-size pieces.", "image_url": null}, {"order": 4, "description": "Using a large spoon, spread tonnato in an even layer on a large serving plate or individual serving plates. Arrange tomatoes on top of tonnato, then dollop with small spoonfuls of Calabrian chiles. Sprinkle sesame seeds and sea salt (if using) over tomatoes, followed by basil leaves. If not using sea salt, season tomatoes with kosher salt. Serve immediately.", "image_url": null}]}
{"name": "Tomato-Mint Sauce Recipe", "description": "In essence, this is a simple marinara with the addition of mint, but that one minor change makes a big difference.", "servings": "makes about 4 cups", "mainImageUrl": "https://www.seriouseats.com/thmb/3PASomCiLZzvhnf0JLYNakqYJBw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2013__03__20130302-242913-tomato-mint-sauce-c5e0aa08301c42c28d647b9461cde6c9.jpg", "ingredients": ["3 tablespoons extra virgin olive oil", "1/4 cup finely chopped shallots (about 1 medium)", "2 teaspoons freshly minced garlic (about 2 medium cloves)", "1/4 teaspoon crushed red pepper", "1 (28-ounce) can of crushed tomatoes", "1/3 cup finely chopped fresh mint leaves", "1/4 cup finely chopped fresh basil leaves", "2 tablespoons freshly squeezed lemon juice from 1 lemon", "Kosher salt and freshly ground black pepper"], "steps": [{"order": 0, "description": "Heat oil in a medium saucepan over medium heat until shimmering. Add shallots and cook until softened, about 5 minutes. Stir in garlic and crushed red pepper and cook until fragrant, about 30 seconds.", "image_url": "https://www.seriouseats.com/thmb/L7MPsiERj01FtLnDuf5MRwu7iLo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__20130302-242913-tomato-mint-sauce-step-1-06e637d42ce54dbfa823929ed7b695a6.jpg"}, {"order": 1, "description": "Stir in tomatoes and bring to a boil. Reduce to low and simmer until sauce has slightly thickened, 15 to 20 minutes. Remove from heat.", "image_url": "https://www.seriouseats.com/thmb/nrO0aa58JHKcFljQjDhhZxUibt8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__20130302-242913-tomato-mint-sauce-step-2-1330b56853144a0fa93d18dc671e9178.jpg"}, {"order": 2, "description": "Stir in mint, basil, and lemon juice. Season with salt and pepper to taste. Use immediately or transfer to an airtight container and store in refrigerator for up to a week. This Recipe Appears In \n Sauced: Tomato-Mint Sauce", "image_url": "https://www.seriouseats.com/thmb/ALRk4EYjGpmdQhSgHKGcDmcZnqo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__20130302-242913-tomato-mint-sauce-step-3-6fa1c782bc1c4073ad13bcdc5134bae2.jpg"}]}
{"name": "Raspberry Dark Chocolate Macaroons Recipe", "description": "These fruit forward raspberry macaroons get a contrasting drizzle of dark chocolate. They make a great DIY gift on Valentine&#39;s Day.", "servings": "makes about 2 dozen cookies", "mainImageUrl": "https://www.seriouseats.com/thmb/AmbRo_ggDbWa1aoRzcysOC8SPXs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2013__02__201302-cookiemonster-chocraspmacaroons-e188804a798f4b0d8af64a663d931d23.JPG", "ingredients": ["14 1/2-ounces sweetened shredded coconut", "4 egg whites", "1/4 cup sugar", "1/2 teaspoon kosher salt", "1/2 teaspoon vanilla extract", "1 2/3 cups raspberries", "1/2 cup sliced almonds", "4 ounces dark chocolate"], "steps": [{"order": 0, "description": "Adjust oven racks to middle and upper positions and preheat oven to 325°F. Line two baking sheets with parchment paper.", "image_url": null}, {"order": 1, "description": "In the bowl of a food processor combine coconut, sugar, salt, vanilla, egg whites, and almonds. Pulse to combine, about 8 short pulses. Add raspberries and pulse until evenly distributed, about another 8 pulses. Use a medium size cookie scoop (2 3/4-inch diameter, 1 1/2 Tbsp) to scoop dough and drop it onto the prepared baking sheet in rounded balls. Bake cookies until golden in color and dry to the touch, 30-35 minutes.", "image_url": null}, {"order": 2, "description": "Let cookies cool for 5 minutes then transfer to a wire rack to cool completely. Melt chocolate in a double boiler or in the microwave. Drizzle chocolate over cookies and let stand until hardened.", "image_url": null}]}
{"name": "Tomato Jam", "description": "Tomatoes are perfect candidates for end-of-the-summer jam and this jam is absolutely delicious on a BLT, a grilled cheddar cheese sandwich, on burgers, or as an accompaniment to fish.", "servings": "Makes 3 half-pints", "mainImageUrl": "https://www.seriouseats.com/thmb/rmscaOgfJle3gEhD8HPN8UAvgd8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__08__20120820-tomato-jam-primary-d0db45af1e9b43f4896e8efc37ed2d7b.jpg", "ingredients": ["3 pounds best quality tomatoes, cored and chopped", "2 cups granulated sugar", "1/4 cup freshly squeezed lemon juice", "1 tablespoon freshly grated ginger", "2 teaspoons red pepper flakes", "1 teaspoon salt", "1/2 teaspoon cinnamon", "1/4 teaspoon cumin", "2 tablespoons liquid pectin (optional)"], "steps": [{"order": 0, "description": "If you are going to preserve jam, prepare jars and lids: place 3 half-pint jars on a rack in a large pot. Add enough water to cover jars, and bring to a boil over high heat. Boil for 10 minutes, then turn off heat and allow jars to rest in hot water. Meanwhile, put bands and lids in a small saucepan and cover with water. Heat over medium heat until water is simmering, then remove pan from heat and allow bands and lids to rest in hot water until ready to use.", "image_url": null}, {"order": 1, "description": "Combine tomatoes, sugar, lemon juice, ginger, red pepper flakes, salt, cinnamon, and cumin in a large, heavy-bottomed pot and bring to a boil over medium-high heat, stirring frequently. Reduce heat and simmer until mixture reaches a thick, jam-like consistency, about 2 1/2 hours. Stir in pectin (if using) and simmer for 1 minute more.", "image_url": null}, {"order": 2, "description": "Ladle hot jam into hot sterilized jars, leaving 1/4-inch headspace. Wipe rims of jars, cover with lids, and screw bands on until just barely tight. Place jars on rack in pot and cover completely with water. Cover pot and bring to a boil over high heat. Boil for 15 minutes. Turn off heat, uncover pot, and allow jars to rest in water for 5 minutes. Remove jars from pot and allow them to rest undisturbed on countertop for 6 hours or overnight.", "image_url": null}]}
{"name": "Tangy and Sweet Tomato-Bacon Jam With Onions and Garlic Recipe", "description": "This savory jam is loaded with onions and tomatoes that have been cooked in bacon fat until thick and spreadable. A touch of maple syrup, brown sugar, balsamic vinegar, and Dijon mustard gives it a sweet-tart edge that would be as good on a burger as it would served alongside a wedge of cheese.", "servings": "Serves 8", "mainImageUrl": "https://www.seriouseats.com/thmb/l3EJLO1fjl-DduT05Bz1xI1kNCM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2014__08__20140809-Tomato-Bacon-Jam-Jennifer-OlveraT-6b8e4f0a058b478694b27efe04b735a9.JPG", "ingredients": ["1/2 pound thick-cut bacon, chopped", "1 large yellow onion, thinly sliced", "2 medium cloves garlic, minced", "1/2 cup pure maple syrup", "1/4 cup balsamic vinegar", "2 tablespoons Dijon mustard", "1 tablespoon Worcestershire sauce", "1 cup fresh ripe diced tomatoes", "1 tablespoon brown sugar", "1/2 teaspoon freshly ground black pepper", "1/4 teaspoon crushed red pepper", "1 bay leaf"], "steps": [{"order": 0, "description": "Cook bacon in a heavy-bottomed saucepan over medium heat until browned, about 5 minutes. Add onions and garlic and cook, stirring, until translucent and softened, 5 to 7 minutes. Drain excess bacon grease from pan.", "image_url": null}, {"order": 1, "description": "Stir in remaining ingredients and reduce heat to low. Simmer uncovered, stirring occasionally, until reduced and thickened to a jam-like consistency, about 1 hour. Discard bay leaf.", "image_url": null}, {"order": 2, "description": "Transfer to a blender and pulse to combine, leaving some chunks. Use immediately, or store in the refrigerator for up to 3 days.", "image_url": null}]}
{"name": "Cantonese-Style Tofu, Pine Nut, and Jicama Lettuce Cups (San Choi Bao) Recipe", "description": "The inspiration for this recipe comes from the san choi bao I grew up eating in New York&#39;s Chinatown, which were filled with minced squab stir-fried with pine nuts and finely diced water chestnuts and vegetables. The mix of crunchy, crisp, and tender bits works just as well with a new set of vegetable-based ingredients.", "servings": "Serves 4", "mainImageUrl": "https://www.seriouseats.com/thmb/MejWNJ7grB2LSYI5CKBW88PFIGk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2016__03__21060307-tofu-pinenut-jicama-lettuce-wrap-recipe-vegan-14-ec2492563730486abe7c856fda3819f4.jpg", "ingredients": ["1 (14-ounce; 400g) block firm tofu", "1 tablespoon (15ml) Shaoxing wine or dry sherry", "1 tablespoon (15ml) dark soy sauce", "2 teaspoons (10ml) Chinese black vinegar or cider vinegar", "4 tablespoons (60ml) hoisin sauce, plus more for serving", "2 teaspoons (10ml) chili sauce, such as Sriracha or sambal oelek (optional)", "1 teaspoon (about 3g) cornstarch", "1 1/2 ounces pine nuts (40g; about 1/4 cup)", "1/4 cup (60ml) vegetable oil, divided", "2 1/2 ounces shiitake mushrooms, stems removed, cut into 1/4-inch dice (70g; about 1 cup diced)", "3 scallions, white and pale green parts only, thinly sliced", "3 medium cloves garlic, minced (about 1 tablespoon; 15ml)", "1 (1-inch) knob ginger, minced (about 1 tablespoon; 15ml)", "4 ounces jicama, peeled and cut into 1/4-inch dice (about 1/2 of an apple-sized jicama; 120g) (see note)", "2 ounces celery, cut into 1/4-inch dice (about 1 large stalk; 60g)", "Handful chopped fresh cilantro leaves", "Kosher salt", "Ground white pepper", "1 head iceberg or green leaf lettuce, picked into individual leaves, stored in ice water until ready to use"], "steps": [{"order": 0, "description": "Cut tofu into 1/4-inch slabs. Press firmly between paper towels to remove excess moisture, then cut into 1/4-inch dice. Set aside.", "image_url": "https://www.seriouseats.com/thmb/uTKaCqotAy3vH2X-Zfrv47iqju8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__images__2016__03__21060307-tofu-pinenut-jicama-lettuce-wrap-recipe-vegan-03-6769f953d09d496cb860e1d8f07b32c2.jpg"}, {"order": 1, "description": "Combine Shaoxing wine, soy sauce, vinegar, hoisin sauce, chili sauce (if using), cornstarch, and 1 tablespoon (15ml) water in a small bowl and mix with a fork until homogeneous. Set aside.", "image_url": null}, {"order": 2, "description": "Combine pine nuts and 1 tablespoon (15ml) oil in a wok and place over medium heat. Cook, stirring frequently, until nuts are well toasted, about 5 minutes. Transfer to a large bowl and set aside.", "image_url": null}, {"order": 3, "description": "Add 1 tablespoon oil to wok and heat over high heat until lightly smoking. Add tofu and cook, stirring occasionally, until tofu is well browned all over, 6 to 8 minutes. Transfer to bowl with pine nuts.", "image_url": null}, {"order": 4, "description": "Add 1 tablespoon oil to wok and heat over high heat until lightly smoking. Add shiitakes and cook, stirring occasionally, until well browned all over, about 3 minutes. Transfer to bowl with tofu and pine nuts.", "image_url": null}, {"order": 5, "description": "Heat remaining tablespoon oil in wok over high heat until lightly smoking. Add scallions, garlic, and ginger and cook, stirring and tossing constantly, until fragrant, about 15 seconds. Add jicama and celery and toss to combine. Return tofu, mushrooms, and pine nuts to wok and toss to combine. Stir sauce with a fork to reintegrate any cornstarch that may have settled to the bottom, then add to wok. Cook, tossing and stirring constantly, until all vegetables are evenly coated in sauce. Stir in cilantro (reserve a little for garnish) and season to taste with salt and white pepper. Transfer to a warm serving platter and sprinkle with reserved cilantro.", "image_url": "https://www.seriouseats.com/thmb/GGIipGPSV8BzyNIE8pXrxyW8T4Q=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__21060307-tofu-pinenut-jicama-lettuce-wrap-recipe-vegan-07-composite-2be3d025c2ac44ffa44d90fc761a6a12.jpg"}, {"order": 6, "description": "Serve immediately. To eat, spread a little hoisin sauce on the bottom of a lettuce leaf and spoon the filling into the lettuce. Eat with your hands.", "image_url": null}]}
{"name": "Absinthe Frappe Recipe", "description": "Now that new bottlings of absinthe are all over, and it&#39;s high time to rediscover this pleasant drink. There are several ways of mixing an Absinthe Frappe. Here are two versions that are both very refreshing, and are sure to enliven a summer late afternoon.", "servings": "makes 1 cocktail", "mainImageUrl": "https://www.seriouseats.com/thmb/g8gtSB8H5gnQPZkKCr1b8DGkWDo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2013__06__20130610frappe-prim-9bdbb571ff4641a782524ac3073a7d6d.jpg", "ingredients": ["1 ounce absinthe", "1 teaspoon sugar (or to taste)", "1 dash anisette (optional)", "Chilled soda water"], "steps": [{"order": 0, "description": "Add ingredients to a cocktail shaker and stir until sugar is dissolved (or you can make life easier by just using simple syrup). Fill shaker with ice and shake well for 10 seconds; strain into a chilled highball glass and top with two ounces of chilled soda water (or more, to taste).", "image_url": null}, {"order": 1, "description": "For a longer, colder drink, fill the chilled highball glass with crushed ice, and strain the drink over ice before adding the soda water. You may wish to add less soda to this version, as the ice will provide additional dilution.", "image_url": null}]}
{"name": "Khao Khua (Thai Toasted-Rice Powder) Recipe", "description": "Slow and steady is the best way to coax deep, nutty flavors out of toasted-rice powder.", "servings": "Makes 1/2 cup (100g)", "mainImageUrl": "https://www.seriouseats.com/thmb/Z3nIoZWmIYn0_uxItWgJLqp7KVI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2019__04__20190416-pork-shoulder-vicky-wasik-59-1a97ad68814c4c6bbc8325746ef90c19.jpg", "ingredients": ["1/2 cup Thai sticky rice (3 1/2 ounces; 100g); see note"], "steps": [{"order": 0, "description": "Place rice in a 12-inch stainless steel skillet and shake pan to distribute grains into an even layer. Cook over medium heat, shaking skillet frequently to redistribute rice into an even layer, until rice is lightly golden, about 10 minutes. If rice begins to scorch, lower heat to medium-low.", "image_url": "https://www.seriouseats.com/thmb/xgcF1_3SAoMb87TaeAoMSxQwPwE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2019__04__20190416-pork-shoulder-vicky-wasik-11-23e646134cf3428da49195fb90d42f27.jpg"}, {"order": 1, "description": "Continue to cook, shaking skillet frequently, until rice is deep golden brown, 15 to 20 minutes longer. Remove from heat, transfer rice to a rimmed baking sheet, and let cool to room temperature, 5 to 8 minutes.", "image_url": "https://www.seriouseats.com/thmb/dT7swhGCAw3oOoJ-2owOD3oKk3w=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2019__04__20190416-pork-shoulder-vicky-wasik-17-ff2cd6323a2e45098c3384206ed0b60d.jpg"}, {"order": 2, "description": "Transfer toasted rice to a spice grinder or the bowl of a mortar and pestle. Grind to a coarse powder with a texture similar to that of ground coffee used for pourover brewing. Allow rice powder to cool to room temperature, then store in a dry, airtight container.", "image_url": "https://www.seriouseats.com/thmb/mWTzpVu0r0LqhiQyD_4F-BP8QlU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2019__04__20190416-pork-shoulder-vicky-wasik-19-1500x1125-b0f32e71ab4b41dea9401a94641927a0.jpg"}]}
{"name": "Lao Hu Cai (Tiger Salad), à la Xi&#39;an Famous Foods", "description": "Savory, refreshing, and tart, this dish is inspired by the lao hu cai, or &#34;tiger vegetable salad,&#34; served at Xi&#39;an Famous Foods.", "servings": "Serves 2 as a side dish", "mainImageUrl": "https://www.seriouseats.com/thmb/fB_4xURPuvRqlGumzIDIkc4gD_Q=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2019__06__20190529-tiger-salad-vicky-wasik-9-188950adcc184980b41cf7dc31fe2377.jpg", "ingredients": ["3 celery ribs (5 ounces; 140g), preferably cut from closer to the heart, peeled of tough fibers and cut into quite thick matchstick lengths", "1/2 long hot green pepper (1/2 ounce; 14g), split in half, each half then cut on a bias (see note)", "2 scallions, sliced thinly on a bias (2 ounces; 56g)", "1 small bunch cilantro leaves and tender stems, torn by hand or chopped into 3-inch lengths (1 ounce; 28g)", "1 tablespoon (15ml) rice vinegar", "3/4 teaspoon Diamond Crystal kosher salt; if using table salt, use half as much by volume", "3/4 teaspoon sugar", "1/4 teaspoon soy sauce", "1 teaspoon sesame oil", "2 tablespoons tiny dried shrimp (0.2 ounce; 6g); see note"], "steps": [{"order": 0, "description": "In a medium mixing bowl, combine celery, long hot green pepper, scallions, and chopped cilantro.", "image_url": null}, {"order": 1, "description": "In a small bowl, combine rice vinegar, salt, and sugar, then stir to dissolve the salt and sugar completely. Add soy sauce and sesame oil and stir to combine.", "image_url": null}, {"order": 2, "description": "Pour dressing over vegetables, tossing to ensure thorough distribution.", "image_url": "https://www.seriouseats.com/thmb/D9YQ_wmpNKeRgNc4zeom0mfn2hw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2019__06__20190529-tiger-salad-vicky-wasik-7-1500x1125-76395ea2c90d45ceadb77cea05ca774a.jpg"}, {"order": 3, "description": "Mound vegetables on a serving plate and sprinkle dried shrimp all over the top. Serve immediately.", "image_url": null}]}
{"name": "Thomas Keller&#39;s One-Pot Roast Chicken Recipe | Cook the Book", "description": "Roasting a chicken is one of the most indispensable skills that a cook can hone, and no one has been championing the simple joys of a roast chicken more than Thomas Keller. So it&#39;s not surprising Keller chose to contribute a recipe for One-Pot Roast Chicken to In The Green Kitchen by Alice Waters, a collection of essential skills for home cooks.", "servings": "4", "mainImageUrl": "https://www.seriouseats.com/thmb/7bggK7u6grXnMogw0qlJOWAOiNg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__20100420greenkitchenonepotchicken-e0083ec1a8d84b88bcb7fea0197a394c.jpg", "ingredients": ["One 3-pound chicken", "Salt and fresh-ground black pepper", "3 potatoes, peeled and thickly sliced", "2 carrots, peeled and thickly sliced", "2 onions, peeled and quartered", "2 celery stalks, thickly sliced", "4 large shallots, peeled", "Fennel, squash, turnips, parsnips, or other vegetables (optional)", "2 bay leaves", "2 or 3 thyme sprigs", "2 to 3 tablespoons butter"], "steps": [{"order": 0, "description": "First prepare the chicken. To remove the wishbone at the top of the breast, use a small knife to scrape along the bone to expose it, then insert the knife and run it along the bone, separating it from the flesh. Use your fingers to loosen it further, grasp the tip of the wishbone, and pull it out. Tuck the wing tips back and under the neck.", "image_url": null}, {"order": 1, "description": "Tying the chicken plumps the breast up and brings the legs into position for even roasting. Cut a length of cotton string. With the chicken on its back, slip the string under the tail and bring the ends up over the legs to form a figure eight. Loop over the end of each leg and draw the strings tight to bring the legs together. Draw the string back under the legs and wings on either side of the neck. Pull tight, wrap one end around the neck, and tie off the two ends. Salt the chicken evenly all around. Coarse salt has a good texture of large grains that makes it easy to calibrate how much salt you are putting on the chicken; sprinkle it from up high, so that it falls like snow. Season liberally with fresh-ground pepper.", "image_url": null}, {"order": 2, "description": "Preheat the oven to 375°F, put all the vegetables and herbs together in the bottom of a large, heavy ovenproof pot, and season with salt and pepper. Set the chicken on top, dot with the butter, and roast uncovered for 45 to 60 minutes (or longer), depending on the size of the chicken. It is done when the leg joint is pierced with a knife and the juices run clear, not pink.", "image_url": null}, {"order": 3, "description": "Let the chicken rest for a few minutes before carving, and serve family-style with all of the caramelized vegetables and juices from the pot on a platter and the chicken pieces on top.", "image_url": null}]}
{"name": "Thin and Tender Flour Tortillas Recipe", "description": "Thin and semi-translucent thanks to plenty to lard, these flour tortillas are light and tender, with a mild yet delicious flavor. They&#39;re a perfect accompaniment to grilled and roasted meats and seafood like skirt steak, chicken, and shrimp, but we wouldn&#39;t be surprised if you also just ate a stack of them by themselves.", "servings": "Makes 10 tortillas", "mainImageUrl": "https://www.seriouseats.com/thmb/ugffW_tWUf1KIvEwbbAYkyduOk0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2015__04__20150409-thin-and-tender-flour-tortillas-joshua-bousel-ce70e4e393de4e08ba2b8810cc925116.jpg", "ingredients": ["2 cups all-purpose flour", "1 teaspoon of kosher salt", "1/4 cup cold lard, preferably back lard (see note)", "3/4 cups cold water"], "steps": [{"order": 0, "description": "Place flour and salt in the workbowl of a food processor fitted with a steel blade and pulse to combine. Add lard and pulse until mixture resembles coarse crumbs. Add water and process until a cohesive dough forms.", "image_url": "https://www.seriouseats.com/thmb/3oIO27oo9pyfObGymbflyWgB2jM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__20150409-thin-and-tender-flour-tortillas-step-1-joshua-bousel-dc7a109b9fcc49ceb69abf51ad8e07bf.jpg"}, {"order": 1, "description": "Turn dough out onto a lightly floured work surface and knead until smooth, about 1 minute. Cover with a damp cloth or plastic wrap and let rest for 10 minutes. Divide dough into 10 equal pieces; roll each piece of dough into a ball. Cover dough with a damp cloth or plastic wrap and let rest an additional 15 minutes.", "image_url": "https://www.seriouseats.com/thmb/68hhSWOgqIpH3DBmBvn9GeKn3Kg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__20150409-thin-and-tender-flour-tortillas-step-2-joshua-bousel-9b7ebc72860146faa56b9f597898755a.jpg"}, {"order": 2, "description": "Heat cast iron skillet, griddle, or comal over medium-high heat. Meanwhile, place one ball of dough on a lightly floured work surface and pat down into a flat disc. Using a rolling pin, roll dough out to a very thin 8-inch round. Place dough in skillet and cook until bubbles form on top side and bottom side has light browned spots, 15-30 seconds. Flip tortilla and cook until second side develops light browned spots, 15-30 seconds longer. Transfer tortilla to a plate and cover with dish cloth. Repeat with remaining balls of dough. Serve immediately while still warm.", "image_url": "https://www.seriouseats.com/thmb/6ZSCXut6_faxF5tEbAvMPXqGGIw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__20150409-thin-and-tender-flour-tortillas-step-3-joshua-bousel-d0dbb791d58e4b6298683d478b65434d.jpg"}]}
{"name": "Herb-Marinated Steak and Soft Scrambled Eggs Recipe", "description": "Herb-marinated steak makes a hearty brunch with eggs.", "servings": "Serves 4", "mainImageUrl": "https://www.seriouseats.com/thmb/1d1XLJiC7FaxCZtT4_jWSVM2Zwc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2013__05__251038-20130511-sunday-brunch-herby-steak-creamy-eggs-f47c68fe6bfe41229643bb1b9b98e04c.JPG", "ingredients": ["For the Steak:", "2 sprigs oregano, finely chopped", "3 sprigs thyme, finely chopped", "1 sprig tarragon, finely chopped", "5 sprigs cilantro, finely chopped", "3 sprigs parsley, finely chopped", "2 garlic cloves, finely chopped", "1 thai chili, finely chopped (or 1/2 teaspoon red pepper flakes)", "1/4 cup olive oil", "Juice of 1 lime", "Kosher salt and cracked black pepper", "1 1/2 pounds sirloin tips", "For the Eggs:", "8 eggs, beaten", "1 tablespoon plus 1 teaspoon butter", "Kosher salt and cracked black pepper", "Chopped chives, to garnish", "Toast, to serve"], "steps": [{"order": 0, "description": "For the Steak: In a large bowl, mix together oregano, thyme, tarragon, cilantro, parsley, garlic, chile, olive oil, and lime juice until all ingredients are evenly incorporated, then season to taste with salt and pepper. Or, combine all ingredients in a food processor and pulse until an even paste is formed.", "image_url": null}, {"order": 1, "description": "Pour herb mixture over steak tips and mix until the steak is evenly coated. Using a fork, pierce each piece of steak on all over. Allow to sit for at least 1 hour, and up to overnight in the fridge.", "image_url": null}, {"order": 2, "description": "When ready to cook, preheat your grill pan or grill to a high heat, then sear steaks until the center of the thickest piece of each steak is 135°F (57°C) for medium rare, let the steak tips rest while you cook your eggs.", "image_url": null}, {"order": 3, "description": "For the Eggs: In a large non-stick skillet, melt the butter over medium low heat. When butter is melted add the eggs. Cook over medium low heat until eggs are softly cooked and custardy.", "image_url": null}, {"order": 4, "description": "Slice the steak and divide between four plates. Divide the eggs between the plates as well and serve garnished with chopped chives and toast.", "image_url": null}]}
{"name": "Thick and Juicy Burgers Recipe", "description": "Note: Want to learn about the science behind big burgers? Check it out here....", "servings": "4 half pound burgers", "mainImageUrl": "https://www.seriouseats.com/thmb/TeUu8SGzTB1Z1zlR0SKKeiGidMA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__images__2016__04__20160428-memorial-day-burger-recipes-roundup-01-3a2e65d344b94861b8ab1977bbc0bfc1.jpg", "ingredients": ["2 pounds freshly ground beef", "Kosher salt and freshly cracked black pepper", "2 teaspoons vegetable oil", "4 burger buns, toasted", "Toppings and condiments to taste."], "steps": [{"order": 0, "description": "Set oven rack to lower middle position and preheat oven to 200°F (95°C). Divide meat into four even 1/2-pound portions. Form into four 4-inch-wide patties, leaving slight depression in center of each. Season liberally with kosher salt and black pepper and place patties on wire rack set in rimmed baking sheet. Place in oven and cook until center of each patty registers 120°F (50°C) on an instant read thermometer for medium rare (110°F (44°C) for rare, 135 °F (57°C) and up for medium well to well), 15 to 30 minutes (time may vary depending on oven temperature cycling). Tent burgers loosely with foil.", "image_url": null}, {"order": 1, "description": "Add vegetable oil to 12-inch heavy-bottomed stainless steel or cast iron skillet and heat over high heat until smoking. Add burger patties and cook until browned crust develops on first side, 45 seconds to 1 minute 15 seconds. Flip patties. Add cheese if desired. Cook until second side develops dark brown crust, additional 45 seconds to 1 minute 15 seconds. Transfer to buns, top as desired, and serve immediately. This Recipe Appears In \n The Burger Lab: How Often Should You Flip a Burger?", "image_url": null}]}
{"name": "The Ultimate Sliders Recipe", "description": "There&#39;s more than meats the eye between these diminutive buns.", "servings": "a dozen sliders", "mainImageUrl": "https://www.seriouseats.com/thmb/fai8MurJrAVqRuvV_-m3aX3RRHw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__20100326-sliders-beauty-eb876ec131354602837219daaefcd659.jpg", "ingredients": ["1 large onion, finely minced (about 2 cups)", "Kosher salt", "1 1/8 pounds freshly ground beef", "1 medium onion, peeled and grated on the medium holes of a box grater, juices and pulp reserved (about 1 1/2 cups)", "Freshly ground black pepper", "12 silce American cheese (optional)", "16 slider-sized buns (about 2 1/2- to 3-inches across)", "24 thin dill pickle slices", "Condiments, as desired"], "steps": [{"order": 0, "description": "Toss diced onion with 1 teaspoon kosher salt in a medium bowl. Set aside at room temperature until fragrant, about 10 minutes. Meanwhile, divide beef into 12 evenly sized balls. Using damp hands, press balls into even patties approximately 1/8-inch thick, and 3 1/2-inches wide. Place on a large plastic wrap-lined plate. Patties can be stacked with a layer of plastic wrap between each layer. Place in refrigerator until ready to cook.", "image_url": null}, {"order": 1, "description": "Preheat a heavy-bottomed 12-inch skillet over medium-low heat until evenly heated, about 5 minutes. Reduce heat to low, and add half of diced onion, using spatula to spread into even layer across bottom of pan. Cook without moving until bottom of onions starts turning pale golden brown, about 5 minutes (onions should barely sizzle while cooking—adjust heat as necessary).", "image_url": null}, {"order": 2, "description": "Add half of grated onions and their juice to skillet. Stir onions with rubber spatula to release browned bits from bottom of pan and spread into thin, even layer. Arrange 6 hamburger patties on top of onion mixture. Season top of patties with salt and pepper. Add 6 slices of American cheese if desired. Place bun bottoms, cut-side-down, on top of patties. Place bun tops, cut-side-down, on top of bun bottoms, staggering arrangement to maximize exposure to steam.", "image_url": null}, {"order": 3, "description": "Continue cooking over low heat until burgers are cooked through and cheese is fully melted, about 3 minutes, adding extra onion juice if pan runs dry, making sure to reserve at least half for second batch (there should be no sizzling sound, and mixture should steam constantly—in some rare cases, substituting water may be necessary if onion juice all runs out). Remove from heat.", "image_url": null}, {"order": 4, "description": "Lift bun with spatula. Pick up bun top, invert, and place underneath spatula (burger should now be fully assembled, upside down). Slide spatula out from between burger and bun top. Invert, and place on plate. Repeat with remaining 5 burgers. Spoon any remaining onions and melted cheese in skillet on top of each burger patty, along with 2 pickles, and condiments as desired. Consume immediately, before repeating with remaining 6 sliders.", "image_url": null}]}
{"name": "Dinner Tonight: Broccoli Rabe with Asian Flavors Recipe", "description": "My go-to broccoli rabe recipe is really simple. Just boil the broccoli rabe for a few minutes, then saute with some olive oil, garlic, and red pepper flakes. I love how the heat of the chili plays with the slight...", "servings": "2 to 3", "mainImageUrl": "https://www.seriouseats.com/thmb/31TCdtZmiOvHPL1nIkVu_1dO3DU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__dt-broccolirabewithasianflavors-35c6268d5dea4d7ca7e10af55dd4cbe7.jpg", "ingredients": ["1 bunch broccoli rabe", "1 tablespoon soy sauce", "1 1/2 teaspoons rice vinegar", "1 teaspoon toasted sesame oil", "1 teaspoon sugar", "2 teaspoons salt", "2 tablespoons canola oil", "3 garlic cloves, minced", "1/4 teaspoon red pepper flakes", "1/2 teaspoon minced fresh ginger."], "steps": [{"order": 0, "description": "Cut the bottom 2 inches off broccoli rabe stems. Roughly chop the leaves into 1-inch pieces. Bring a large pot of water to a boil. Add the broccoli rabe and cook for 2 to 3 minutes, or until tender. Drain in a colander, then dunk in a bowl of ice water. When cool, dry and set aside.", "image_url": null}, {"order": 1, "description": "In a small bowl, whisk together the soy sauce, rice vinegar, sesame oil, and sugar.", "image_url": null}, {"order": 2, "description": "In a large skillet, heat oil over medium heat until shimmering. Add the garlic, red pepper flakes, and ginger and cook for 2 to 3 minutes. Turn the heat up to medium-high, and add the chopped broccoli rabe and the soy sauce mixture. Stir well, and cook for about a minute until the broccoli rabe is warmed and the sauce has thickened. Season with salt and serve.", "image_url": null}]}
{"name": "The Best Bloody Mary Recipe", "description": "How to make the best bloody Mary? Skip the mix and doctor up your tomato juice from scratch with horseradish, Worcestershire, and hot sauce.", "servings": "makes 1 cocktail", "mainImageUrl": "https://www.seriouseats.com/thmb/sLMvhR4uyBmj5cL8xLH8BQjG14I=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230908-SEA-BloodyMary-TwoBites-hero-ace8a18066504a94ae50222dcedfc140.jpg", "ingredients": ["1 tablespoon celery salt or (or plain kosher salt, if you prefer)", "1/4 lemon, cut into two wedges", "1/2 teaspoon Worcestershire sauce", "1/4 teaspoon soy sauce", "1/2 teaspoon freshly ground black pepper (or less to taste)", "Dash cayenne pepper", "1/4 teaspoon hot sauce (such as Franks)", "1/2 teaspoon freshly grated horseradish (or 1 teaspoon prepared horseradish)", "2 ounces vodka", "4 ounces high-quality tomato juice", "1 stick celery"], "steps": [{"order": 0, "description": "Place celery salt in a shallow saucer. Rub rim of a 12-ounce tumbler with 1 lemon wedge and coat wet edge with celery salt. Place lemon wedge on rim of glass. Fill glass with ice.", "image_url": "https://www.seriouseats.com/thmb/pUI6toOKcK8QQ_V0lR32EKjHjeg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230908-SEA-BloodyMary-TwoBites-Step1-1b47f05b6030438b8615c699dceb4899.jpg"}, {"order": 1, "description": "Add Worcestershire, soy, black pepper, cayenne pepper, hot sauce, and horseradish to bottom of cocktail shaker. Fill shaker with ice and add vodka, tomato juice, and juice of remaining lemon wedge. Shake vigorously, taste for seasoning and heat, and adjust as necessary. Strain into ice-filled glass. Garnish with celery stalk and serve immediately.", "image_url": "https://www.seriouseats.com/thmb/LGSnbLYG6hMqCpBVD8lW1A8mTtU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230908-SEA-BloodyMary-TwoBites-Step2-858ca1e7b49a47c7bbb2f196ace9efb1.jpg"}]}
{"name": "Braised Leeks With Lemon and Parsley", "description": "These braised leeks are silky, tender, and incredibly easy to prepare.", "servings": "8 to 10", "mainImageUrl": "https://www.seriouseats.com/thmb/3ZIWx9i47_Y8Ux38zFcVbvNWWmc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/10242022-BraisedLeeks-FredHardy-06-82bc720302ec4747b44dab42a5174f0f.JPG", "ingredients": ["2 tablespoons extra-virgin olive oil, plus more for serving", "12 to 16 large leeks, white and light green parts only, rinsed, split in half lengthwise", "Kosher salt and freshly ground black pepper", "1/2 cup dry white wine", "1 cup low-sodium chicken broth", "2 tablespoons unsalted butter", "3 tablespoons chopped fresh parsley leaves", "2 teaspoons juice and 2 teaspons zest from one lemon"], "steps": [{"order": 0, "description": "Trim leeks to remove root ends, tough or damaged outer layers, and dark green top parts; reserve trimmings for stock if desired. Cut leeks in half lengthwise, then rinse each leek half under cold, running water, gently fanning layers open while being careful to keep leek halves intact, to wash away any sand or grit. Pat dry.", "image_url": "https://www.seriouseats.com/thmb/Vvg4W-VCg2d3OvkBmFy8p9F5kvA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/10242022-BraisedLeeks-FredHardy-Step1-f6b4d898dfd04ed6937aa01e329592c2.JPG"}, {"order": 1, "description": "Preheat oven to 325°F (160°C) and adjust oven rack to middle position. Heat oil in a 12-inch heavy-bottomed skillet over medium-high heat until shimmering. Working in 2 batches, add as many leeks as you can fit in a single layer cut side down. Cook, pressing down gently with a spatula and shaking occasionally, until well browned, about 3 minutes. Transfer leeks to a 9- by 13-inch baking dish, arranging them in a single layer, cut-side up. Repeat with remaining leeks until all leeks are browned.", "image_url": "https://www.seriouseats.com/thmb/EyuFeiX3-S7XOA551hPv65zWKSs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/10242022-BraisedLeeks--FredHardy-Step02-230ac821e9f1492e800216590be4970d.JPG"}, {"order": 2, "description": "Pour wine and chicken broth into the skillet; bring to a simmer. Sprinkle leeks all over with salt and pepper, dot with butter, and then pour hot wine and broth mixture on top. Cover tightly with aluminum foil and bake for 30 minutes. Remove foil and continue to cook until leeks are completely tender and translucent, about 20 to 30 minutes longer, depending on thickness of the leeks.", "image_url": "https://www.seriouseats.com/thmb/Wkaguf3kP2bIMYzdDwiEhrgxeIg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/10242022-BraisedLeeks--FredHardy-Step3-475099fa67364349a3934f317e3ef0a9.JPG"}, {"order": 3, "description": "Using a slotted spatula, carefully transfer leeks to a serving platter. Season lightly with salt. Transfer pan juices to a small saucepan (you should have about 1/2 cup). Bring to a simmer over high heat and cook until sauce is emulsified and reduced to about 1/4 cup, 5 to 10 minutes. Stir in parsley, lemon juice, and lemon zest, and season with salt and pepper. Pour braising sauce over leeks and serve, drizzling with extra olive oil if desired.", "image_url": "https://www.seriouseats.com/thmb/k1s8EAu4N6YnGr4eOp6RsFnIg1A=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/10242022-BraisedLeeks-FredHardy-05-f0318e8a6cfd4fee9974a3da8dda2b5a.JPG"}]}
{"name": "Whole Roasted Suckling Pig", "description": "Whole tender, juicy, crisp-skinned suckling pig for the holiday table.", "servings": "Serves 12 to 16", "mainImageUrl": "https://www.seriouseats.com/thmb/g2PyHmP61A9zXGxTHsHrOSelt0c=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2015__12__20111204-suckling-pig-08-31a246ea62824f1793626138def0f3ed.jpg", "ingredients": ["1 whole suckling pig, about 20 pounds (see note)", "Kosher salt and freshly ground black pepper", "20 whole cloves garlic", "One 6-inch piece fresh ginger, cut into 1/2-inch slivers"], "steps": [{"order": 0, "description": "Preheat oven to 300°F (150°C). Have a large work table ready and lined with plastic to make cleanup easier. Season pig inside and out with plenty of salt and pepper. Fill cavity with garlic and ginger. If pig fits on a single rimmed baking sheet or roasting pan, place it on the baking sheet back-side-up and transfer to the oven. If pig is too large, remove a rack from the oven and place on your range. Overlap 2 rimmed baking sheets so that they fit on the oven rack and line the whole thing with foil. Transfer the pig to the overlapped baking sheets then lift the whole oven rack and return to the oven so that the pig is in the center.", "image_url": "https://www.seriouseats.com/thmb/QqFhAc2WkwC-QhcRUe2FWY61g_s=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__images__20111204-suckling-pig-03-560px-52382b8648684022b6892d846f7dac0e.jpg"}, {"order": 1, "description": "Roast until an instant-read thermometer inserted into the deepest part of the shoulder blade registers at least 160°F (71°C), about 4 hours. If ears or tail begin to burn, cover with foil and continue roasting.", "image_url": "https://www.seriouseats.com/thmb/jXDkAPtIktS7It3g9sxTi6bkLvc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__images__20111204-suckling-pig-06-560px-422e34f732be49b0ba7f60eb0cf798b8.jpg"}, {"order": 2, "description": "Increase oven temperature to 500°F (260°C) and cook until skin is crisp all over, about 30 minutes longer (see note). Remove pig from oven, tent with foil, and allow to rest for 30 minutes. Serve by tearing skin into serving-sized pieces and removing flesh with your fingers and piling it onto a serving platter.", "image_url": "https://www.seriouseats.com/thmb/CMODCLUXq9wvHXTImWNuzcha7zQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__images__2011__12__20111204-suckling-pig-11-560px-ced76855f0304c3082789130fe0ea1c4.jpg"}]}
{"name": "Sweet Potato Cake with Toasted Marshmallow Frosting Recipe", "description": "Instead of those puffed up mini-marshmallows, this Ode to a Casserole Cake is mounded with a spiced and spiked, pecan-flecked Italian meringue frosting that bronzes and crisps under the blaze of a hot flame.", "servings": "Serves 12 to 15", "mainImageUrl": "https://www.seriouseats.com/thmb/CGjAVr_D2TwNx4kREcSBJZxavVk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2011__11__20111122-127677-LTE-Sweet-Potato-Cake-PRIMARY-0fda941716634247a857cca0b8ea431d.jpg", "ingredients": ["For the Sweet Potatoes:", "2 ½ pounds sweet potatoes, peeled and cut crosswise into ½-inch thick slices", "1/2 cup orange juice", "4 tablespoons (2 ounces) unsalted butter, melted", "1/4 cup packed dark brown sugar", "1/4 cup bourbon", "1/4 teaspoon salt", "For the Cake:", "1 tablespoon unsalted butter, softened", "3 cups all-purpose flour", "3 tablespoons orange juice and 1 tablespoon finely grated orange zest", "2 teaspoons ground cinnamon", "1 teaspoon ground ginger", "1 teaspoon ground allspice", "1 teaspoon baking soda", "3/4 teaspoon salt", "1 cup sugar", "1 cup packed dark brown sugar", "3 large eggs, at room temperature", "1 1/2 cups vegetable oil", "1/4 cup bourbon", "2 teaspoons pure vanilla extract", "For the Toasted Marshmallow Frosting:", "1 1/3 cups sugar", "1/2 teaspoon ground cinnamon", "1/2 teaspoon ground ginger", "1/2 teaspoon ground allspice", "¼ cup bourbon", "2 tablespoons light corn syrup", "6 large egg whites, at room temperature", "1/4 teaspoon salt", "2 cups toasted pecans, chopped"], "steps": [{"order": 0, "description": "For the Sweet Potatoes: Adjust oven rack to middle position and preheat oven to 375°F (190°C). Arrange sweet potato slices in foil-lined 13- by 9-inch baking dish or foil-lined rimmed baking sheet.", "image_url": null}, {"order": 1, "description": "In medium bowl whisk together orange juice, melted butter, brown sugar, bourbon, and salt. Pour mixture over sweet potatoes and bake until they’re tender and syrupy, about 1 hour, stirring to coat in liquid every 15 minutes.", "image_url": null}, {"order": 2, "description": "Transfer dish to cooling rack and cool sweet potatoes for 10 minutes. Pulse sweet potatoes and any syrup in food processor until smooth. Measure out 2 cups and transfer to bowl; cool to room temperature, about 15 minutes.", "image_url": null}, {"order": 3, "description": "Reduce oven temperature to 350°F (180°C).", "image_url": null}, {"order": 4, "description": "For the Cake: Grease a 13- by 9-inch baking dish with butter.", "image_url": null}, {"order": 5, "description": "In medium bowl, whisk together flour, orange zest, cinnamon, ginger, allspice, baking soda, and salt.", "image_url": null}, {"order": 6, "description": "In separate large bowl, beat sugar, dark brown sugar, and eggs on medium speed until thickened and lightened in color, about 2 minutes. With mixer running, slowly add orange juice, oil, bourbon, and vanilla. Reduce speed to low and add flour mixture in three additions, alternating with sweet potatoes. Mix just until combined, scraping down sides and bottom of bowl with rubber spatula as needed.", "image_url": null}, {"order": 7, "description": "Pour batter into prepared baking dish and bake until toothpick inserted in middle of cake comes out clean, about 1 1/2 hours. Transfer cake to cooling rack and cool completely in pan, 1 1/2 to 2 hours.", "image_url": null}, {"order": 8, "description": "For the Toasted Marshmallow Frosting: Stir sugar, cinnamon, ginger, allspice, bourbon, and corn syrup in large heavy-bottomed saucepan over medium-low heat until sugar dissolves. Increase heat to medium-high and boil syrup until it registers 238°F. on candy thermometer, 8 to 10 minutes.", "image_url": null}, {"order": 9, "description": "While syrup boils, in large bowl, beat egg whites and salt with whisk attachment on medium-low speed until whites begin to loosen and froth, about 1 minute. Increase speed to medium-high and beat whites until soft peaks form, 1 to 2 minutes.", "image_url": null}, {"order": 10, "description": "With mixer running on medium-high speed, slowly and carefully add syrup to egg whites. Beat until outside of bowl is cool to the touch and whites are thick and glossy, about 7 minutes. Fold in pecans.", "image_url": null}, {"order": 11, "description": "Spread topping on cooled cake with a spatula, pulling up on meringue to create decorative peaks. Torch meringue to lightly toast. If you don’t have a torch, adjust oven rack to upper third and set oven to broil. Broil until golden, 1 to 2 minutes.", "image_url": null}]}
{"name": "Suffering Bastard Recipe", "description": "There are a number of recipes for the Suffering Bastard floating about. Some are merely Mai tai variations with extra rum, while some call for brandy instead of bourbon, and others for rum. Today&#39;s drink historians generally settle on bourbon as one of the two base spirits, along with a shot of gin. The drink is then leavened with the healing powers of lime juice and bitters (the lime juice can range anywhere from a teaspoon to an ounce) and lengthened with a good dose of ginger ale.", "servings": "makes 1 cocktail", "mainImageUrl": "https://www.seriouseats.com/thmb/YDAiSuu-AFZaBBvjPf7SvdKVg4o=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20210607_SufferingBastard_LizClayman-seriouseats-2-f115a84d4a6d487da5fa1c7885283c0f.jpg", "ingredients": ["1 ounce bourbon", "1 ounce gin", "1 ounce fresh lime juice", "1 dash Angostura bitters", "4 ounces chilled ginger ale"], "steps": [{"order": 0, "description": "Pour ingredients into an ice-filled Old Fashioned glass and top with ginger ale, adding more ice if needed. Garnish with a sprig of mint or an orange slice. This Recipe Appears In \n Tiki Revival Hits its Stride with New Recipe Book 'Beachbum Berry Remixed'", "image_url": "https://www.seriouseats.com/thmb/0lbpNC0hJxLLFPeFtrUpsjz09oA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20210607_SufferingBastard_LizClayman-seriouseats-11bb629191024f468164eed4dbc2fa75.jpg"}]}
{"name": "The Silver Palate&#39;s Corn Bread-Sausage Stuffing With Apples Recipe", "description": "Although Ed Levine is a self-proclaimed semi-homemadeoholic when it comes to preparing Thanksgiving dinner, he does have a few tried-and-true recipes that he can count on to make the meal less &#34;semi-homemade&#34; and just plain &#34;homemade.&#34; He admittedly uses Pepperidge...", "servings": "enough stuffing for a 20-pound turkey, 12 to 14 portions", "mainImageUrl": "https://www.seriouseats.com/thmb/YRY7VtFqpfI2raXxdX4DLrNqAQI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__thanksgivingBug-fb2a759a494e488c911289799829598d.png", "ingredients": ["12 tablespoons (1 1/2 sticks) unsalted butter", "2 1/2 cups finely chopped yellow onions", "3 tart apples (Jonathan and Winesap are good), cored and chunked; do not peel", "1 pound lightly seasoned bulk sausage (breakfast sausage with sage is best)", "3 cups coarsely crumbled corn bread", "3 cups coarsely crumbled whole-wheat bread", "3 cups coarsely crumbled white bread (French or homemade preferred)", "2 teaspoons dried thyme", "1 teaspoon dried sage", "Salt and freshly ground black pepper, to taste", "1/2 cup chopped fresh Italian (flat-leaf) parsley", "1 1/2 cups shelled pecan halves"], "steps": [{"order": 0, "description": "Preheat the oven to 325°F.", "image_url": null}, {"order": 1, "description": "Melt half of the butter in a skillet over medium heat. Add the chopped onions and cook, partially covered, until tender and lightly colored, about 25 minutes, Transfer the onions and butter to a large mixing bowl.", "image_url": null}, {"order": 2, "description": "Melt the remaining butter in the same skillet. Add the apple chunks and cook over high heat until lightly colored but not mushy. Transfer the apples and butter to the mixing bowl.", "image_url": null}, {"order": 3, "description": "Crumble the sausage into the skillet and cook over medium heat,stirring, until lightly browned. With a slotted spoon, transfer the sausage to the mixing bowl and reserve the rendered fat.", "image_url": null}, {"order": 4, "description": "Add the remaining ingredients to the ingredients in the mixing bowl and combine gently. Cool completely before stuffing the bird; refrigerate if not used promptly.", "image_url": null}, {"order": 5, "description": "If you do not wish actually to stuff the bird (goose or duck. for example, can make the stuffing greasy), spoon it into a casserole. Cover the casserole and set into a large pan. Pour hot water around the casserole to come halfway up the sides, Bake for 30 to 45 minutes, basting occasionally with the cooking juices from the bird or with the reserved sausage fat if necessary.", "image_url": null}]}
{"name": "Hui Guo Rou (Sichuan Twice-Cooked Pork)", "description": "Twice-cooked pork—a classic Sichuan recipe—gets deep, savory flavor from fermented black beans, chili bean paste, and sweet bean paste. The two-stage cooking process starts by simmering the pork belly for tenderness, and finishes with a stir-fry to make it brown and slightly crispy.", "servings": null, "mainImageUrl": "https://www.seriouseats.com/thmb/N6p2Yp3O1XkVVV6Nj4FbCcBcTb0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__06__20120615-chichis-chinese-pork-belly-dish-primary-2951a0ad230f48efb0e050f5e36c6326.jpg", "ingredients": ["about 12 ounces fresh boneless, rind-off pork belly", "6 baby leeks, 12 ramps, or 12 green onions, sliced on a steep bias into 2-inch long segments", "2 tablespoon cooking oil or lard", "1 1/2 to 2 tablespoons chili bean paste", "2 teaspoon sweet bean paste (tian mi jiang)", "2 teaspoons fermented black beans, or 1 tablespoon fermented black bean paste", "1 teaspoon soy sauce", "1 to 2 teaspoons sugar"], "steps": [{"order": 0, "description": "Bring a large pot of water to a boil. Add pork and simmer until just cooked through, about 25 minutes. Remove pork from water and let cool. (Water can be set aside for use in stock, or discarded.) Place belly in refrigerator until flesh is firm, about 1 hour.", "image_url": null}, {"order": 1, "description": "Slice pork thinly into 1/4-inch-thick rectangles.", "image_url": "https://www.seriouseats.com/thmb/D-bnvKJe9NGu9zYLZjYkoH6UQ6M=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__images__2012__06__20120615-chichis-chinese-sliced-pork-belly-cd0381ec3c384058baee77150f6554b1.jpg"}, {"order": 2, "description": "In a wok, heat oil or lard over medium-high heat until shimmering. Add pork and stir-fry until fat has rendered somewhat and skin is brown and somewhat crisp, about 2 minutes. Push pork to one side of wok and add chili bean paste. Stir-fry until oil is red, then add sweet bean paste and black beans and stir-fry for a few seconds longer. Mix everything together, then stir in soy sauce and sugar.", "image_url": null}, {"order": 3, "description": "Add leeks (or ramps or green onions) and ginger and stir-fry until they are just cooked, 30 seconds to 1 minute. Serve immediately.", "image_url": null}]}
{"name": "Tuscan Pappa al Pomodoro (Tomato and Bread Soup) Recipe", "description": "Just because it&#39;s no longer tomato season doesn&#39;t mean it&#39;s time to stop eating tomatoes. The Tuscan tomato-bread soup known as pappa al pomodoro, for instance, is perfect made with good-quality canned tomatoes and plenty of olive oil.", "servings": "Serves 4", "mainImageUrl": "https://www.seriouseats.com/thmb/9AbBcrfGbwBmxy1vmf7MEtL8pFQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/SEA-SoupsandStewsMPP-TuscanPappaAlPomodoro-MorganHuntGlaze-58c0985819fc4d2cbbd3bd0477c2bb6e.jpg", "ingredients": ["2 tablespoons extra-virgin olive oil, plus more for drizzling", "Pinch red pepper flakes", "2 medium cloves garlic, thinly sliced", "1/2 medium onion, minced (about 1/2 cup)", "1 (28-ounce) can whole plum tomatoes, crushed by hand, with juices", "2 sprigs fresh basil, plus torn leaves for serving", "1/3 pound (about 6 ounces) fresh or stale rustic bread, torn or cut into 1-inch chunks (see note)", "2 cups warm Quick and Easy Vegetable Stock , plus more as needed (see note)", "Kosher salt and freshly ground black pepper"], "steps": [{"order": 0, "description": "In a large saucepan, heat 2 tablespoons olive oil over medium heat until shimmering. Add red pepper flakes and garlic and cook, stirring, until garlic just begins to turn golden. Add onion and cook, stirring, just until softened, about 5 minutes. Add crushed tomatoes and their juices, along with basil sprigs, and bring to a simmer.", "image_url": "https://www.seriouseats.com/thmb/TEeAswvcuPJ-IkVmp89ybk_96U8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__images__2015__10__20151022-pappa-al-pomodoro-vicky-wasik-collage-1-a66befcd24794291b563104fa3ee9fa6.jpg"}, {"order": 1, "description": "Stir in bread. Ladle stock on top, stirring to combine. Simmer bread, adding more stock as needed, until bread is completely softened and custardy and soup has thickened to a porridge-like consistency, about 25 minutes. Season with salt and pepper. Discard basil sprigs.", "image_url": "https://www.seriouseats.com/thmb/QRyrV71doZPBCtveLwXgNhWJMGo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__images__2015__10__20151022-pappa-al-pomodoro-vicky-wasik-collage-2-ab0461f9341a4cb48ddc6e0489fe2c99.jpg"}, {"order": 2, "description": "Spoon into bowls, generously drizzle with olive oil, and grind black pepper on top. Garnish with torn basil leaves and serve.", "image_url": null}]}
{"name": "Turmeric Chicken with Sumac and Lime from &#39;The New Persian Kitchen&#39;", "description": "For a totally different take on the basic roasted chicken thigh, enter Louisa Shafia&#39;s Turmeric Chicken with Sumac and Lime from The New Persian Kitchen. This super-simple braised dish is bright, tangy, and brilliantly yellow—it&#39;s a far cry from most muddled braised chicken dishes and even further from the typical roasted bird.", "servings": "serves 4", "mainImageUrl": "https://www.seriouseats.com/thmb/kHH0b77eUJFC2ya-c_TUx0L13hs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2013__04__042513-249107-cook-the-book-turmeric-chicken-sumac-lime-cc30b32ef3a24fed8aba8673c5189b82.jpg", "ingredients": ["1 teaspoon ground turmeric", "Sea salt and freshly ground black pepper", "4 bone-in chicken thighs", "2 tablespoons grapeseed oil", "3/4 cup water", "4 cloves garlic, minced", "2 juicy limes, halved", "Sumac, for garnish"], "steps": [{"order": 0, "description": "In a small bowl, mix the turmeric with 1 tablespoon salt and 2 teaspoons pepper. Place the chicken on a rimmed baking sheet and sprinkle with the spice mixture, turning to coat both sides.", "image_url": null}, {"order": 1, "description": "Heat a large skillet over medium-high heat and add the oil. Brown the chicken well on both sides, about 7 minutes per side. Pour in the water, then add the garlic, stirring it into the water. Bring the water to a boil, then turn down the heat to low and cover. Braise the chicken for 25 minutes, until the inside is opaque. Transfer the chicken to a serving platter, turn up the heat to high, and reduce the cooking liquid for a few minutes, stirring occasionally until it’s slightly thickened. Season to taste with salt and pepper, and pour the sauce over the chicken.", "image_url": null}, {"order": 2, "description": "Dust the chicken with sumac and pepper, garnish with lime halves, and serve.", "image_url": null}, {"order": 3, "description": "Vegetarian Option: Use whole portobello mushrooms in place of the chicken, or use 1 pound firm tofu, well drained and cut into slabs 1 inch thick. You will need a little extra oil for searing than what is called for in the recipe.", "image_url": null}]}
{"name": "Turkish-Style Vegan Tofu Scramble (Vegan Menemen) Recipe", "description": "Menemen—eggs scrambled with olive oil, onions, chilies, and tomatoes—is traditionally made by slow-cooking onions and hot chilies in olive oil, then seasoning them with dried chilies and oregano and stewing them with tomatoes. The eggs go in at the last moment and are cooked until just barely set. With so many strong flavors and a texture easily captured by silken tofu, it works great as a vegan breakfast.", "servings": "Serves 4", "mainImageUrl": "https://www.seriouseats.com/thmb/wsmz5YCYt3xaBmdvYmdkmOio5hk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2016__03__20160319-vegan-menemen-recipe-5-1605208265bd494dae91c448361f9066.jpg", "ingredients": ["3 tablespoons (45ml) extra-virgin olive oil, plus more for serving", "1/2 teaspoon (about 2g) crushed Urfa chilies (see note)", "1/4 teaspoon (about 1g) dried oregano (optional)", "1 small onion, finely diced (about 3/4 cup; 4 ounces; 115g)", "3/4 cup finely diced shishito, padrón, or Chinese green long peppers (4 ounces; 115g)", "Kosher salt and freshly ground black pepper", "1/2 cup chopped peeled ripe fresh tomatoes or drained canned tomatoes (4 ounces; 115g)", "1 (14- to 16-ounce; about 400g) block soft silken tofu", "Chopped fresh parsley, to garnish", "Bread, for serving"], "steps": [{"order": 0, "description": "In a medium nonstick or cast iron skillet, heat olive oil over low heat until barely warm. Add Urfa chilies, oregano (if using), onion, and peppers. Season with salt and a very generous amount of black pepper. Cook, stirring frequently, until very soft, about 8 minutes. Add tomatoes and continue to cook, stirring frequently, until deepened in color, about 5 minutes longer. Remove half of mixture and reserve.", "image_url": "https://www.seriouseats.com/thmb/4i9wdlk3x-zT1RqYFdTJnl1MUjE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__20160319-vegan-menemen-recipe-1-114cae1b46c94e47b4c0d6594077d1bd.jpg"}, {"order": 1, "description": "Add tofu and season with salt and pepper. Cook, folding gently, until tofu is heated through and broken into large curds. Gently fold in reserved vegetable mixture. Sprinkle with chopped parsley and serve with bread.", "image_url": "https://www.seriouseats.com/thmb/vOhB4LbOVov31tPDGbfT6QGyfw8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__20160319-vegan-menemen-recipe-3-77ee1594bb41468eac80e1f95db998d5.jpg"}]}
{"name": "Turkey Paitan Ramen With Crispy Turkey and Soft-Cooked Egg Recipe", "description": "A rich and creamy turkey broth flavored with miso and sesame with crispy braised turkey meat, a soft boiled egg, and Brussels sprouts leaves.", "servings": "Makes about 3 quarts broth, serving 6 to 8", "mainImageUrl": "https://www.seriouseats.com/thmb/TgQbE-ws_3UIOwQYBVi958ipKLg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2013__11__20131026-turkey-ramen-15-959695a833a34ae188ec734904199124.jpg", "ingredients": ["3 pounds turkey backs and wings or leftover roasted turkey bones and carcass, roughly chopped with a cleaver or a heavy duty chef&#39;s knife", "2 pounds turkey drumsticks and/or thighs", "3 tablespoons vegetable oil, divided", "1 large onion, skin on, roughly chopped", "16 garlic cloves, divided", "One 3-inch knob ginger, roughly chopped", "2 whole leeks, washed and roughly chopped", "2 dozen scallions, white parts only (reserve greens and light green parts for garnishing finished soup)", "6 ounces whole mushrooms or mushroom scraps", "1/2 cup red or white miso paste", "1/4 cup sesame tahini", "12 Brussels sprouts, divided into individual leaves", "Kosher salt", "6 to 8 servings ramen-style noodles, store-bought or homemade", "6 to 8 marinated eggs , or sous-vide soft boiled eggs", "2 to 3 tablespoons mayu (black garlic oil) or toasted sesame oil, for serving"], "steps": [{"order": 0, "description": "Place turkey bones and drumsticks or thighs in a large stockpot and cover with cold water. Place on a burner over high heat and bring to a boil. Remove from heat as soon as boil is reached.", "image_url": null}, {"order": 1, "description": "While pot is heating, heat 2 tablespoons vegetable oil in a medium cast iron or nonstick skillet over high heat until lightly smoking. Add onions, 12 cloves garlic, and ginger. Cook, tossing occasionally until deeply charred on most sides, about 15 minutes total. Set aside.", "image_url": null}, {"order": 2, "description": "Once pot has come to a boil, dump water down the drain. Carefully wash all bones and meat under cold running water, removing any bits of dark marrow or coagulated blood. Bones should be uniform grey/white after you&#39;ve scrubbed them. Meat should be lightly rinsed.", "image_url": null}, {"order": 3, "description": "Return turkey to pot along with charred vegetables, leeks, scallion whites, and mushrooms. Top up with cold water. Bring to a rolling boil over high heat, skimming off any scum that appears (this should stop appearing within the first 20 minutes or so). Use a clean sponge or moist paper towels to wipe black or gray scum off from around the rim of the pot. Reduce heat to a bare simmer and place a heavy lid on top.", "image_url": null}, {"order": 4, "description": "Once the lid is on, check the pot after 15 minutes. It should be at a slow rolling boil. If not, increase or decrease heat slightly to adjust boiling speed. Boil broth until turkey legs/drumsticks are completely tender, about 3 hours. Carefully remove turkey legs/drumsticks with a slotted spatula. Transfer to a sealed container and refrigerate until step 7. Return lid to pot and continue cooking until broth is opaque with the texture of light cream, about 3 to 5 hours longer, topping off as necessary to keep bones submerged at all times. If you must leave the pot unattended for an extended period of time, top up the pot and reduce the heat to the lowest setting while you are gone. Return to a boil when you come back and continue cooking, topping up with more water as necessary.", "image_url": "https://www.seriouseats.com/thmb/xlVaTsf82sitSwjwR6u-QxhBJXM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__images__2013__11__20131026-turkey-ramen-03-efc8de812b28441280a42105092e1296.jpg"}, {"order": 5, "description": "Once broth is ready, cook over high heat until reduced to around 3 quarts. Strain through a fine-mesh strainer into a clean pot. Discard solids. Skim liquid fat from top with a ladle and discard. Return to a medium pot on the stovetop and keep warm.", "image_url": "https://www.seriouseats.com/thmb/9jwm_arYR0L9H3nuOxwljXskIzU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__images__2013__11__20131026-turkey-ramen-04-38798717fe3e4caca5febc555dcbd5f6.jpg"}, {"order": 6, "description": "Whisk miso paste and tahini into broth. Grate garlic cloves and whisk into broth. Season to taste with salt and/or soy sauce.", "image_url": "https://www.seriouseats.com/thmb/A3PWpSPgxe2NmhHuVoE-wTD8qLA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__images__2013__11__20131026-turkey-ramen-05-f2cf72dc7dfa41b981cd4c1b7dd158b1.jpg"}, {"order": 7, "description": "Pick turkey meat from turkey legs and finely shred by hand. Place in a cast iron or nonstick skillet and heat over medium-high heat. Cook, flipping and breaking up the meat occasionally, until crusty and browned all over. Season to taste with salt and transfer to a bowl. Set aside.", "image_url": "https://www.seriouseats.com/thmb/gO9gF7DbYaAEBliUt_p9dZ1wO-c=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__images__2013__11__20131026-turkey-ramen-11-65eaee6f88504c4da74c719e8367d97c.jpg"}, {"order": 8, "description": "Heat remaining tablespoon oil in a large skillet over high heat until lightly smoking. Add Brussels sprouts leaves. Season to taste with salt and cook, tossing frequently, until bright green and charred in spots, about 2 minutes. Transfer to a bowl and set aside.", "image_url": null}, {"order": 9, "description": "Cook ramen noodles according to package directions. Drain and transfer to individual serving bowls. Top with broth, Brussels sprouts leaves, sliced scallion greens, shredded turkey, and an egg. Drizzle with mayu or toasted sesame oil. Serve immediately.", "image_url": "https://www.seriouseats.com/thmb/4uW7mnmhIn40uBq33bjWPZMrGO8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__images__2013__11__20131026-turkey-ramen-13-142bfc78efae457781f43a59ce1a5672.jpg"}]}
{"name": "Roast Turkey in Parts", "description": "Roasting your Thanksgiving turkey in parts is the best way to achieve even, thorough cooking from breast to leg, regardless of tradition.", "servings": "Serves 8 to 12", "mainImageUrl": "https://www.seriouseats.com/thmb/HDfIGVfSrN2ZvSX8mOs0XuzBCKM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2018__10__20181022-roasted-turkey-in-parts-23-liz-clayman-ab5f6adbaba44bd28cda2495b6f635ab.jpg", "ingredients": ["1 whole turkey, 10 to 15 pounds (4.5 to 6.8kg)", "Kosher salt and freshly ground black pepper", "1 large onion, peeled and roughly chopped (about 2 cups)", "1 large carrot, peeled and roughly chopped (about 1 cup)", "2 large ribs celery, roughly chopped (about 1 cup)", "2 medium cloves garlic, peeled and smashed", "2 bay leaves", "12 whole black peppercorns", "1 quart (900ml) homemade or store-bought low-sodium chicken stock, divided", "2 tablespoons (30ml) vegetable oil", "3 tablespoons (45g) unsalted butter", "3 tablespoons flour", "1/4 teaspoon Marmite", "1 teaspoon (5ml) soy sauce"], "steps": [{"order": 0, "description": "Using a sharp knife, remove legs from turkey and set aside. Using a large cleaver or heavy chef&#39;s knife, cut backbone and carcass away from the turkey breast. Separate turkey wings from breast. Chop backbone and carcass into rough pieces with the cleaver. Season liberally with salt and pepper. For best results, transfer turkey parts to a wire rack set in a rimmed baking sheet and let rest, uncovered, overnight in refrigerator (see notes).", "image_url": null}, {"order": 1, "description": "Adjust oven rack to lower-middle position and preheat oven to 275°F (135°C). Spread onions, carrots, celery, garlic, bay leaves, and black peppercorns evenly across a rimmed baking sheet. Pour 1 cup (240ml) stock into baking sheet; reserve remaining stock. Place a wire rack on top of the baking sheet. (It may rest directly on top of vegetables—this is okay.) Set aside. Place turkey on top of rack on top of vegetables, trying to leave a little space between the turkey pieces.", "image_url": null}, {"order": 2, "description": "Roast turkey until an instant-read thermometer inserted into the center of a breast piece registers 150°F (66°C), 2 to 3 hours total. Remove breast and set aside. Continue roasting legs until an instant-read thermometer registers 170°F (77°C) when inserted into leg, about 30 minutes longer. (Depending on the pieces&#39; arrangement, the legs might finish at the same time as the breasts.) The turkey pieces will not be browned. Set aside at room temperature for at least 30 minutes and up to 2 hours. Set a fine-mesh strainer over a large bowl. Strain vegetables from tray. Reserve liquid and discard vegetables.", "image_url": null}, {"order": 3, "description": "While Turkey Is Roasting, Make the Gravy: Roughly chop carcass and neck into 1-inch chunks. Heat vegetable oil in a large saucepan or Dutch oven over high heat until just beginning to smoke. Add turkey carcass and cook, stirring frequently, until well browned on all surfaces, about 10 minutes. Add remaining stock. Add water until turkey pieces are barely covered. Bring to a boil, reduce to a simmer, and allow to simmer while turkey roasts.", "image_url": null}, {"order": 4, "description": "While turkey is resting, pour stock through the same strainer and add to reserved stock from strained vegetables. Discard solids. If desired, cut giblets into 1/4-inch pieces. Heat butter in a medium saucepan over medium-high heat until melted. Add giblets and cook, stirring frequently, until lightly browned, about 2 minutes. Add flour and cook, stirring constantly, until flour is light blond in color. Slowly whisk in reserved stock, Marmite, and soy sauce. Bring to a boil, then reduce to a simmer. Cook until desired consistency is reached, about 10 minutes. Season to taste with salt and pepper.", "image_url": null}, {"order": 5, "description": "30 Minutes Before Serving Turkey: Preheat oven to 500°F (260°C). Place turkey in oven and cook until crisp and browned, turning breast once during cooking. Serve immediately with gravy.", "image_url": null}]}
{"name": "Tsukune (Japanese Chicken Meatballs) Recipe", "description": "Lightly seasoned chicken meatballs are threaded onto skewers, grilled, and finished with a sweet and salty tare sauce.", "servings": "serves 4", "mainImageUrl": "https://www.seriouseats.com/thmb/oiWy51nqVsiEzKfY9us-uFqWAoM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2014__10__20141017-tsukune-joshua-bousel-40e338184dd6464bae3ecad5353c5a41.jpg", "ingredients": ["For the Tare Sauce:", "1/2 cup mirin", "1/2 cup soy sauce", "1/4 cup sake", "1/4 cup dark brown sugar", "1 tablespoon sherry vinegar", "3 medium cloves of garlic, smashed and peeled", "3 scallions, roughly chopped", "1 (1-inch) piece of ginger, sliced", "1 tablespoon whole black or white peppercorns", "For the Meatballs:", "1 1/2 pounds ground chicken thighs", "1/2 cup panko bread crumbs", "1/4 cup finely chopped scallions", "1 large egg, lightly beaten", "2 teaspoons finely grated fresh ginger", "2 teaspoons finely minced fresh garlic (about 2 medium cloves)", "1 teaspoon toasted sesame oil", "1 teaspoon kosher salt", "1/2 teaspoon ground white pepper", "8-10 wooden skewers, soaked in water for 30 minutes prior to use"], "steps": [{"order": 0, "description": "For the Tare Sauce: Combine mirin, soy sauce, sake, brown sugar, sherry vinegar, garlic, scallions, ginger slices, and peppercorns in a medium saucepan. Bring to boil over high heat, then reduce to a simmer, whisk to combine, and cook until mixture is thick and syrupy, about 45 minutes. Strain through a fine-mesh strainer. Set aside or store in an airtight container in the refrigerator until ready to use.", "image_url": "https://www.seriouseats.com/thmb/taVx2sMjUJD19x91TW3L54s5Jr8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__20141017-tsukune-step-1-joshua-bousel-b9a835c642c54aefa653553a83b9aeb6.jpg"}, {"order": 1, "description": "For the Meatballs: Using hands, mix together chicken, bread crumbs, scallions, egg, ginger, garlic, sesame oil, salt, and white pepper until thoroughly combined. Form mixture into 1-inch meatballs and thread onto skewers.", "image_url": "https://www.seriouseats.com/thmb/Ra78gQ5opwtiFuWn9A6Q-20GvS0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__20141017-tsukune-step-2-joshua-bousel-08c10f57b9794ab4ab4a410b22f4ba6a.jpg"}, {"order": 2, "description": "Light one chimney full of charcoal. When all charcoal is lit and covered with gray ash, pour out and spread coals evenly over entire surface of charcoal grate. Set cooking grate in place, cover grill and allow to preheat for 5 minutes. Clean and oil grilling grate. Careful transfer skewers to grill, if necessary supporting meatballs from bottom to prevent them from falling off skewers. Grill until first side is well browned, about 3-4 minutes. Using tongs, rotate meatballs and cook until well browned on second side, about 2-3 minutes. Repeat for remaining two sides.", "image_url": "https://www.seriouseats.com/thmb/4eTEzRTpmv7Y6kMtr5GUXXxhxVo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__20141017-tsukune-step-3-joshua-bousel-93329362ed8541679e9fc442eaa20797.jpg"}, {"order": 3, "description": "Brush tare sauce all over meatballs and allow to cook for 15-30 seconds longer. Transfer skewers to a plate or serving dish, brush lightly with sauce again and let rest for 5 minutes. Serve immediately.", "image_url": "https://www.seriouseats.com/thmb/NrOxieWq1kB87_nOzSHhruh1WOI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__20141017-tsukune-step-4-joshua-bousel-cf7d3c91c72b4abcbc36ba141aa1ef0e.jpg"}]}
{"name": "Tropical Pineapple, Mango, and Coconut Fools Recipe", "description": "The classic British fool, a dessert of fruit and whipped cream, is an ideal warm weather dessert because it&#39;s light and balance of sweet and tart fruit flavors. Spooned into this tropical take are layers of juicy mango, pineapple, and toasted coconut.", "servings": "Serves 4", "mainImageUrl": "https://www.seriouseats.com/thmb/5w7zSsvYKEKe_qUl2VLnXMjRj-o=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2014__06__20140621-tropical-pineapple-mango-coconut-fool-1-yvonne-ruperti-d0714bd3fa8a43f487ff3ecc822f7514.jpg", "ingredients": ["3 cups chopped fresh pineapple (from a 2 1/2-pound pineapple)", "3 tablespoons granulated sugar, divided", "1 tablespoon fresh lemon juice", "1/2 cup sweetened, shredded coconut, lightly toasted", "1 mango, peeled and diced", "1 cup heavy cream, cold", "1/4 cup Greek-style yogurt"], "steps": [{"order": 0, "description": "Place pineapple and 1 tablespoon sugar in medium saucepan. Cook over medium heat, stirring occasionally, until fruit has softened and mixture becomes jammy, about 15 minutes. If pineapple looks too dry during cooking, add a teaspoon of water at a time. Remove from heat and stir in lemon juice. Adjust to taste with sugar and lemon juice. Chill until completely cold before using, about an hour.", "image_url": null}, {"order": 1, "description": "Using mixer fitted with whip attachment, whip cream on high speed to soft peaks. Fold in yogurt, pineapple compote, and 1/2 of the coconut.", "image_url": null}, {"order": 2, "description": "Spoon pineapple cream into glasses, alternating with fresh mango. Top with remaining coconut. Serve chilled.", "image_url": null}]}
{"name": "Tricolor Sweet Pepper Relish Recipe", "description": "This fresh, tangy, and fruity sweet pepper relish livens up a humble hot dog in a way fitting for the start of a new grilling season.", "servings": "makes about 1 1/2 cups", "mainImageUrl": "https://www.seriouseats.com/thmb/rvNBMg6rs1KHOgdRs36YXAmZbp8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2013__05__20130509-251561-sweet-pepper-relish-6c271ffa7b214f0dae9d45245e95f983.jpg", "ingredients": ["4 cups water", "1 large red bell pepper, cored, seeded, and cut into 1/8-inch dice", "1 large yellow bell pepper, cored, seeded, and cut into 1/8-inch dice", "1 large orange bell pepper, cored, seeded, and cut into 1/8-inch dice", "1/4 cup white wine vinegar", "1/3 cup white sugar", "1 1/2 teaspoon yellow mustard seeds", "1 teaspoon kosher salt", "1/4 teaspoon celery seeds"], "steps": [{"order": 0, "description": "Bring 4 cups of water to a boil in a small saucepan over high heat. Remove from heat, add in diced peppers and let steep for 5 minutes. Strain peppers through a fine-mesh strainer.", "image_url": "https://www.seriouseats.com/thmb/Qe3rz5m1k-WwqQ8jDDpW0-YVyfA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__20130509-251561-sweet-pepper-relish-step-1-d8ed0ad0f84140a6bd76f66c2c01d349.jpg"}, {"order": 1, "description": "Add in vinegar, sugar, mustard seeds, salt, and celery seeds into now empty saucepan. Bring to a boil over medium-high heat, stirring to dissolve sugar.", "image_url": "https://www.seriouseats.com/thmb/JYSoxzhL3Lq8zp6Ihh0fMaQNiHU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__20130509-251561-sweet-pepper-relish-step-2-d6d37ca449014838a276fa0ae43ccead.jpg"}, {"order": 2, "description": "Add peppers and simmer, stirring occasionally, until little liquid remains, 15-20 minutes. Transfer relish to a jar, let cool slightly, then cover and place in refrigerator until completely chilled. Store in refrigerator for up to 2 weeks.", "image_url": "https://www.seriouseats.com/thmb/WXjGYbXKuRSouqZwTxTJBUZIPIs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__20130509-251561-sweet-pepper-relish-step-3-9d5a035ff6e443a1b98f0769a3f70256.jpg"}]}
{"name": "Tri-Tip Beef Roast With Shallot Jus Recipe", "description": "Using the reverse-sear method, you can turn the underappreciated tri-tip into a special-occasion beef roast, without breaking the bank.", "servings": "Serves 4 to 6", "mainImageUrl": "https://www.seriouseats.com/thmb/RbdN9vehoHZ_asY3O0ANHu-YMAo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2018__11__20181025-roast-beef-vicky-wasik-41-80a2b731e1334f0cb84a8956d919a7c2.jpg", "ingredients": ["1 whole tri-tip roast, about 2 1/2 pounds (1.1kg)", "Kosher salt and freshly ground black pepper", "1 quart (950ml) beef stock or brown chicken stock (see note)", "1 1/4 cups (300ml) red wine, divided", "2 tablespoons (30ml) vegetable oil", "1 pound (450g) shallots, thinly sliced", "1 tablespoon (15ml) soy sauce"], "steps": [{"order": 0, "description": "The Day Before Roasting: Using butcher's twine, tie tri-tip at 1-inch intervals using butcher's knots . Season generously with salt and pepper. Transfer to a wire rack set in a foil-lined rimmed baking sheet and refrigerate, uncovered, at least overnight and up to 2 nights.", "image_url": null}, {"order": 1, "description": "When Ready to Cook: Adjust oven rack to center position and preheat oven to 225°F (105°C). Place baking sheet with rack and tri-tip in oven and roast until internal temperature registers 115°F (46°C) on an instant-read thermometer at the tri-tip's thickest point, about 1 1/2 hours.", "image_url": "https://www.seriouseats.com/thmb/j1338wDa_hnaFUHIsqJ5E5czSRA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2018__11__20181025-roast-beef-vicky-wasik-taking-temp-1500x1125-14d1b4fad0784114980b8d0111ba43c2.jpg"}, {"order": 2, "description": "Meanwhile, in a 3-quart stainless steel saucier, combine stock and 1 cup (240ml) red wine over medium-high heat. Bring to a boil over medium-high heat, then reduce to a simmer. Simmer, occasionally scraping down sides of saucier with a rubber spatula, until mixture thickens slightly and is reduced to 2 cups (475ml), 15 to 20 minutes. Turn off heat.", "image_url": "https://www.seriouseats.com/thmb/ZNXhGOCz4z8AyM28OcC0wyzKdls=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2018__11__20181025-roast-beef-vicky-wasik-sauce-1500x1125-f6ce1aa9640145f69db197644a986e53.jpg"}, {"order": 3, "description": "Just before tri-tip comes out of the oven, add oil to a 12-inch cast iron, carbon steel, or heavy stainless steel skillet and heat over high heat until smoking. Add tri-tip to skillet and cook, using a small cast iron skillet or weight to press down on tri-tip for even browning. If the beef begins to char or the skillet begins smoking aggressively, reduce heat to medium-high. Cook until tri-tip is evenly browned on all sides and internal temperature registers 130°F (54°C), about 5 minutes.", "image_url": "https://www.seriouseats.com/thmb/9sljOKwcTXCgCYHZjcBbPD2P3Pg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2018__11__20181025-roast-beef-vicky-wasik-searing-1500x1125-1bb49af51df94b979fde630a7c2cf370.jpg"}, {"order": 4, "description": "Transfer tri-tip to a cutting board and allow to rest for 5 to 10 minutes. Meanwhile, add shallots to now-empty skillet, season lightly with salt and pepper, and cook, stirring frequently, until shallots are softened and lightly browned, about 6 minutes. Add remaining 1/4 cup (60ml) red wine to skillet and use a wooden spoon or rubber spatula to scrape up any browned bits from the bottom of the pan.", "image_url": "https://www.seriouseats.com/thmb/oxnOKBiY5Am78lF6Imqp2jwKNEU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2018__11__20181025-roast-beef-vicky-wasik-shallots-1500x1125-16521422bcc74af988fd6665c948b763.jpg"}, {"order": 5, "description": "Transfer shallot mixture to saucier with reduced stock and red wine mixture and stir to combine. Bring jus to a simmer over high heat and stir in soy sauce. Season to taste with salt and pepper.", "image_url": null}, {"order": 6, "description": "Cut and remove twine from tri-tip, then cut into 1/4- to 1/2-inch-thick slices if you are serving the beef as a main course. Slice into thin, 2-inch-wide pieces if you plan to serve the beef in sandwiches. Serve right away, passing shallot jus at the table.", "image_url": "https://www.seriouseats.com/thmb/m_hvDtOmJp_8mzYCY8wueVOBQao=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2018__11__20181025-roast-beef-vicky-wasik-35-1500x1125-4f31c8c69a47424189186912c77b4fcd.jpg"}]}
{"name": "Tres Leches Cake Recipe", "description": "This creamy, moist sponge cake is soaked with a three-milk mixture, topped with cream cheese-enriched whipped cream, and served thoroughly chilled.", "servings": "12 to 16", "mainImageUrl": "https://www.seriouseats.com/thmb/GqnePRf6n_zUKbcuu3uiGqsQg-k=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__20110316-127677-Serious-Sweets-Tres20Leches-PRIMARY-a92f3a58b014405899ae6d26cbff8856.jpg", "ingredients": ["2 cups all-purpose flour", "4 teaspoons baking powder", "6 large eggs, separated", "1 teaspoon salt", "2 cups sugar", "1/2 cup milk", "2 teaspoons vanilla extract", "2 (12-ounce) cans evaporated milk", "2 (14-ounce) cans sweetened condensed milk", "3 cups heavy cream", "1 teaspoon unflavored gelatin (see note)", "2 tablespoons water (see note)", "1/4 cup cream cheese, softened (see note)", "1/2 cup confectioners’ sugar"], "steps": [{"order": 0, "description": "Adjust oven rack to middle position and preheat oven to 325°F (160°C).", "image_url": null}, {"order": 1, "description": "Combine flour and baking powder in a small bowl; set aside.", "image_url": null}, {"order": 2, "description": "In the bowl of a stand mixer, beat egg whites and salt with whisk attachment on medium-low speed until whites begin to froth, about 1 minute. Increase speed to medium-high and beat whites until soft peaks form, 1 to 2 minutes. Slowly add the sugar and continue beating until stiff peaks form, 2 to 3 minutes. The mixture may look a bit thick.", "image_url": null}, {"order": 3, "description": "Add egg yolks and beat just until combined. Decrease speed to low and add flour in 3 additions, alternating with the milk, scraping sides and bottom of bowl as necessary. Add vanilla and beat just until combined.", "image_url": null}, {"order": 4, "description": "Scrape batter into an ungreased 13- by 9-inch baking dish. Bake until cake tester inserted in center comes out clean, 30 to 35 minutes (see note). Transfer cake to cooling rack and cool completely in pan, 60 to 90 minutes.", "image_url": null}, {"order": 5, "description": "Once cooled, poke cake all over with fork. Combine evaporated milk, sweetened condensed milk, and 1 1/2 cups heavy cream in large bowl. Pour mixture evenly all over cake. While cake soaks, make whipped cream.", "image_url": null}, {"order": 6, "description": "Combine gelatin and water in a small bowl. Microwave until gelatin dissolves, about 20 seconds. Cool to room temperature, about 5 minutes.", "image_url": null}, {"order": 7, "description": "In the clean bowl of stand mixer, beat cream cheese, confectioners’ sugar, and cooled gelatin with whisk attachment until soft and whippy, about 2 minutes. Add remaining 1 1/2 cups cream and beat to soft peaks, about 2 minutes.", "image_url": null}, {"order": 8, "description": "Spread whipped cream over cake and refrigerate until thoroughly chilled, at least 2 hours (see note). Serve.", "image_url": null}]}
{"name": "Traditional Sukiyaki (Japanese Beef Hot Pot)", "description": "How to make flavorful, traditional Japanese sukiyaki (beef hot pot) at home.", "servings": "serves 4", "mainImageUrl": "https://www.seriouseats.com/thmb/kz8b3hkZvM9czcVdyc4dc3xJ6go=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__03__032412-198499-sunday-supper-sukiyaki-primary-1b9918bb754d451d8bfe75a465876ff2.jpg", "ingredients": ["2/3 cup mirin", "2/3 cup sake", "2/3 cup soy sauce", "1 1/3 cups dashi", "1 tablespoon sugar", "1 1/2 pounds sirloin beef, sliced into 1/4- to 1/8th-inch strips", "8 ounces firm tofu, cut into 1-inch cubes", "8 ounces mushrooms, sliced (shiitake, portabello, button, enoki or a variety)", "1 yellow onion, sliced into thin rings", "8 scallions, cut into 2 inch pieces", "1 small head bok choy or napa cabbage, leaves cut into 1- to 2-inch segments", "1 cup short grain rice", "8 ounces shirataki or udon noodles", "4 eggs (optional)"], "steps": [{"order": 0, "description": "Bring mirin, sake, soy sauce, dashi, and sugar to a simmer and stir until sugar is dissolved. Remove from heat and reserve.", "image_url": null}, {"order": 1, "description": "Arrange beef and tofu on separate platters (or dinner plates) cover with plastic wrap and refrigerate. Arrange mushrooms, onion, scallions, and bok choy on a serving platter and set aside.", "image_url": null}, {"order": 2, "description": "Rinse rice in a fine-mesh strainer until water runs clear. Place in a small pot and cover with 2 cups water, bring to a simmer then turn heat to low and cover with a tight fitting lid. Steam until all the water is absorbed, about 30 minutes.", "image_url": null}, {"order": 3, "description": "Set up butane burner or electric hot plate, and carefully ignite. Place a thick bottomed, low sided pan over burner and pour in sauce mixture. Bring to a simmer.", "image_url": null}, {"order": 4, "description": "Divide rice among 4 small bowls. Place platters of ingredients around burner and cook as you eat by transferring to simmering broth and cooking to the desired doneness. If desired, break egg into a separate bowl, beat, and use to dip steaming hot ingredients into.", "image_url": null}]}
{"name": "Old Fashioned Cocktail", "description": "The classic Old Fashioned features little more than whiskey, sugar, and bitters. Done right, it&#39;s a perfectly balanced, timeless crowd-pleaser.", "servings": "Makes 1 cocktail", "mainImageUrl": "https://www.seriouseats.com/thmb/fVNaD9ejBpfiVdUixyIWV8HD1HY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20231204-SEA-OldFashioned-TwoBites-04-6a1e37d7f85647c8a181c8e3f82372b4.jpg", "ingredients": ["1 teaspoon (5g) superfine sugar, toasted sugar , or 1 sugar cube", "2 to 3 dashes bitters (Angostura bitters are traditional and work well; Fee Brothers’ Whiskey Barrel-Aged Old Fashioned Bitters are better)", "2 ounces (60ml) bourbon or rye whiskey", "Orange and/or cocktail cherry, such as Luxardo to garnish (optional)"], "steps": [{"order": 0, "description": "Combine whiskey, bitters, and sugar in a mixing glass. Add several large ice cubes and stir rapidly with a bar spoon to chill. Strain into a rocks glass with fresh ice. Garnish, if you like, with a slice of orange and/or a cherry.", "image_url": "https://www.seriouseats.com/thmb/FXzdgeKb5PWI4YG0ULmHghOvxlE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20231204-SEA-OldFashioned-TwoBites-step1-461a786daf6d4fe088a09980ff3c07d7.jpg"}]}
{"name": "Traditional Jewish Mandelbrot (Mandel Bread) Recipe", "description": "Family recipes aren&#39;t as set in stone as we all like to think. Like for example, this mandel bread. I called my mom for the recipe, which I&#39;d attributed to my Grandma...", "servings": "Makes about 48 biscotti", "mainImageUrl": "https://www.seriouseats.com/thmb/NFO5S1L89_-vrL-glLsFOHaEsDw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__20101216-cookie-swap-mandelbrei-610-646f850e821b498abc44a2cd2656f9cd.jpg", "ingredients": ["2 cups all-purpose flour", "1 teaspoon baking powder", "1/4 teaspoon salt", "About 1 cup golden raisins, mini chocolate chips, and walnuts or a combination of the three (Malgieri&#39;s recipe calls for almonds, and no raisins or chocolate chips.)", "2 large eggs", "1/2 cup sugar", "1 teaspoon vanilla extract (Malgieri calls for a teaspoon of almond extract in addition to the vanilla extract, but I skip it.)", "1/2 cup grapeseed or other neutral oil", "1/2 cup sugar mixed with 1 teaspoon cinnamon for finishing"], "steps": [{"order": 0, "description": "Set rack in middle level of the oven and preheat to 350°F.", "image_url": null}, {"order": 1, "description": "In a bowl, combine flour, baking powder, and salt; stir well to mix.", "image_url": null}, {"order": 2, "description": "In another bowl, whisk eggs by hand until well mixed. Add sugar and whisk until smooth. Whisk in extract and oil.", "image_url": null}, {"order": 3, "description": "Fold flour mixture into egg mixture until all flour is absorbed. Fold in nuts, raisins, and chocolate chips.", "image_url": null}, {"order": 4, "description": "On a lightly floured surface, press dough together. Divide dough in half and roll each half into a log the length of your pan (14 to 18 inches). Place each log on pan and flatten slightly. Bake until well-risen and firm, about 25-30 minutes. Cool the logs on the pans and racks.", "image_url": null}, {"order": 5, "description": "Reset racks in upper and lower thirds of oven. Using sharp serrated knife, slice baked logs diagonally about every 1/2 inch. Place cinnamon-sugar mixture in a shallow dish and turn the cut cookies in it. Return biscotti to the pans, cut side down, and bake until dry and crisp, up to 20 minutes longer.", "image_url": null}, {"order": 6, "description": "Store cooled cookies between sheets of parchment or wax paper in tin or plastic container with tight-fitting container.", "image_url": null}]}
{"name": "White Chocolate and Raspberry Frozen Mousse Bombes Recipe", "description": "If you&#39;re ever in the mood to put together a fancy dessert at home, mousse bombes are a fantastic way to go. They satisfy my craving for many things at once; a little cake, a little frozen mousse, and a surprise bit of fresh fruit, jelly, or nuts. Best of all, they have a gorgeous, smooth shell of chocolate that looks as beautiful as it tastes, giving you the dramatic payoff of a plated dessert with just a little effort.", "servings": "makes 6 3-inch bombes", "mainImageUrl": "https://www.seriouseats.com/thmb/lSYg2T9-N5x9-lzHR8Dyj6jYwPI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__02__20120127-188620-mousse-bombes-610x458-21-7ca1a9ca5b724af8bb9644837cc54674.jpg", "ingredients": ["For the Shells:", "4 ounces white chocolate, melted and tempered", "For the Cake:", "8 ounces butter", "10 ounces sugar", "2 eggs", "3 yolks", "2 ounces cocoa", "8.25 ounces all purpose flour", "1/2 teaspoon baking soda", "1/2 teaspoon baking powder", "1/2 teaspoon salt", "8.5 ounces buttermilk", "For the Mousse:", "5.25 ounces white chocolate", "2 ounces heavy cream", "1 teaspoon gelatin, bloomed in 2 tablespoons water", "1 pinch salt", "2 egg yolks", "6 ounces heavy cream, whipped to soft peaks and chilled", "Frozen raspberries for the center", "For the Raspberry Sauce:", "16 ounces frozen raspberries", "4 ounces granulated sugar"], "steps": [{"order": 0, "description": "To Prepare the Molds : Place dome mold sheet onto a sheet pan. Using a pastry brush, paint melted, tempered chocolate evenly on surface of each mold cavity, making sure chocolate goes straight to the edge. Place molds into fridge to set.", "image_url": null}, {"order": 1, "description": "To Prepare the Cake : Preheat oven to 350°F (180°C). Make an X with butter on surface of a rimmed baking sheet, then line it with parchment. In the bowl of a stand mixer fitted with paddle attachment, cream butter and sugar on high speed until light and fluffy, scraping down sides of bowl periodically. Add eggs and yolks one at a time, mixing well after each addition. Sift dry ingredients together. Turn mixer down to low speed and add half of the dry ingredients, followed by half the buttermilk. Mix on low until just incorporated, then add rest of the dry ingredients and buttermilk and mix until just incorporated. Remove bowl from stand mixer and finish mixing by hand with a large rubber spatula. Pour batter into prepared pan and spread it out evenly with an offset spatula.", "image_url": null}, {"order": 2, "description": "Bake cake for 15 to 20 minutes, rotating halfway through, until tester inserted into center comes out clean and cake begins to pull away from sides of pan. Allow cake to cool for 15 minutes in pan, then run paring knife around edges. Place a piece of parchment on cake, followed by an inverted sheet pan, then turn cake upside down. Gently peel back top parchment from cake and allow cake to rest for 10 minutes before punching out circles with round cutter the same size as mold cavities.", "image_url": null}, {"order": 3, "description": "To Prepare the Mousse: In a large bowl set over simmering water, melt white chocolate. Add the 2 ounces of cream a little at a time, stirring until mixture becomes smooth and warm to the touch. Melt bloomed gelatin in microwave (stop every 15 seconds to check) and stir into chocolate mixture. In a separate bowl, whisk together egg yolks and salt, then gradually whisk it into chocolate mixture. Continue whisking chocolate mixture for 1 minute over double broiler, then remove bowl from heat. Place bowl in fridge to cool to room temperature (mixture should be neither warm nor cold, about 20 minutes). Whisk firmed chocolate mixture to smooth it out. Stir 1/4 of the chilled whipped cream into chocolate mixture to lighten it, then gently fold in remaining cream.", "image_url": null}, {"order": 4, "description": "To Assemble the Bombes: Place mousse in a piping bag and pipe it into each chilled chocolate mold, taking care to only fill just to the top. Place a raspberry or two into each bombe and smooth mousse over top. Place a circle of cake over each mold and gently press cake into mousse. Place sheet pan of molds in freezer and allow them to set for at least 4 hours.", "image_url": null}, {"order": 5, "description": "To Make the Sauce: Place frozen raspberries and sugar in a saucepan over low heat, stirring occasionally. As raspberries begin to melt, stir to help break them up. When fruit begins to simmer, remove from heat. Press fruit pulp and juice through a fine-mesh strainer. Discard seeds and chill sauce.", "image_url": null}, {"order": 6, "description": "To Serve: Place a tablespoon of sauce onto each plate. Create a design by dragging the back of a spoon through sauce. Loosen edges of bombes, then turn each cavity inside out to unmold them. Let bombes sit for 20 minutes to allow cake time to thaw, then carefully place bombes onto prepared plates and serve.", "image_url": null}]}
{"name": "Traditional Irish Bacon, Cabbage, and Parsley Sauce Recipe", "description": "According to Darina Allen, author of Forgotten Skills of Cooking, bacon and cabbage is Ireland&#39;s national dish. Here&#39;s her version of a traditional recipe.", "servings": "12 to 15", "mainImageUrl": "https://www.seriouseats.com/thmb/3ZCOlxPoRx9PRQ63I2PodQ5txs4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__20100317irishbaconandcabbage-a82c53b65bd7479fa5fda5df4fbb859e.jpg", "ingredients": ["About 5 pounds loin, collar thick-cut bacon", "1 Savoy cabbage", "4 tablespoons butter", "freshly ground black pepper", "Parsley Sauce (recipe follows)", "2 cups whole milk", "A few parsley stems", "Sprig of thyme", "A few slices of carrot (optional)", "A few slices of onion (optional)", "salt and freshly ground black pepper", "4 tablespoons Roux (recipe follows)", "About 4 tablespoons freshly chopped curly parsley", "8 tablespoons butter", "Scant cup all purpose flour"], "steps": [{"order": 0, "description": "Cover bacon in cold water in a large pot and bring slowly to a boil.", "image_url": null}, {"order": 1, "description": "If bacon is very salty there will be a white froth on top of the water, in which case it is preferable to discard the water and start again.", "image_url": null}, {"order": 2, "description": "It may be necessary to change the water several times, depending on how salty the bacon is. Finally, cover bacon with hot water, place a lid on the pot, and simmer until bacon is almost cooked, allowing 20 minutes for every 1 pound.", "image_url": null}, {"order": 3, "description": "Meanwhile, trim the outer leaves of the cabbage and cut it into quarters, removing core. Discard core and outer leaves. Slice cabbage across the grain into thin shreds. If necessary, wash it quickly in cold water. About 20 minutes before the end of cooking the bacon, add shredded cabbage to the pot of simmering bacon.", "image_url": null}, {"order": 4, "description": "Stir, cover, and continue to boil gently until both cabbage and bacon are cooked, about 1 3⁄4 hours.", "image_url": null}, {"order": 5, "description": "To make roux, melt butter in a pan and cook flour for 2 minutes on low heat, stirring occasionally. It will keep for two weeks in the refrigerator.", "image_url": null}, {"order": 6, "description": "To make the sauce, add cold milk to a saucepan and add herbs and vegetables (if using). Bring mixture to simmering point, season with salt and pepper, and simmer for 4-5 minutes. Strain milk, bring it back to a boil, and whisk in 4 tablespoons roux until sauce is a light coating consistency. Season again with salt and pepper. Add chopped parsley and simmer over very low heat for 4 to 5 minutes. Taste and adjust seasoning if necessary.", "image_url": null}]}
{"name": "Traditional French Cassoulet", "description": "Here&#39;s how to make a traditional French cassoulet at home, complete with a trio of meats and beans with a rich sauce, all topped with a savory dark brown crust.", "servings": "Serves 6 to 8", "mainImageUrl": "https://www.seriouseats.com/thmb/zCvw3_JKa3h8JbSMRde7LRzyUp0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230724-SEA-TraditionalFrenchCassoulet-FredHardy-001-498130da7d5f4023b0bc50f631c891e0.jpg", "ingredients": ["1 pound dried cannellini beans", "3 tablespoons kosher salt; for table salt, use half as much by volume", "1 quart homemade or store-bought low-sodium chicken stock", "3 packets (3/4 ounce) unflavored gelatin, such as Knox (see note)", "2 tablespoons duck fat (optional)", "8 ounces salt pork, cut into 3/4-inch cubes", "6 to 8 pieces of chicken thighs and drumsticks, or 4 whole chicken leg quarters", "Freshly ground black pepper", "1 pound garlic sausage (2 to 4 links, depending on size)", "1 large onion, finely diced (about 1 cup)", "1 carrot, unpeeled, cut into 3-inch sections", "2 stalks celery, cut into 3-inch sections", "1 whole head garlic", "4 sprigs parsley", "2 bay leaves", "6 cloves"], "steps": [{"order": 0, "description": "In a large bowl, cover beans with 3 quarts (2.8L) water and add salt. Stir to combine, then let stand at room temperature overnight. Drain and rinse beans; set aside.", "image_url": "https://www.seriouseats.com/thmb/caenTF14lVeZZ5tgdvYosNFRQw8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230724-SEA-TraditionalFrenchCassoulet-FredHardy-006-666c9e1bc2bf4c3589af6c0af9cdc2d8.jpg"}, {"order": 1, "description": "Adjust oven rack to lower-middle position and preheat oven to 325°F (160°C). Place 4 cups (946ml) stock in a large liquid measuring cup and sprinkle gelatin, if using, over top. Set aside. In a large Dutch oven, heat duck fat (if using), salt pork, and pork shoulder and cook over high heat, stirring occasionally, until browned all over, about 9 minutes (if not using duck fat, cook pork with no additional fat). Using a slotted spoon, transfer to a large bowl, leaving rendered fat in Dutch oven, and set aside.", "image_url": "https://www.seriouseats.com/thmb/-5RD1EKPyTamJ9VIyROYVzF4faE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230724-SEA-TraditionalFrenchCassoulet-FredHardy-007-04a9be4f15c74fdf8bc52b93c5fc0e69.jpg"}, {"order": 2, "description": "Season chicken or duck thighs with pepper (do not add salt) and place skin side down in Dutch oven. Cook without moving until well-browned, 6 to 8 minutes. Transfer to a plate and let cool to room temperature.", "image_url": "https://www.seriouseats.com/thmb/gQnKnmbGU8TJXv9i3qhQGDpJyGU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230724-SEA-TraditionalFrenchCassoulet-FredHardy-008-6b2aa912603446988a587c4bf6ea6fb1.jpg"}, {"order": 3, "description": "Add sausages to Dutch oven and cook, turning occasionally, until well-browned, about 2 minutes per side. Transfer to bowl with salt pork. Drain all but 2 tablespoons fat from pot.", "image_url": "https://www.seriouseats.com/thmb/4SNbi1A1YkjIriXmO28E4L28k4g=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230724-SEA-TraditionalFrenchCassoulet-FredHardy-005-1372984537014e9d8ffc1c2682f76ae7.jpg"}, {"order": 4, "description": "Add onion to Dutch oven and cook, stirring and scraping up browned bits from bottom of pot, until onion is translucent but not browned, about 4 minutes. Add drained beans, carrot, celery, garlic, parsley, bay leaves, cloves, and stock/gelatin mixture. Bring to a simmer over high heat. Reduce to low, cover Dutch oven, and cook until beans are slightly softened but retain a bite, about 20 minutes.", "image_url": "https://www.seriouseats.com/thmb/cJ_esXcUGffzS0MZ_elDpBPgoJo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230724-SEA-TraditionalFrenchCassoulet-FredHardy-009-fefa60a806f54b4d8a108051296bddea.jpg"}, {"order": 5, "description": "Cover cooled chicken or duck and transfer to refrigerator. Using tongs, remove carrots, celery, parsley, bay leaves, and cloves from pot and discard. Add pork and sausages to pot and stir to incorporate. Beans should be almost completely submerged. Transfer to oven and cook, uncovered, adding remaining 1 cup (237ml) stock halfway through by pouring it carefully down side of pot as necessary to keep beans mostly covered, until a thin crust forms on top, about 1 hour 30 minutes.", "image_url": "https://www.seriouseats.com/thmb/PIbkqebblMXyrV3dIiWPF4VAGvg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230724-SEA-TraditionalFrenchCassoulet-FredHardy-010-fc4f79f18b1e46b89af94e3cc54ad7ad.jpg"}, {"order": 6, "description": "Break crust with a spoon and shake pot gently to redistribute. Nestle chicken or duck into the Dutch oven, skin side up. Return to oven and continue cooking, stopping to break and shake crust every 30 minutes, until crust is deep brown and thick, an additional 1 hour 30 minutes. Serve immediately.", "image_url": "https://www.seriouseats.com/thmb/NDx4RBGOHeGVivUXZKyAInGQN-s=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20230724-SEA-TraditionalFrenchCassoulet-FredHardy-011-f320aaa10c684241a613e2686312bb3b.jpg"}]}
{"name": "The Food Lab&#39;s Beef Pho", "description": "Roast beef bones, fresh vegetables, and warm spices make for a traditional, soul-warming Vietnamese beef pho.", "servings": "serves 6 to 8", "mainImageUrl": "https://www.seriouseats.com/thmb/U-hWLnDmSZ8_6v07v0yc-8uYxrE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__06__20120629-pho-food-lab-19-c94bfd465387441f83ee8939fdf67dbe.jpg", "ingredients": ["2 large onions, split in half", "1 large hand ginger (about 6 inches long), split in half lengthwise", "3 pounds beef shin, with meat attached", "2 pounds oxtail, cut into 1/2 to 1-inch thick slices", "1 pound boneless beef chuck", "1 pound beef brisket", "3 whole star anise pods", "1 cinnamon stick", "1 teaspoon fennel seeds", "4 cloves", "1 teaspoon coriander seeds", "1/4 cup fish sauce, plus more to taste", "2 tablespoons sugar (preferably yellow rock sugar)", "Kosher salt", "To Serve:", "6 to 8 servings pho noodles", "1 pound beef flank steak, sliced thinly against the grain", "2 to 3 cups mixed herbs (cilantro, basil, and mint)", "2 to 3 cups trimmed bean sprouts", "1/2 cup sliced scallions", "Thinly sliced Thai chiles", "2 limes, each cut into 4 wedges", "Hoisin sauce and Sriracha"], "steps": [{"order": 0, "description": "Place a wire cooling rack or grill grate directly over the flame of a gas burner set on high. Place onions and ginger on top and cook, turning occasionally, until deeply blackened on all sides, about 10 minutes total. Alternatively, adjust oven rack to 3 to 4 inches from broiler element and preheat broiler to high. Place onions and ginger on a foil-lined broiler tray. Broil, turning occasionally, until charred on all surfaces, about 25 minutes total. Set aside.", "image_url": "https://www.seriouseats.com/thmb/xdC04C87_6L6pqpQL_iTAz6Kiuo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__images__2012__06__20120629-pho-food-lab-08-caaf634e2be145d7b60a97b67b732912.jpg"}, {"order": 1, "description": "Meanwhile, combine beef shins, oxtail, chuck, and brisket in a large stockpot. Cover with cool water. Bring to a boil over high heat. Boil for 15 minutes, then dump water and meat into sink. When cool enough to handle, rinse parts under cool running tap water, carefully scrubbing debris off of any bones and out of cracks in the meat, then return them to the pot. Cover with cool water.", "image_url": "https://www.seriouseats.com/thmb/pAm_SMIiBnSzZ5PP0rHt2CN_66g=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__images__2012__06__20120629-pho-food-lab-12-e46ba08d50a1429892013cb58410b82e.jpg"}, {"order": 2, "description": "Add charred onions, ginger, anise, cinnamon, fennel, cloves, coriander, fish sauce, sugar, and 1 tablespoon salt. Bring to a boil over high heat, reduce to a bare simmer, and cook, skimming occasionally, until brisket and chuck are tender but not falling apart, about 1 1/2 hours. Transfer brisket and chuck to a small bowl and cover with cold water. Refrigerate until ready to serve.", "image_url": null}, {"order": 3, "description": "Continue simmering broth for a further 4 hours, topping up with water as necessary. Strain broth through a fine-mesh strainer. If desired, pick meat and connective tissue from oxtails and beef shins. Discard bones and aromatics. You should end up with about 4 quarts broth. Dilute with water or reduce as necessary to reach 4 quarts. Keep hot.", "image_url": null}, {"order": 4, "description": "Carefully skim fat off of surface of broth and discard. Season broth to taste with additional fish sauce, salt, and/or sugar. It should be highly seasoned. Slice cooked beef into thin slices or rough chunks.", "image_url": null}, {"order": 5, "description": "Prepare pho noodles according to package directions. To serve, place re-hydrated noodles in individual noodle bowls. Pour hot broth over noodles. Serve immediately, allowing guests to top with cooked meat and slices of raw flank steak, herbs, aromatics, lime, and sauce as they wish.", "image_url": "https://www.seriouseats.com/thmb/2vWyvO5gl9s5xYWBHKCmD5fZCrs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__images__2012__07__20120630-pho-2-11-9f34913349d448f1b2989689cf892b6d.jpg"}]}
{"name": "Dinner Tonight: Tortellini with Brown Butter and Sage Recipe", "description": "Brown butter with sage is almost archetypal, but the deliciousness (and simplicity of preparation) of brown butter never ceases to amaze me. The process is simply to cook butter gently in a skillet until the water in the butter has...", "servings": null, "mainImageUrl": "https://www.seriouseats.com/thmb/EUtL4e0sQ2LTzxMniF1Cr5jJbwc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__20090203tortelliniwithbrownbutter-d00967851b7e461b8eb46b7e13614578.jpg", "ingredients": ["1/2 pound dry pasta or two servings of frozen tortellini", "3 to 4 tablespoons unsalted butter", "1/3 cup sage leaves, about 10 to 15, left whole or thinly sliced", "1 tablespoon lemon juice, or to taste", "Freshly grated black pepper", "Salt to taste", "Freshly grated Parmesan (optional)"], "steps": [{"order": 0, "description": "Bring a pot of water to a boil; add salt. Cook the pasta or tortellini according to package instructions, then drain.", "image_url": null}, {"order": 1, "description": "In a small skillet, melt the butter over medium heat. Continue cooking until the butter begins to brown, keeping a very close watch to ensure it doesn&#39;t burn. Keep in mind that the temperature will continue to rise even off the heat. When the butter is nearing completion, add the sage leaves to crisp in the hot fat. Remove from heat and add the lemon juice to halt the cooking, plus a pinch of salt (unless you&#39;re using salted butter).", "image_url": null}, {"order": 2, "description": "Toss the drained pasta into the skillet, coating well with the sauce. Finish with black pepper and Parmesan, if desired. Serve immediately.", "image_url": null}]}
{"name": "Ultra Crispy Burgers Recipe", "description": "This crispy burger is made of a mix of sirloin, brisket, and oxtail for intense beefy flavor. Thin patties cooked over high heat is the secret to a crispy exterior.", "servings": "4 burgers", "mainImageUrl": "https://www.seriouseats.com/thmb/r2cq9LFnqazdaxY2SJ7fNaOyCAA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2014__01__crisp20burger20-2008-1a09f3cde42f4d8693ae78fd21f4fad0.jpg", "ingredients": ["6 ounces beef sirloin, trimmed of gristle, and cut into 1-inch cubes", "5 ounces beef brisket, trimmed of gristle, and cut into 1-inch cubes", "12 ounces oxtail, fat and meat carefully removed from bone and trimmed of silverskin, bones discarded or reserved for another use (about 5 ounces of combined meat and fat)", "Kosher salt and freshly ground black pepper", "1/2 teaspoon vegetable oil", "4 slices American cheese", "4 soft white burger buns, lightly toasted", "Pickles chips and sliced onions (optional)"], "steps": [{"order": 0, "description": "Place feed shaft, blade, and 1/4-inch die of meat grinder in freezer until well-chilled. Meanwhile, place meat chunks on rimmed baking sheet, leaving space between each piece and place in freezer for 10 minutes until meat is firm, but not frozen.", "image_url": null}, {"order": 1, "description": "Combine meat in large bowl and toss to combine. Grind meat directly onto parchment or foil-lined rimmed baking sheet.", "image_url": null}, {"order": 2, "description": "Without picking the meat up, divide it into four piles on baking sheet and gently press piles into patties approximately 4-inches wide and 1/2-inch thick. Patties should remain loose and have ragged edges. Season generously with salt and pepper. Using wide spatula, carefully flip patties over (some may fall apart - just push them together again). Season second side with salt and pepper and refrigerate until ready to use (can be stored on sheet tray covered with plastic wrap in refrigerator for up to 1 day).", "image_url": null}, {"order": 3, "description": "Heat vegetable oil in heavy-bottomed 8-inch sauté pan over high heat until smoking. Carefully transfer patty to skillet and cook without moving until dark crust forms, about 2 1/2 minutes (open your window, disarm your fire alarm, and be prepared for splatters). Using spatula, carefully flip patty and top with cheese. Continue to cook for one to two minutes longer until desired doneness is reached (patty will be at least medium, but will still remain juicy even until well-done)", "image_url": null}, {"order": 4, "description": "Meanwhile, place pickles and onions on burger bun bottom if desired. Top with cooked patty, close buns, and eat immediately. Repeat with remaining burgers, discarding all but 1 teaspoon fat from skillet between burgers. This Recipe Appears In \n The Burger Lab: The World's Best Burger for a Single Man (or Woman)", "image_url": null}]}
{"name": "Ultra-Creamy Spinach and Mushroom Lasagna Recipe", "description": "An ultra-creamy, rich, and hearty vegetarian lasagna stuffed with spinach, mushrooms, and cheese. Rich enough to appease even the most hardcore meat eater.", "servings": "serves 6 to 8", "mainImageUrl": "https://www.seriouseats.com/thmb/bzvUUPzG2SeqljozJq5X1tFCFok=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__10__20121010-vegetarian-lasagna-spinach-mushroom-whole-0d7b58ad51dc4352b77dca329d203bb1.jpg", "ingredients": ["8 tablespoons (1 stick) unsalted butter, plus more for greasing baking dish, divided", "3 medium cloves garlic, minced (about 1 tablespoon)", "2 pounds washed fresh spinach leaves, roughly chopped", "1 pint (2 cups) heavy cream, divided", "1/2 teaspoon freshly grated nutmeg", "Kosher salt and freshly ground black pepper", "1 pound cottage cheese", "1/2 cup chopped fresh parsley leaves, divided", "1 egg", "1 package (15 sheets) no-boil lasagna noodles", "24 ounces button, cremini, or shiitake mushrooms, stems removed, finely chopped (see note)", "2 medium shallots, finely chopped (about 1/2 cup)", "2 teaspoons minced fresh thyme leaves", "1 tablespoon soy sauce", "2 teaspoons fresh juice from 1 lemon", "2 tablespoons flour", "2 cups whole milk", "12 ounces whole milk mozzarella, grated, divided", "2 ounces Parmiggiano-reggiano, grated"], "steps": [{"order": 0, "description": "Adjust an oven rack to the upper-middle position and preheat oven to 400°F (200°C). Melt 3 tablespoons butter in a large saucepan over medium-high heat until foaming subsides. Add garlic and cook, stirring constantly, until fragrant, about 30 seconds. Add spinach in batches, allowing previous batch to wilt before adding next. Once all spinach is added, add 1 cup heavy cream. Bring to a boil, and reduce to a strong simmer. Cook, stirring frequently, until thick and reduced, about 15 minutes. Add nutmeg, and season to taste with salt and pepper.", "image_url": null}, {"order": 1, "description": "While spinach is cooking, combine cottage cheese, egg, and 6 tablespoons parsley in the bowl of a food processor. Process until combined and cottage cheese is broken up to the texture of ricotta cheese, about 5 seconds.", "image_url": null}, {"order": 2, "description": "Combine cooked spinach and cottage cheese mixture in a large bowl. Meanwhile, place lasagna noodles in a 8- by 13-inch baking dish and cover with warm water. Allow to soak, agitating occasionally to prevent sticking, until lightly softened, about 15 minutes. Transfer in a single layer to a clean kitchen towel to dry.", "image_url": null}, {"order": 3, "description": "While noodles soak, wipe out spinach pot and return to medium-high heat. Add 3 more tablepsoons butter and heat until melted. Add mushrooms and cook, stirring occasionally, until liquid evaporates and mushrooms start to sizzle, about 10 minutes. Add shallots and thyme and cook, stirring frequently, until fragrant and softened, about 2 minutes. Add soy sauce and lemon juice and stir to combine. Add remaining heavy cream. Bring to a simmer, and cook until lightly thickened, about 3 minutes. Season to taste with salt and pepper. Transfer mixture to another bowl.", "image_url": null}, {"order": 4, "description": "Wipe out pot and return to medium-high heat. Add remaining 2 tablespoons butter and heat until melted. Add flour and cook, stirring constantly with a whisk, until light golden blond. Slowly pour in milk, whisking constantly. Bring to a simmer, then remove from heat. Stir in 2/3 of mozzarella and Parmesan, then season to taste with salt and pepper.", "image_url": null}, {"order": 5, "description": "To assemble lasagna, dry the 8- by 13-inch baking dish and grease with butter. Add 1 cup cheese sauce to bottom of dish. Lay three sheets of noodle on top of it, spacing them evenly across the bottom of the dish (there will be about 1/4-inch gap between each sheet of noodle and the edge of the pan. This is fine). Top noodle evenly with half of mushroom mixture, then top with another three sheets. Top with half of spinach/cottage cheese mixture, then top with another three sheets of noodle. Repeat layers with remaining mushroom mixture, spinach mixture, and noodle, ending with a layer of noodle. Pour remaining cheese sauce over top and spread evenly. Sprinkle remaining 1/3 of grated mozzarella evenly over top.", "image_url": null}, {"order": 6, "description": "Bake until lasagna is bubbling around the edges, about 20 minutes. Switch broiler on and broil until top is lightly browned, about 5 minutes longer (if you have an under-oven broiler, you&#39;ll have to transfer it to the broiler after baking). Let cool for 10 minutes, then slice and serve, garnish with chopped parsley.", "image_url": null}]}
{"name": "Ultimate Sriracha Burger Recipe | Cook the Book", "description": "The Ultimate Sriracha Burger from The Sriracha Cookbook begins with a grilled patty infused with Sriracha and soy, and is topped with a towering pile of bacon caramelized onions, Swiss cheese, tomato, arugula, bacon, and an improbably delicious blue cheese-Sriracha dressing.", "servings": "8", "mainImageUrl": "https://www.seriouseats.com/thmb/AVDB7Eu8ErQX4Mo9PnCZL1Z-MX8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__20110129-135209-ultimate-sriracha-burger-51390e34c7c141eb8343e08961cf8177.jpg", "ingredients": ["3 pounds ground beef (preferably chuck, 80/20)", "1/4 cup soy sauce", "10 tablespoons Sriracha", "4 teaspoons freshly ground black pepper", "4 slices thick-cut bacon", "2 large sweet onions", "3/4 cup blue cheese dressing", "8 sesame seed buns", "8 thick slices Swiss cheese", "1 large beefsteak tomato, sliced", "Arugula or romaine lettuce "], "steps": [{"order": 0, "description": "In a large mixing bowl, combine the ground beef, soy sauce, 5 tablespoons of the Sriracha, and the pepper. Do not overmix. Form the mixture into 8 patties, and set aside, on a parchment-lined baking sheet, covered, in the refrigerator.", "image_url": null}, {"order": 1, "description": "Preheat a charcoal or gas grill to medium high heat.", "image_url": null}, {"order": 2, "description": "In a medium frying pan over medium-low heat, cook the bacon, turning as necessary. While the bacon is cooking, peel and quarter the onions. Cut each section into 1/4-inch slices. Once the bacon is cooked through and slightly crispy, remove the slices from the pan, cut each in half crosswise, and drain onto paper towels, reserving the remaining bacon fat in the pan. Cook the sliced onions in the bacon fat over medium-low heat until they caramelize, 20 to 25 minutes.", "image_url": null}, {"order": 3, "description": "Grill the burgers, turning once, 4 to 4 1/2 minutes on each side or until a meat thermometer registers 130° to 135°F for medium-rare.", "image_url": null}, {"order": 4, "description": "While the burgers are cooking, in a small bowl, combine the blue cheese dressing with the remaining 5 tablespoons Sriracha. Lightly toast the buns on the grill during the last minute of cooking time.", "image_url": null}, {"order": 5, "description": "To assemble, spread the blue cheese mixture on both halves of each hamburger bun. Stack a burger patty, Swiss cheese slice, bacon, caramelized onions, tomato slice, and a small handful of arugula between each hamburger bun.", "image_url": null}]}
{"name": "The Ultimate Poutine Recipe", "description": "A perfect poutine is a trifecta of the best of its three ingredients—fries with a crisp exterior and soft interior, fresh and soft squeaky cheese curds, and a beefy brown gravy that&#39;s just flavorful enough without overwhelming the fries or curds. Getting each piece of the puzzle together for an ultimate version like this takes some time, but once complete, the reward is so good you&#39;ll go gaga even if you&#39;re totally sober.", "servings": "Serves 4-6", "mainImageUrl": "https://www.seriouseats.com/thmb/vICHAu16XWhAc-WLQV-7avihHKY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/ultimate-perfect-poutine-fries-cheese-curds-gravy-recipe-hero-2-7637732f8c174bc59f9b84e7b6e6b660.jpg", "ingredients": ["For the Gravy (See Note):", "1 tablespoon canola or vegetable oil", "2 pounds beef oxtails", "1 pound beef marrow bones", "1 pound veal bones", "1 pound chicken necks, backs, or legs", "2 medium carrots, roughly chopped", "1 stalk celery, roughly chopped", "1 large onion, quartered", "4 medium cloves garlic, smashed and peeled", "1 quart homemade chicken stock or low-sodium broth", "3 quarts water", "3 sprigs fresh parsley", "3 sprigs fresh thyme", "2 bay leaves", "1 tablespoon whole black peppercorns", "1/4 cup unsalted butter", "1/4 cup all-purpose flour", "1 tablespoon rice vinegar", "Kosher salt", "For the Fries:", "4 large skin-on russet potatoes (about 2 pounds), cut into 1/4-inch sticks on a mandoline", "2 quarts peanut oil", "12 ounces freshly made white cheddar cheese curds (preferably not more than 24 hours old), either store-bought or homemade , at room temperature and broken into bite-size pieces"], "steps": [{"order": 0, "description": "For the Gravy: Melt butter in a medium saucepan over medium-high heat until foaming. Whisk in flour and cook, stirring constantly, until golden blonde, about 2 minutes. In a steady stream, gradually whisk in stock. Bring to a boil, reduce to a simmer, and cook until reduced to 2 cups, 10 to 15 minutes. Remove from heat, stir in vinegar, and season with salt.", "image_url": "https://www.seriouseats.com/thmb/H0ZwMAOxJpEw6A2PU5Je-1gsqXs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/ultimate-perfect-poutine-fries-cheese-curds-gravy-recipe-step1-e036ed3e528c434fbc7b75eb56f5eb1e.jpg"}, {"order": 1, "description": "For the Fries: Place potatoes in a large bowl and cover completely with cold water. Let soak for at least 1 hour, or, alternatively, drain water and rinse again, changing water until it runs completely clear. Drain potatoes and dry thoroughly with paper towels.", "image_url": "https://www.seriouseats.com/thmb/zXlBb8iG3fACNfVVG3gLNHMHGQc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/ultimate-perfect-poutine-fries-cheese-curds-gravy-recipe-step-02-f94aabaf885b45b8aa2650c7a82cce8a.jpg"}, {"order": 2, "description": "Heat oil in a large Dutch oven or wok to 350°F (177°C). Working in batches, add potatoes and cook, stirring and turning frequently until pale blonde, about 5 minutes. Transfer potatoes to a paper towel-lined baking sheet. (For crispiest fries, see note about adding a freezing step.)", "image_url": "https://www.seriouseats.com/thmb/gjYse9U0vJBY37BCqVCS74xB8s4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/ultimate-perfect-poutine-fries-cheese-curds-gravy-recipe-step-03-f0141681ac164f0ba9f256428d83c0a4.jpg"}, {"order": 3, "description": "Heat oil to 425°F (218°C). Add potatoes and cook, stirring and turning frequently, until deep golden brown, about 3 minutes. Transfer to paper towel-lined bowl and season with salt to taste.", "image_url": "https://www.seriouseats.com/thmb/003u9Xxmf6CAHEVGlnw9jJDpRkE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/ultimate-perfect-poutine-fries-cheese-curds-gravy-recipe-step-04-eed6de4074764cdd88088a10bc20d779.jpg"}, {"order": 4, "description": "Reheat gravy over high heat until hot. Place fries in a shallow bowl or dish, top generously with cheese curds, and ladle on gravy. Sprinkle with minced chives (optional). Serve immediately.", "image_url": "https://www.seriouseats.com/thmb/szJ19txxCICHs71dozxQzn3w-cg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/ultimate-perfect-poutine-fries-cheese-curds-gravy-recipe-step5-b5f95704d5164800bbe4c2690d1c5e66.jpg"}]}
{"name": "The Ultimate Homemade McRib (Smoked Rib Sandwich)", "description": "A step-by-step guide to making McDonald&#39;s McRib, the rarely available pork-and-barbecue-sauce sandwich with a cult-like following.", "servings": null, "mainImageUrl": "https://www.seriouseats.com/thmb/_UyvjM9s6DNuO309ptrT1KSrl-I=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240130-SEA-UltimateMcRib-JenCausey-03-45ab9b49751a4c38ad3b198249df611f.jpg", "ingredients": ["2 (2-pound; 900g) racks baby back ribs", "1 recipe Easy All-Purpose Barbecue Sauce and Rub (see note)", "1 1/2 pounds (700g) boneless pork shoulder, cut into 1-inch cubes", "12g kosher salt (about 1/2 ounce; 1 tablespoon)", "12g sugar (about 1/2 ounce; 1 tablespoon)", "1 recipe Cemita Buns (see note)", "1 recipe Quick Dill Pickles (see note)", "1 white onion, thinly sliced"], "steps": [{"order": 0, "description": "For Smoking the Ribs: Place ribs, bone side up, on a cutting board. Using paper towels to grip, pull the transparent membrane off the bones. It should come off easily in one large strip (see photo for reference). Rub ribs generously on all surfaces with barbecue rub, then split them into 4- to 5-rib sections with a sharp chef&#39;s knife or boning knife. Transfer to a covered container and refrigerate for at least 4 hours and up to overnight.", "image_url": "https://www.seriouseats.com/thmb/7KiF4xTcKaRwW59DeUR9EsGanGI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240130-SEA-UltimateMcRib-JenCausey-06-c05052bf7c1c47fcaa8bf07bc5801706.jpg"}, {"order": 1, "description": "Meanwhile, in a large bowl, combine pork shoulder, salt, and sugar and toss to coat. Transfer to a zipper-lock bag and refrigerate for at least 4 hours or up to overnight.", "image_url": "https://www.seriouseats.com/thmb/gBd8BV4S3X-x88pQqYiFRcgWqeU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240130-SEA-UltimateMcRib-JenCausey-07-51d7ea08828e4838855501d41c446ac9.jpg"}, {"order": 2, "description": "Open bottom vent of a charcoal grill completely. Light large charcoal chimney starter filled 1/3 of the way with charcoal briquettes (about 2 quarts). When top coals are partially covered with ash, pour evenly over half of the bottom grill grate. Place a few wood chunks directly on top of charcoal. Set cooking grate in place, cover, and open lid vent completely. Heat until 275°F (135℃), about 5 minutes. Clean and oil cooking grate then arrange ribs, bone side down, on cooler side of grill. Cover, with vents over ribs. Smoke, covered, adjusting vents as needed and adding more coals as needed to maintain a grill temperature between 225°F to 275°F (105℃ to 135℃), and adding a wood chunk every 45 minutes, until ribs show a gentle bend when you lift them and show only slight resistance when a toothpick is inserted between the bones and an instant read thermometer inserted in thickest portion registers between 190°F to 200°F, 4 to 5 hours.", "image_url": "https://www.seriouseats.com/thmb/twuqTYPhHyth4WLjbo3Su6z-GDw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240130-SEA-UltimateMcRib-JenCausey-08-c66bde7c625a468ca927a9812e25152b.jpg"}, {"order": 3, "description": "Brush tops and sides of ribs with barbecue sauce, cover, and continue smoking for 10 minutes. Repeat process 2 more times (about ½ cup sauce total), then transfer to a cutting board. Let cool slightly, about 15 minutes.", "image_url": "https://www.seriouseats.com/thmb/PKheW-ME7B591JVuTAF3rYTvazQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240130-SEA-UltimateMcRib-Jen-Causey-step4-833113211fd646b793d4c7c174ba24bf.jpg"}, {"order": 4, "description": "For Making the McRib Patties: Once cool enough to handle, twist bones out of ribs and discard bones. Roughly chop the meat. Spread on a large plate in a single layer and refrigerate until thoroughly chilled, about 2 hours.", "image_url": "https://www.seriouseats.com/thmb/P-U0wyC1j0VbYW4OiJBtPd3G7Qs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240130-SEA-UltimateMcRib-JenCausey-11-a172c951869b45d9969af76fa127b929.jpg"}, {"order": 5, "description": "In a food processor, pulse 1/4 of the chilled rib meat with ¼ of the pork shoulder until roughly ground, about 12 pulses. Transfer to a large bowl and repeat the pulsing process with the rib meat and shoulder meat in 3 batches, keeping the meat refrigerated until ready to pulse. Toss the pulsed meat together with hands to evenly mix.", "image_url": "https://www.seriouseats.com/thmb/DaHE0M6DLOaMHEHHLBNYZfVSdlY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240130-SEA-UltimateMcRib-Jen-Causey-step6-fd7ef3e627904871b7a67d3b0bc7aeb7.jpg"}, {"order": 6, "description": "Set a double layer of parchment paper measuring 9-by 18-inches on work surface. Transfer meat mixture to the center of parchment paper. Cover mixture with parchment paper, then, using your hands over the parchment, spread mixture out to form a 9- by 18-inch rectangle.", "image_url": "https://www.seriouseats.com/thmb/S-FBSYJhjwde_U7TeHI_cvL5DMQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240130-SEA-UltimateMcRib-JenCausey-14-00ac8f4fc0a045509cea47e0d97eac2a.jpg"}, {"order": 7, "description": "Using a sharp chef&#39;s knife and cutting through the parchment paper, cut the large rectangle into 8 individual patties measuring 4 1/2 by 4 1/2 inches each. Slide the patties with the parchment to a rimmed baking sheet and refrigerate until ready to use. (Patties can be stacked with their parchment paper intact and stored in the refrigerator for up to 3 days, or in a freezer bag in the freezer for several months. If freezing, cook directly from frozen.)", "image_url": "https://www.seriouseats.com/thmb/Fhod1yskww9imUew-7qWBLhV_Xo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240130-SEA-UltimateMcRib-JenCausey-15-08805287bef54fd085237fe324c6bad4.jpg"}, {"order": 8, "description": "Open bottom vent of charcoal grill completely. Light large charcoal chimney starter filled with charcoal briquettes (6 quarts). When top coals are partially covered with ash, pour evenly over bottom grill grate. Set cooking grate in place, cover, and open lid vent completely. Heat grill until hot, about 500°F (260℃), about 5 minutes. Cover and allow to preheat for 5 minutes.", "image_url": null}, {"order": 9, "description": "Clean and oil cooking grate. Transfer prepared patties to grill and sprinkle with remaining spice rub. Cook, flipping once halfway through, until well charred, about 2 minutes per side. Brush patties with barbecue sauce (about 1 cup sauce total), cover, and cook until patties are cooked through and barbecue sauce forms a lacquered glaze, 1 to 2 minutes. remove from grill and transfer to plate. Toast cut sides on grill until golden brown, 1 to 2 minutes.", "image_url": "https://www.seriouseats.com/thmb/7DQp9F1R4Da39OiiVwhGYwpyI8Y=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240130-SEA-UltimateMcRib-Jen-Causey-step8-f1ca5fbe70b546a1901e9191f9a6d541.jpg"}, {"order": 10, "description": "For Assembling the Sandwiches: Place one patty on each bun bottom. Brush with remaining sauce, and top with pickles, onion, and bun top. Serve.", "image_url": "https://www.seriouseats.com/thmb/MDTHnpcWnUSiyVlnD1CusMEwPQs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20240130-SEA-UltimateMcRib-Jen-Causey-step9-c561869aa18848fd80b139529fd5916d.jpg"}]}
{"name": "Planked Figs With Pancetta and Goat Cheese Recipe", "description": "Sweet figs plus salty meat make for an automatic win, but little additions in this recipe like goat cheese, honey, and grilling on a plank make these pancetta-wrapped figs something special.", "servings": null, "mainImageUrl": "https://www.seriouseats.com/thmb/JiugwG66ULzkoC4Xydbleha8z4w=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2013__03__20130303-243011-planked-figs-2c2acbf6a4d045e7aab4540aaf445010.jpg", "ingredients": ["10 fresh figs, halved", "2 tablespoons Grand Marnier", "Kosher salt and freshly ground black pepper", "4 ounces pancetta, sliced thin and cut into 1/2-inch strips lengthwise", "3 ounces goat cheese, crumbled", "2 tablespoons honey", "2 cedar planks, soaked for 1 hour prior to use", "Type of fire: two-zone indirect", "Grill heat: medium"], "steps": [{"order": 0, "description": "Place figs, cut side up, on a plate. Drizzle with Grand Marnier and season heavily with pepper and lightly with salt. Let sit for 15 minutes. Wrap each fig with one strip of pancetta; secure with toothpick.", "image_url": "https://www.seriouseats.com/thmb/Ufbd1DHqJUCFu3d4h60L-j2ag5Q=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__20130303-243011-planked-figs-step-1-1-77c09ee96033442ca8fc4a2dba0c55ef.jpg"}, {"order": 1, "description": "Dice remaining pancetta. Place pancetta in medium skillet over medium-high heat. Cook pancetta until crisp, 7-10 minutes. Transfer pancetta to paper towel lined plate. Set aside.", "image_url": "https://www.seriouseats.com/thmb/kUxMaZnsYz8M9HbvX2c1mkmYyJc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__20130303-243011-planked-figs-step-2-ab1bebd1f86c4da1a91926ea33e6c0e2.jpg"}, {"order": 2, "description": "Light one chimney full of charcoal. When all the charcoal is lit and covered with gray ash, pour out and arrange the coals on one side of the charcoal grate. Set cooking grate in place, cover grill and allow to preheat for 5 minutes. Place planks over hot side of the grill until they start to char and smoke. Flip planks over and move to cool side of grill and arrange figs on top. Sprinkle figs with goats cheese and crisped pancetta. Cover grill and cook until figs soften and uncooked pancetta browns, about 15 minutes.", "image_url": "https://www.seriouseats.com/thmb/Lc652dxnF_llWTLTejdlDOCDQII=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__20130303-243011-planked-figs-step-3-f460b85910b743c081d1fdb50952f66f.jpg"}, {"order": 3, "description": "Remove planks from grill. Drizzle figs with honey. Let cool for 5 minutes, then serve.", "image_url": "https://www.seriouseats.com/thmb/cob360D6FsrYt9EEhSikzqn80-M=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__20130303-243011-planked-figs-step-4-d3f40c6cf5194437952dc5909961b279.jpg"}]}
{"name": "Gluten-Free Cheesy Broccoli Soup Recipe", "description": "The secret ingredient to this gluten-free cheesy broccoli soup? Velveeta.", "servings": "6 for lunch; 4 for dinner", "mainImageUrl": "https://www.seriouseats.com/thmb/k51C457CcFV7i_-OadcbjOsjDeY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2014__01__20140107-279057-GFTues-CheesyBroccoli-Recipes-d211101d19a949698c52ab750d11520c.jpg", "ingredients": ["1/4 cup (4 tablespoons) unsalted butter", "1 medium onion (5 ounces), finely chopped", "1 clove garlic, minced or put through a garlic press", "1 teaspoon Dijon mustard", "1/4 cup sweet rice flour", "4 cups homemade chicken stock or store-bought gluten-free reduced-sodium broth", "1 1/2 cups whole or 2% milk", "1 package (16 ounces) frozen chopped broccoli", "1 large carrot (2 ounces), peeled and grated", "1 teaspoon hot pepper sauce", "1/2 teaspoon freshly ground black pepper", "8 ounces Velveeta, cut into small cubes (see note)", "Salt"], "steps": [{"order": 0, "description": "In a large pot, melt the butter over medium-high heat. Add the onion and cook, stirring frequently with a wooden spoon, until translucent and soft, about 2 minutes. Add the garlic and cook for 1 minute. Continue to stir frequently. Add the mustard and stir to combine.", "image_url": null}, {"order": 1, "description": "Stir in the sweet rice flour until a paste forms. Cook, stirring constantly, until the paste is a light golden brown, about 4 minutes. Whisk in the chicken stock in a slow and steady steam. Whisk in the milk. Bring to a boil, reduce to a bare simmer, then add the broccoli, carrot, hot pepper sauce, and black pepper. Simmer (look for occasional gentle bubbles) for 30 minutes.", "image_url": null}, {"order": 2, "description": "Using a slotted spoon, transfer the broccoli from the soup to a blender or food processor. Add a generous splash of soup, about 1/2 cup. (Don’t fill the blender more than halfway. Work in batches if you have a small blender.) Blend until the broccoli is almost smooth but not a paste.", "image_url": null}, {"order": 3, "description": "Return the broccoli to the soup. Stir to combine. Add the Velveeta. Using a wooden spoon, stir until the Velveeta is melted (see note). Season to taste with salt and simmer for 5 minutes. Serve. Store leftover soup in a covered container in the refrigerator for up to 3 days.", "image_url": null}]}
{"name": "Hearty Winter Vegetable Soup", "description": "A quick and hearty vegetable soup with carrots, potatoes, leeks, and kale. 100% plant-based, 100% satisfying.", "servings": "Serves 4 to 6 (makes about 2 1/2 quarts)", "mainImageUrl": "https://www.seriouseats.com/thmb/e6_v-btPAbAZ6jv2XIBbuqdYboQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2013__02__20130210-hearty-vegetable-soup-vegan-recipe-5-15d30b6e431042acb4579b62d5fa31f2.jpg", "ingredients": ["1 recipe Hearty Vegetable Stock , along with re-hydrated mushrooms from the stock", "2 leeks, white parts only, split in half lengthwise, cut into 1/4-inch slices", "1 medium carrot, diced", "2 stalks celery, diced", "1 large Yukon gold potato, diced", "1 cup cooked chickpeas, rinsed and drained (or any other cooked canned bean)", "1 small bunch kale, thick stems removed, leaves roughly torn", "1 teaspoon soy sauce", "Kosher salt and freshly ground black pepper", "1 tablespoon cornstarch mixed with 1 tablespoon water", "1 to 2 tablespoons fresh juice from 1 lemon", "2 tablespoons chopped fresh parsley leaves", "Extra-virgin olive oil"], "steps": [{"order": 0, "description": "Chop reserved re-hydrated mushrooms kept from making hearty vegetable stock into half-inch pieces. Add mushrooms, broth, leeks, carrot, celery, potato, chickpeas, kale, and soy sauce to a large saucepan. Bring to a boil over medium-high heat, reduce to a simmer, and cook, stirring occasionally, until potatoes are completely tender and beginning to fall apart, about 25 minutes. Stir in cornstarch slurry and allow to simmer 2 minutes longer.", "image_url": "https://www.seriouseats.com/thmb/BZ_LpAa_h2mdOwdtqHXFc_7tpgw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__images__2013__02__20130210-hearty-vegetable-soup-vegan-recipe-4-e4bf0bc911954d819517ef6abfe79f20.jpg"}, {"order": 1, "description": "Season to taste with salt and pepper, stir in lemon juice and parsley, and serve, drizzling extra-virgin olive oil into bowls as you eat.", "image_url": null}]}
{"name": "Hearty White Bean and Spinach Soup with Rosemary and Garlic Recipe", "description": "White beans in a garlicky rosemary broth with wilted spinach make for a quick and easy, balanced, and delicious 30-minute meal in a bowl.", "servings": "Serves 2 to 3", "mainImageUrl": "https://www.seriouseats.com/thmb/XJ6NAedbhymq5HOsA5BoNx5oRrU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2013__02__20130210-white-bean-spinach-soup-1-26567eb86f47473cb0a8a507b6176237.jpg", "ingredients": ["1/4 cup extra-virgin olive oil, divided", "1 medium onion, finely sliced (about 1 cup)", "1 stalk celery, diced (about 1/2 cup)", "6 medium cloves garlic, thinly sliced", "1 tablespoon chopped fresh rosemary leaves", "1 quart vegetable stock", "1 bay leaf", "1 (15 ounce) can white beans, drained and rinsed", "1 bunch spinach (about 4 ounces), trimmed and washed", "2 teaspoons juice from 1 lemon", "Kosher salt and freshly ground black pepper"], "steps": [{"order": 0, "description": "Heat 2 tablespoons oil in a medium saucepan over medium-high heat until shimmering. Add onions, celery, garlic, and rosemary. Cook, stirring frequently, until onions and garlic are softened but not browned, about 4 minutes. Add broth, bay leaves and beans. Bring to a boil, reduce to a bare simmer and cook for 10 minutes. Add spinach and continue cooking until completely wilted, about 5 minutes longer. Season to taste with salt and pepper. Stir in lemon juice. Serve immediately, drizzling remaining olive oil over bowls.", "image_url": null}]}
{"name": "The Best BLT Sandwich", "description": "The secret to the best bacon, lettuce, and tomato? Use the best tomatoes. Put away the fancy bread. Slow-cook the bacon. And most importantly: Don&#39;t mess with it.", "servings": "Makes 1 sandwich", "mainImageUrl": "https://www.seriouseats.com/thmb/HY30T7e4d2_4-QCDDOZqfg0KSfg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20220811-_ultimate-blt-sandwich-bacon-lettuce-tomato-recipe-AmandaSuarez-heros-d01e6b359b054dd1a63733733ea229b4.JPG", "ingredients": ["3 strips thick-cut, naturally cured bacon (see note)", "2 slices high-quality sandwich bread, such as shokupan", "2 tablespoons (30ml) homemade or store-bought mayonnaise (see note)", "1 1/2 cups finely shredded iceberg lettuce (see note)", "4 thick slices ripe tomato (see note)", "Coarse sea salt, such as fleur de sel or Maldon", "Freshly ground black pepper"], "steps": [{"order": 0, "description": "Place a griddle or skillet over medium-low heat. Add bacon and place a bacon press, skillet, or masonry trowel on top of it to keep it flat as it cooks. Cook until lightly browned on first side, about 5 minutes, then flip, cover again, and continue cooking until bacon is browned on both sides and fat has rendered, about 3 minutes longer. Transfer bacon to a paper towel–lined plate and set aside.", "image_url": "https://www.seriouseats.com/thmb/2HDY7WRkH-2sqpSCw4N4dIzRUTs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20220811-_ultimate-blt-sandwich-bacon-lettuce-tomato-recipe-AmandaSuarez-00-a8663ed0d53d4b68b79f23c4174d3775.JPG"}, {"order": 1, "description": "Place bread on same skillet or griddle and toast in bacon fat over medium-low heat, swirling occasionally, until evenly browned on first side. Flip and brown second side.", "image_url": "https://www.seriouseats.com/thmb/rw2rNPk2i2xJ0la8VRc8uSaiNUk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20220811-_ultimate-blt-sandwich-bacon-lettuce-tomato-recipe-AmandaSuarez-01-3e4b16bcc46640ff972687d6b8319209.JPG"}, {"order": 2, "description": "Lay toasted bread on a work surface and spread mayonnaise on both top faces. Divide lettuce evenly between both pieces of bread. Layer tomato slices on 1 piece of bread and sprinkle generously with coarse salt and freshly ground pepper.", "image_url": "https://www.seriouseats.com/thmb/Z5iZ4V7gDoeelN4LVUyxl4OuhuU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20220811-_ultimate-blt-sandwich-bacon-lettuce-tomato-recipe-AmandaSuarez-step3-49d0a08d0c334c5bb42417c849cfff63.JPG"}, {"order": 3, "description": "Break bacon slices in half and layer them onto the sandwich in 2 layers of 3 half slices each, alternating the orientation of bacon in each layer for more structural stability. Close sandwich and cut in half diagonally. Serve immediately.", "image_url": "https://www.seriouseats.com/thmb/6FUOJFzGysBXLr6jzBpenfHqOwI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20220811-_ultimate-blt-sandwich-bacon-lettuce-tomato-recipe-AmandaSuarez-step4-b90bf6e6040a4201b58b320db0ae0107.JPG"}]}
{"name": "Peanut Butter Sesame Breakfast Bars Recipe", "description": "These soft peanut butter bars get a flavor boost from toasted sesame seeds and a crunch from puffed cereal.", "servings": "makes 16 bars", "mainImageUrl": null, "ingredients": ["1/2 cup honey", "1 egg, lightly beaten", "1 cup crunchy peanut butter", "1/2 teaspoon vanilla extract", "1/4 cup sesame seeds", "1/2 cup puffed rice cereal, such as Kashi"], "steps": [{"order": 0, "description": "Preheat oven to 350°F. Place sesame seeds in a small saucepan over medium heat. Saute until toasted and golden, about 2 minutes. Let cool.", "image_url": null}, {"order": 1, "description": "In a medium bowl, stir together honey, egg, vanilla extract, and peanut butter until evenly combined. Stir in sesame seeds and rice cereal.", "image_url": null}, {"order": 2, "description": "Spread mixture in baking dish. Bake until golden, about 25 minutes. Let bars cool completely before cutting.", "image_url": null}]}
{"name": "The Ultimate Beef Stroganoff Recipe", "description": "In our version of beef Stroganoff, the beef is cooked as a whole steak to maintain a more tender, medium-rare center, while the sauce is carefully layered to optimize its flavor.", "servings": "Serves 4", "mainImageUrl": "https://www.seriouseats.com/thmb/Z16YKiURjKl0N6J_Mgy03eJHYX0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2014__12__20150110-beef-stroganoff-food-lab-28-c02205e4bcc64a1bb5c92c6e3262dc76.jpg", "ingredients": ["2 (.25 ounce) packets unflavored powdered gelatin (about 5 teaspoons)", "2 cups homemade or store-bought low-sodium chicken stock", "Kosher salt and freshly ground black pepper", "2 tablespoons mild paprika", "4 (1 1/2- to 2-inch thick) beef tenderloin steaks, 6 to 8 ounces each (see note)", "3 tablespoons canola or vegetable oil", "12 ounces button mushrooms, quartered", "8 ounces peeled pearl onions (about 24 onions, see note)", "3 tablespoons unsalted butter, divided", "1 medium shallot, thinly sliced (about 1/4 cup)", "4 sprigs fresh thyme", "1 teaspoon soy sauce", "2 teaspoons Worcestershire sauce", "1 teaspoon Asian fish sauce", "2 teaspoons Dijon mustard", "1 cup dry white wine", "1 cup sour cream, plus more for serving", "1 pound dried egg noodles", "1/4 cup minced fresh parsley leaves"], "steps": [{"order": 0, "description": "Sprinkle gelatin over chicken stock in a small bowl or liquid measuring cup. Set aside. Bring a large pot of salted water to a boil.", "image_url": "https://www.seriouseats.com/thmb/8k4VS99WzV4R8NwbMucqNAMKrr8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__20150110-beef-stroganoff-food-lab-09-61a45a33b204493385e5cce5fb596e68.jpg"}, {"order": 1, "description": "Combine 1 tablespoon salt, 1 teaspoon pepper, and half of paprika in a small bowl. Season steaks generously on all sides with mixture (you may not need all the mixture) and press with the flat of your hand to adhere. Heat half of vegetable oil in a large skillet or sauté pan over high heat until lightly smoking. Add meat and cook, turning occasionally, until well-browned on both sides and center of steaks register 115°F (46°C) at the thickest part for rare or 125°F (52°C) for medium-rare. Remove from pan, transfer to a plate, and set aside.", "image_url": "https://www.seriouseats.com/thmb/fotj0FXPmVxIqgn26PXssMbsTpA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__20150110-beef-stroganoff-food-lab-10-4a654f2935474fc3a549e9cf8d686a52.jpg"}, {"order": 2, "description": "Add remaining vegetable oil to the same pan and add the mushrooms. Return to medium heat and cook, stirring and tossing frequently, until mushrooms have released their liquid and are just starting to brown, about 8 minutes. Add 1 tablespoon butter and pearl onions and continue to cook, stirring, until onions and mushrooms are softened and well-browned, about 6 minutes longer.", "image_url": null}, {"order": 3, "description": "Add shallots, thyme, and remaining paprika, and cook, stirring, until fragrant. Add soy sauce, Worcestershire sauce, fish sauce, and mustard and cook, stirring, until mostly evaporated, about 30 seconds. Add any collected juices from the plate with the meat, followed by white wine. Cook until reduced to just a few tablespoons.", "image_url": "https://www.seriouseats.com/thmb/BVTgVeHtajovPdnvAiyetUkBiGY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__20150110-beef-stroganoff-food-lab-22-7b14097772c344d2a9eaf58d81ea1252.jpg"}, {"order": 4, "description": "Add broth/gelatin mixture and bring to a heavy simmer. Carefully pour off liquid into a heatproof cup or liquid measuring cup. Add sour cream to a medium bowl. Whisking constantly, slowly pour hot liquid over sour cream and whisk until fully homogeneous.", "image_url": "https://www.seriouseats.com/thmb/2AxaVbUz23GptsLA_Qim3kZNXeQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__20150110-beef-stroganoff-food-lab-24-9602e4c6764d4552b97fa32fd72a21d9.jpg"}, {"order": 5, "description": "Return sour cream mixture to pan along with remaining 2 tablespoons butter. Bring to a boil over medium-high heat and season to taste with salt and pepper. Return steaks to pan until barely warmed through, about 1 minute. Remove from heat.", "image_url": "https://www.seriouseats.com/thmb/mfPLWBlFsAnczb15VoLEkMGcB3w=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__20150110-beef-stroganoff-food-lab-26-80d5afe427f240f3903666d4d4f86138.jpg"}, {"order": 6, "description": "Cook noodles according to package directions. When cooked, drain and return to pot, reserving 1 cup of pasta cooking water. Transfer steaks to a cutting board and pour the sauce, mushrooms, and onions over the noodles. Stir to coat pasta, adding pasta cooking water as necessary until it reaches a loose, creamy consistency. Stir in half of minced parsley.", "image_url": null}, {"order": 7, "description": "Thinly slice steaks. To serve, divide pasta and cream sauce evenly between 4 hot serving bowls. Top with sliced steak, spooning a little extra sauce over them. Add a dollop of sour cream, sprinkle with remaining parsley, and serve, advising guests to remove large thyme sprigs as they find them.", "image_url": null}]}
{"name": "Beet Salad with Black Garlic Vinaigrette Recipe", "description": "[Photograph: Max Falkowitz] Even raw, beets are a wonderfully sweet vegetable. Sweet and funky black garlic bridges the gap between them and a very lime-based vinaigrette. Blending the black garlic into the dressing makes it, well, ugly, but lets the...", "servings": "4 as a side", "mainImageUrl": "https://www.seriouseats.com/thmb/pX1xVUO0QZLB318IhiFcUEXKFKs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__20100915beets-46f4f1d093bc4292bc57c95ce650e7ba.jpg", "ingredients": ["1 pound beets (about 3 medium), peeled and sliced into 1/8th-inch julienne on a mandoline or V-slicer", "1/2 cup roughly chopped parsley or cilantro", "7 cloves black garlic, peeled (see note)", "1/4 cup freshly sqeezed lime juice", "1/4 cup extra virgin olive oil", "1 tablespoon coriander seed, toasted and ground", "Kosher salt", "Sugar"], "steps": [{"order": 0, "description": "Toss beets and parsley in large bowl. Combine black garlic, lime juice, olive oil, and coriander in blender and blend until smooth. Season to taste with salt and sugar (start with 1 teaspoon sugar and add more totaste). Toss beets with vinaigrette and serve immediately.", "image_url": null}]}
{"name": "The Ultimate Bacon Cheeseburgers Recipe", "description": "The ultimate bacon cheeseburger with beef cooked in bacon fat, a bacon fat mayonnaise, onions caramelized in bacon fat, buns toasted in bacon fat, and a crisp bacon weave topping.", "servings": "serves 4", "mainImageUrl": "https://www.seriouseats.com/thmb/MBJZXTROIhiNcn5pylcMswqgrvo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2013__07__20130723-bacon-weave-food-lab-burger-step-by-step-27-4f43a832acb242789dbc4133810a281f.jpg", "ingredients": ["12 slices thick-cut, naturally smoked bacon", "6 tablespoons mayonnaise", "1 tablespoon ketchup", "1 tablespoon spicy brown or dijon mustard", "2 tablespoons sweet pickle relish", "Freshly ground black pepper", "24 ounces (1 1/2 pounds) freshly ground beef chuck", "Kosher salt", "4 soft hamburger rolls", "4 slices American or cheddar cheese", "1 medium onion, finely sliced (about 3/4 cup)", "12 dill pickle chips"], "steps": [{"order": 0, "description": "Adjust oven rack to center and bottom positions, place a 12-inch cast iron skillet on the bottom rack, and preheat oven to 400°F (200°C).", "image_url": null}, {"order": 1, "description": "Meanwhile, line a rimmed baking sheet with heavy duty aluminum foil. Place 6 slices of bacon on baking sheet side to side running perpendicular to the edge of the counter. Fold down the top halves of 1st, 3rd, and 5th slices. Place a slice of bacon across the top of the folds, running perpendicular to the first 6 slices, then unfold the bacon so that the new slice is woven over and under every other slice. Fold down the 2nd, 4th, and 6th slices and lay another slice of bacon across the top of the fold. Unfold the slices. Repeat until all 12 slices of bacon have been laid on the baking sheet in an interwoven pattern. Place baking sheet in oven and cook until bacon is crisp, about 25 minutes.", "image_url": "https://www.seriouseats.com/thmb/BoWoC3ncUmAj1yROFvE9ag2TSC8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__20130723-bacon-weave-food-lab-burger-step-by-step-05-38c7c25af3fc4c2aa9a9bbbf0757752b.jpg"}, {"order": 2, "description": "While bacon cooks, combine mayonnaise, ketchup, mustard, relish, and 1 teaspoon black pepper in a medium bowl. Stir to combine. Form ground beef into 4 (6-ounce) patties slightly wider than the buns. Press the center of each patty to make a slight indentation with your fingertips. Season liberally with salt and pepper on all sides. Set aside.", "image_url": "https://www.seriouseats.com/thmb/LgCHkbythhB9q9n0MYCMcxA8W5o=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__aht.seriouseats.com__images__2013__07__20130723-bacon-weave-food-lab-burger-step-by-step-06-40bba38509d64749a8a434129c5fdfc9.jpg"}, {"order": 3, "description": "When bacon is cooked, remove baking sheet from oven and set broiler to high. Pour off excess bacon fat into a small bowl and set aside. Transfer bacon to a paper towel-lined plate, being careful not to break it. Allow to drain for 30 seconds, then transfer to cutting board. Cut the bacon weave into 4 smaller squares and set aside.", "image_url": "https://www.seriouseats.com/thmb/Dvu-_BOLcl1LcGqJZrnW49WY2gU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__20130723-bacon-weave-food-lab-burger-step-by-step-14-3e3db7a3454943c88a86f6be711b671b.jpg"}, {"order": 4, "description": "Pour 2 tablespoons of rendered bacon fat into mayonnaise mixture and stir to combine. Brush hamburger rolls on inside surfaces with bacon fat and place on a broiler pan or baking sheet brushed-side up.", "image_url": "https://www.seriouseats.com/thmb/peqM1sWl7mezVtQhIHmgpkzuy_Y=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__20130723-bacon-weave-food-lab-burger-step-by-step-11-9350f72f57b742e6b17bda5ab15c2370.jpg"}, {"order": 5, "description": "Remove cast iron skillet from oven using oven mitts or a folded kitchen towel. Place over medium-high heat. Add remaining bacon fat to skillet. Add burger patties and cook, turning occasionally, until well-crusted and center of each burger registers 120°F (49°C) on an instant-read thermometer. Top with cheese and continue cooking until cheese is melted and burgers register 125°F (52°C) for medium rare or 135°F (57°C) for medium. Transfer to a large plate.", "image_url": "https://www.seriouseats.com/thmb/4jA_20YDMJLB635yh-sEw3KDG5w=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__20130723-bacon-weave-food-lab-burger-step-by-step-17-321de1d7c9c54b798373208b78a0de13.jpg"}, {"order": 6, "description": "Add onions to skillet and cook, stirring frequently, until softened and lightly browned, about 5 minutes. Season to taste with salt and pepper and transfer to a bowl.", "image_url": "https://www.seriouseats.com/thmb/t0JR4uitHZ5QrL01mCV96Cu00uc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__20130723-bacon-weave-food-lab-burger-step-by-step-21-a54d7df2cd7743b480b9dace68f1dff7.jpg"}, {"order": 7, "description": "Place burger buns under broiler while onions cook and broil until golden brown and toasted, about 2 minutes.", "image_url": "https://www.seriouseats.com/thmb/ONnjcP1GaSDZc8Sr51vKnvRtxTk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__20130723-bacon-weave-food-lab-burger-step-by-step-20-dbdbee8c64184d008aec4905cb43c190.jpg"}, {"order": 8, "description": "Spread mayonnaise mixture on both sides of burger buns. Place 3 pickles on each bottom bun. Top with a burger patty, a pile of onions, and a square of bacon weave. Close buns and serve.", "image_url": "https://www.seriouseats.com/thmb/gmr3DoU-lX9EHncrVFjoefRysw4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__20130723-bacon-weave-food-lab-burger-step-by-step-25-105b9dad49af4037912ac5a4826e491a.jpg"}]}
{"name": "Two-Minute Aioli", "description": "Classic aioli is made with nothing but garlic and olive oil pounded in a mortar and pestle. Our updated version uses egg yolks to help bind the sauce along with a hand blender to make it 100% foolproof and extremely quick.", "servings": "Makes about 1 cup", "mainImageUrl": "https://www.seriouseats.com/thmb/6NplzVAorjdp0lIjXQ1vGdZPBCg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2015__06__20150608-foolproof-aioli-cdffb37319ba49f0ba66fb970615828b.jpg", "ingredients": ["1 whole egg", "4 medium cloves garlic, minced", "2 teaspoons juice from 1 lemon", "1/2 cup canola, vegetable, or light olive oil oil", "1/2 cup extra-virgin olive oil", "Kosher salt and freshly ground black pepper"], "steps": [{"order": 0, "description": "Place egg, garlic, and lemon juice in the bottom of an immersion blender cup. Pour canola (or vegetable or light olive) oil on top and allow to settle for 15 seconds. Place head of immersion blender at bottom of cup and switch it on. As aioli forms, slowly tilt and lift the head of the immersion blender until all oil is emulsified. (For food processor instructions, see note).", "image_url": null}, {"order": 1, "description": "Transfer aioli to a medium bowl. Whisking constantly, slowly drizzle in extra-virgin olive oil. Season to taste with salt and pepper. Store in a sealed container in the refrigerator for up to two weeks.", "image_url": null}]}
{"name": "2-Ingredient Cream Biscuits", "description": "These two-ingredient biscuits have one of the lowest effort-to-greatness ratios of any recipe I can think of. They take practically no effort or practice to pull off, yet produce some of the lightest, tenderest, tastiest biscuits around.", "servings": "Makes 15 to 20 biscuits", "mainImageUrl": "https://www.seriouseats.com/thmb/7YZ9jdRRwu33XXx0DkSrjwuh7N8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2015__09__20150911-two-ingredient-biscuit-strawberry-shortcake-recipe-kenji-42-55ff5860d0e24da8bdb144eb48268c7e.jpg", "ingredients": ["10 ounces (about 2 cups) self-rising flour", "2 tablespoons sugar (if making sweet shortcake-style biscuits)", "10 ounces (about 1 1/4 cups) heavy cream, plus more for brushing"], "steps": [{"order": 0, "description": "Adjust oven rack to center position and preheat oven to 450°F. Place flour in a large bowl. If making sweet biscuits, whisk in sugar. Stirring with a wooden spoon, drizzle in cream. Stir until a lumpy dough is formed. Do not over mix.", "image_url": "https://www.seriouseats.com/thmb/KX4z2IkHox7akhbgXoe5UTlzx4E=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__20150911-two-ingredient-biscuit-strawberry-shortcake-recipe-kenji-06-810e51a516e543aba3ea33c8c42630d0.jpg"}, {"order": 1, "description": "For Drop Biscuits: Using a 1-ounce cookie scoop, scoop balls of dough onto a parchment-lined baking sheet, spacing them 2 inches apart. Brush tops with cream and bake until golden brown, about 12 minutes. Let cool slightly and serve.", "image_url": "https://www.seriouseats.com/thmb/JHzphve_JKrSzssvNIGNfSAbxBw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__20150911-two-ingredient-biscuit-strawberry-shortcake-recipe-kenji-08-c7d89bf5c55d44c3a294e9c08755a0a0.jpg"}, {"order": 2, "description": "For Flaky Rolled Biscuits: With a rolling pin, roll the dough into a 12-inch square. Using a bench scraper, fold the right third of the dough over the center, then fold the left third over so you end up with a 12-by-4-inch rectangle. Fold the top third down over the center, then fold the bottom third up so the whole thing is reduced to a 4-inch square. Press the square down and roll it out again into a 12-inch square. Repeat the folding process once more, then roll the dough again into a 12-inch square. Use a 3- to 4-inch biscuit cutter to cut out rounds and transfer to a parchment-lined baking sheet, spaced 2 inches apart. Press together scraps to form additional biscuits. Brush tops with cream and bake until golden brown, about 12 minutes. Let cool slightly and serve.", "image_url": "https://www.seriouseats.com/thmb/HkawO_t-mQ1STGpKF6sgNNrVqW4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__20150911-two-ingredient-biscuit-strawberry-shortcake-recipe-kenji-10-3d0f186b6f124603966dcfb6cb430f21.jpg"}]}
{"name": "Grilled Polenta With Marinara, Parmesan, and Basil Recipe", "description": "Rich and flavorful polenta is grilled and then topped with marinara, basil, and parmesan to give this side dish the hearty feeling of a whole, satisfying meal.", "servings": "serves 4 as a main course or 8 as a side dish", "mainImageUrl": "https://www.seriouseats.com/thmb/HszyCZ1lvyTMfdWRs33BZrS92ZA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__07__20120708-213754-grilled-polenta-a4b3310dc9c24a8f981ac049efce2c57.jpg", "ingredients": ["3 cups chicken stock", "1 cup yellow cornmeal", "1 cup grated Parmesan, divided", "2 tablespoon unsalted butter", "Kosher salt and freshly ground black pepper", "1/2 teaspoon freshly ground black pepper", "1 tablespoons olive oil", "1 cup marinara sauce", "1/4 cup finely sliced fresh basil leaves"], "steps": [{"order": 0, "description": "Bring chicken stock to a boil in a medium saucepan over high heat. Slowly whisk in cornmeal. Reduce heat to low and simmer until mixture has thickened, 30 to 45 minutes, stirring occasionally. Stir in 1/2 cup of Parmesan and butter. Season to taste with salt and pepper.", "image_url": "https://www.seriouseats.com/thmb/dxUIrFPq5AKPaloYIT1rFfWLkOI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__20120708-213754-grilled-polenta-step-1-c38e00e673a14ae3b4498f8102f78c8d.jpg"}, {"order": 1, "description": "Pour polenta into a 10-inch round cake pan and let cool to room temperature. Cover with plastic wrap and place in refrigerator until completely chilled and firm, 2 to 3 hours or up to overnight.", "image_url": "https://www.seriouseats.com/thmb/Y_nNIh56UAwOe48KSocesY4W1OY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__20120708-213754-grilled-polenta-step-2-37aed8d5149e43bda85017c8bfbebd56.jpg"}, {"order": 2, "description": "Light one chimney full of charcoal. When all charcoal is lit and covered with gray ash, pour out and spread the coals evenly over entire surface of coal grate. Alternatively, set all burners on a gas grill to medium high heat. Set cooking grate in place, cover grill and allow to preheat for 5 minutes. Clean and oil the grilling grate. Remove polenta from pan and cut into 8 equal slices. Brush slices on both sides with olive oil and place on grill. Cook until polenta browns, about 3 minutes per side.", "image_url": "https://www.seriouseats.com/thmb/Roc-zc7Y_vUl-XV8IWU5GHDcAN0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__20120708-213754-grilled-polenta-step-3-62a39eca69e64f53bb23a323df49bcb5.jpg"}, {"order": 3, "description": "Transfer polenta to a platter. Top each slice with a dollop of marinara sauce, basil chiffonade, and a sprinkling of parmesan. Serve immediately while warm.", "image_url": "https://www.seriouseats.com/thmb/4bBOZJd8pLaXmRPKxqllktNPV0c=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__20120708-213754-grilled-polenta-step-4-2a0de2d4ab0343498fb1332de5dba9dd.jpg"}]}
{"name": "Chicken-Green Bean Yellow Chili Stir-Fry Recipe", "description": "This quick and easy Thai-style chicken and long bean stir-fry flavored with fish sauce, chilis, and kaffir lime comes together in under fifteen minutes and uses a simmering/reducing technique that packs in the flavor without overwhelming your kitchen with smoke.", "servings": "serves 4", "mainImageUrl": "https://www.seriouseats.com/thmb/a2J2uV5X0B2nLuYVOzWN_p_bt9k=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2013__02__20130204-239233-chicken-green-bean-yellow-chili-stir-fry-recipe-c4322583e8b2407f859357352d36622e.jpg", "ingredients": ["4 yellow or red jalapeño or Serrano peppers", "2 tablespoons vegetable oil", "3/4 pound chicken breasts or tenderloins, cut against the grain into bite-size pieces", "2 large cloves garlic, peeled and minced (about 1 tablespoon)", "1 tablespoon fish sauce (more or less to taste)", "1 tablespoon oyster sauce", "1/4 cup homemade or store-bought low-sodium chicken stock", "1/2 teaspoon granulated sugar", "1/3 pound long beans or green beans, trimmed and cut crosswise into 1/4-inch pieces", "4 to 5 fresh makrut lime leaves, hand-torn into pieces and lightly bruised"], "steps": [{"order": 0, "description": "Cut yellow chilies crosswise into 1/2-inch pieces and pound them in a mortar until they&#39;re broken up into small chunks, about 1/4-inch in size; set aside. (If you don&#39;t have a mortar, place cut-up chilies in a plastic zipper bag, seal bag well and get rid of trapped air, wrap bag with a kitchen towel, then pound on it with a meat tenderizer or something heavy.)", "image_url": null}, {"order": 1, "description": "Heat oil in a 10- or 12-inch skillet over medium-high heat. Add chicken, minced garlic, fish sauce, oyster sauce, chicken stock, and sugar. Cook, stirring occasionally, until chicken is almost cooked through, 2 to 3 minutes. Add long beans, crushed chilies, and kaffir lime leaves. Continue to stir-fry until chicken is cooked through and long beans are still crisp and retain their green color, 1 to 2 minutes longer. Season to taste with more fish sauce if desired. Transfer to a serving platter and serve with steamed rice.", "image_url": null}]}
{"name": "Tom Collins Recipe", "description": "Gin, lemon, and soda come together for one of the cocktail world&#39;s enduring classics.", "servings": "makes 1", "mainImageUrl": "https://www.seriouseats.com/thmb/vfzZWWQG3ex43JEemGCr-F_N1Tg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2015__04__20150323-cocktails-vicky-wasik-tom-collins-eef9579c2aaf45cd9f88443b528c18df.jpg", "ingredients": ["1 1/2 ounces gin", "1/2 ounce fresh lemon juice", "1/2 ounce simple syrup", "Chilled club soda"], "steps": [{"order": 0, "description": "Combine ingredients other than club soda in a cocktail shaker with ice, and shake until well-chilled. Strain into a Collins glass with lots of ice and top with chilled club soda. Insert straw and do what comes natural.", "image_url": null}]}
{"name": "Hearty Vegan Polenta and Kale Soup With Miso and Toasted Sesame Oil", "description": "This easy one-pot polenta and kale soup hails from Italy, but we give it a distinctly Japanese twist: In place of the Parmesan called for in a traditional recipe, we finish ours up with the addition of miso paste, soy sauce, and scallions. It&#39;s savory, rich, and 100% vegan.", "servings": "Serve 4 to 6", "mainImageUrl": "https://www.seriouseats.com/thmb/zBsxyXpyIODRPkzCwY6JIf7sNcc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20221107-hearty-vegan-polenta-kale-miso-soup-Fred-Hardy-hero-a91a882e6df14fb7ab42fc5d2d0b0f95.JPG", "ingredients": ["6 tablespoons extra-virgin olive oil", "1 leek, finely chopped", "Kosher salt and freshly ground black pepper", "3 medium cloves garlic, minced", "Pinch red pepper flakes", "2 quarts homemade vegetable stock or an equivalent amount made with Better Than Bouillon No Chicken Base", "1 cup polenta (coarse corn meal)", "1 quart packed roughly chopped kale leaves (stems removed)", "2 tablespoons white miso paste", "2 teaspoons soy sauce", "4 scallions, thinly sliced", "Toasted sesame oil, for serving"], "steps": [{"order": 0, "description": "In a large saucepan, heat olive oil, leeks, and a pinch of salt over medium-low heat, stirring often, until very soft but not browned, about 6 minutes. Add garlic and red pepper flakes and cook, stirring constantly, until fragrant, about 1 minute. Add vegetable stock.", "image_url": "https://www.seriouseats.com/thmb/rxTb0iiT3LWOqJ_W89qFLdu_lG0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20221107-hearty-vegan-polenta-kale-miso-soup-FredHardy-01-507c3b4353cd44f780fb4ac32c4d5886.JPG"}, {"order": 1, "description": "Whisking constantly, slowly pour in the polenta. Stirring frequently, bring to a boil over high heat, reduce heat to low, cover, and cook, stirring occasionally, until polenta is tender and the soup is thickened, about 15 minutes.", "image_url": "https://www.seriouseats.com/thmb/BR1lzQ3zlopc0lHkRGpv0xhGjOw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20221107-hearty-vegan-polenta-kale-miso-soup-Fred-Hardy-Step2-d47be3acbc7f43da984a36d0dac652cf.JPG"}, {"order": 2, "description": "Stir in kale, cover, and cook, stirring occasionally, until kale is tender, about 5 minutes. Stir in miso, soy sauce, and half of scallions until miso is fully incorporated. Season to taste with salt, pepper, and/or additional miso and soy sauce, if desired.", "image_url": "https://www.seriouseats.com/thmb/eIGKMO1AsubmaiTeJYZ8i16hDf0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20221107-hearty-vegan-polenta-kale-miso-soup-Fred-Hardy-Step3-2f270a7aea2f4e8688051c0d0ef5bd2d.JPG"}, {"order": 3, "description": "Serve, drizzling with sesame oil and sprinkling with remaining scallions. Extra soup can be stored in the refrigerator in a sealed container for up to 5 days.", "image_url": "https://www.seriouseats.com/thmb/eU3uRP3M25AbscYiSURxlzEWh7A=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20221107-hearty-vegan-polenta-kale-miso-soup-FredHardy-06-cba351419d8d4f2fb12da90186ab0e47.JPG"}]}
{"name": "Marinated Kale and Chickpea Salad With Sumac Onions Recipe", "description": "This salad keeps fantastically in the fridge, retaining its crunch and developing its flavor over time.", "servings": "Makes 4 salads", "mainImageUrl": "https://www.seriouseats.com/thmb/01fmENiL-XQXVh_IURu_iirHyuo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2012__01__20120121-kale-chickpeas-onions-2-cb2d56064a244eba9b1f718d1eb7e148.jpg", "ingredients": ["1 bunch kale, tough inner stems discarded, leaves roughly torn (about 1 pound)", "2 tablespoons olive oil", "Kosher salt", "1 small red onion, thinly sliced", "1 teaspoon dried ground sumac berries", "1/2 teaspoon toasted sesame seeds", "1 tablespoon juice from 1 lemon", "1 clove garlic, grated on a microplane grater", "2 teaspoons dijon mustard", "1 (14-ounce) can chickpeas or white beans, drained and rinsed", "Freshly ground black pepper"], "steps": [{"order": 0, "description": "Combine kale leaves with olive oil and 1 teaspoon salt in a large bowl. Toss until evenly coated. Allow to rest at room temperature until kale is lightly wilted, about 1 hour.", "image_url": null}, {"order": 1, "description": "Meanwhile, place onions in a medium bowl and cover with cold water. Allow to rest for 15 minutes. Rinse in several changes of water then carefully dry with a salad spinner lined with paper towels. Combine onions with sumac and sesame seeds. Season to taste with salt.", "image_url": null}, {"order": 2, "description": "Combine lemon juice, garlic, and mustard in a small bowl. Once kale is wilted, toss kale, lemon juice mixture, and chickpeas in a large bowl. Season to taste with salt and pepper. Serve salad topped with sumac onions. This Recipe Appears In \n Vegan: 2 Ways To Eat Kale, Chickpeas, and Sumac-Marinated Onions \n Serious Entertaining: 'I'm Sick, Make Me My Dinner!' \n The Importance of Hearty Make-Ahead Salads \n Serious Entertaining: The Vegan, One Meal Convince-A-Meathead Challenge", "image_url": null}]}
{"name": "Vegan Dan Dan Noodles Recipe", "description": "Classic dan dan noodles are made with pork, pickled vegetables, and plenty of chili oil. In this version, we pack in all the flavor and texture with mushrooms fried until golden brown and chewy.", "servings": "Serves 2", "mainImageUrl": "https://www.seriouseats.com/thmb/wey-6tMQGF7IOBz_XdY9HdViUJ4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2013__02__20130221-vegan-dan-dan-mien-noodles-1-a06c259c753d43e28b9c6ed740cba873.jpg", "ingredients": ["6 ounces white button mushrooms, quartered", "2 tablespoons vegetable oil", "3 teaspoons light soy sauce", "2 teaspoons Chinkiang vinegar (see note)", "1 tablespoon tahini paste", "2 teaspoons sugar", "4 tablespoons roasted chili oil with some chili sediment (see note)", "1 tablespoons fermented chili broad bean paste (see note)", "Kosher salt", "3 tablespoons finely chopped preserved Sichuan mustard root or stems (see note)", "2 medium cloves garlic, finely minced", "2 tablespoons shaoxing wine (see note)", "8 ounces fresh Chinese wheat noodles", "Chopped cilantro", "Thinly sliced scallions"], "steps": [{"order": 0, "description": "Place mushrooms in the bowl of a food processor and process until pieces no larger than 1/2-inch remain, about 6 short pulses. Transfer to a small saucepan. Add vegetable oil and stir to combine. Place over medium-high heat and cook, stirring occasionally, until mushroom pieces shrink and are deep golden brown, about 8 minutes. Pour through a fine-mesh strainer set over a small bowl. Reserve mushroom pieces and discard all but 1 tablespoon oil.", "image_url": null}, {"order": 1, "description": "While mushrooms are cooking, combine soy sauce, vinegar, tahini, sugar, chili oil (with its sediment), and broad bean chili paste in a medium bowl. Set aside. Bring 1 quart of salted water to a simmer in a medium pot and keep hot.", "image_url": null}, {"order": 2, "description": "Heat reserved 1 tablespoon of mushroom oil in a large skillet or wok over high heat until shimmering. Add chopped Sichuan vegetables, fried mushrooms, and garlic. Cook, stirring and tossing constantly until fragrant, about 45 seconds. Add Shaoxing wine and stir to combine. Transfer mixture to bowl with sauce.", "image_url": null}, {"order": 3, "description": "Return pot of water to a hard boil and add noodles. Cook, stirring regularly to prevent noodles from sticking to each other or the bottom, until barely cooked through with a springy bite, about 4 minutes. Drain, reserving 3/4 cup of cooking liquid. Add cooking liquid to bowl with sauce and stir to combine.", "image_url": null}, {"order": 4, "description": "Place noodles in bowl and pour sauce with solids on top. Garnish with scallions and cilantro, and serve, stirring vigorously just before eating to pick up sauce.", "image_url": null}]}
{"name": "Vegan Chorizo for Omnivores Recipe", "description": "I wanted to make a vegan chorizo recipe that doesn&#39;t just come close to regular chorizo in the flavor department, but outright nails it. I wanted a meat-free chorizo with textural contrast up the wazoo, and a chorizo that changes texture as you cook it just like its meat-based counterpart. I wanted a chorizo that is tangy, rich, and complex.", "servings": "Makes about 1 1/2 pounds", "mainImageUrl": "https://www.seriouseats.com/thmb/TI-i9RltPnPedVver-kCf15QmtA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2015__02__20150225-vegan-chorizo-food-lab-recipe-tofu-tempeh-17-91311b3550c94f13893953d854ccec43.jpg", "ingredients": ["1 (10-ounce) block of extra-firm cottony (non-silken) tofu, drained and cut into 1-inch slices", "1 fresh poblano pepper", "1 (15-ounce) can black or Puy lentils, drained and rinsed", "1 whole sweet dried chilies like Costeño, Guajillo, or Choricero, stems and seeds removed", "1 to 2 small hot dried chilies like Arbol or Cascabel, stems and seeds removed (optional)", "1 whole rich fruity dried chili like Ancho, Mulatto, Negro, or Pasilla, stems and seeds removed", "2 tablespoons raisins", "1 whole chipotle chili in adobo sauce with 2 tablespoons sauce from can", "2 cups water", "6 ounces plain tempeh", "1/4 cup vegetable shortening or coconut oil", "1 medium onion, diced (about 1 cup)", "Kosher salt and freshly ground black pepper", "3 medium cloves garlic, minced (about 2 teaspoons)", "2 tablespoons minced fresh oregano leaves", "2 teaspoons dried Mexican oregano", "1/2 teaspoon ground cinnamon", "1 tablespoon freshly toasted and ground cumin seeds", "1 teaspoon freshly toasted and ground coriander seed", "3 whole cloves, toasted and ground", "1 tablespoon yellow or red miso paste", "1 tablespoon soy sauce", "1/4 cup red wine vinegar"], "steps": [{"order": 0, "description": "Line a large plate with a double layer of paper towels. Place tofu on top in a single layer and transfer to freezer. Freeze for 15 minutes, then remove and let thaw while you prepare the other ingredients.", "image_url": null}, {"order": 1, "description": "Adjust rack to 4 inches below broiler element and preheat broiler to high. Line a rimmed baking sheet with aluminum foil and place the poblano on top. Broil, turning occasionally, until blackended on all sides, about 6 minutes total. Remove from oven, lift foil and wrap it around the poblano to form a tight seal, transfer to a plate and set aside. Reduce oven temperature to 325°F (160°C) and leave the door open to allow oven to cool slightly.", "image_url": null}, {"order": 2, "description": "Line rimmed baking sheet with a fresh piece of foil and spread lentils on top in a single layer. Transfer to oven and cook until mostly dry and crunchy, 20 to 30 minutes.", "image_url": "https://www.seriouseats.com/thmb/O0AAwz0eNfhu-IAQ0tHhfUD_0G4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__images__2015__02__20150225-vegan-chorizo-food-lab-recipe-tofu-tempeh-01-0d96a62028b8407d857795aa7437254e.jpg"}, {"order": 3, "description": "Meanwhile, place dried chiles on a microwave-safe plate and microwave until toasted, about 30 seconds. Transfer to a glass liquid measuring cup. Add raisins, chipotle chiles and their juice, and water. Cover with plastic wrap and microwave until simmering, about 1 1/2 minutes. Remove from microwave and let stand 2 minutes. Transfer to a blender and blend until completely smooth. Set mixture aside.", "image_url": null}, {"order": 4, "description": "Cut tempeh into 1-inch pieces. Working in batches, transfer to a food processor and pulse until chopped to the texture of ground meat, about 10 to 12 short pulses. Set aside.", "image_url": null}, {"order": 5, "description": "When cool enough to handle, carefully unwrap and peel poblano pepper, discarding skins and seeds. Finely dice cooked flesh. Melt shortening in a large saucepan over medium-high heat. Add onions and poblanos, season with salt and pepper, and cook, stirring, until softened, about 4 minutes. Add garlic, fresh and dried oregano, cinnamon, cumin, coriander, cloves, and cook, stirring, until fragrant, about 1 minute. Add miso paste, soy sauce, red wine vinegar, and chile mixture. Add crumbled tofu, tempeh, and dehydrated lentils. Stir to incorporate and season to taste with salt and pepper. For a moister, saucy texture, add a few tablespoons of water. For a dryer, crumblier, well-browned texture, add 2 tablespoons more oil and continue cooking until most of the excess liquid has evaporated and mixture is dark brown with crisp bits, about 15 minutes. Serve in tacos, burritos, mixed with eggs, on nachos, or in any recipe that calls for fresh Mexican chorizo.", "image_url": null}]}
{"name": "Vegan Cauliflower-Creamed Spinach", "description": "This vegan creamed spinach uses cauliflower purée as a stand-in for the cream. The most amazing part: The dish tastes just as creamy, but is actually more intensely spinach-flavored.", "servings": "Serves 4 to 6", "mainImageUrl": "https://www.seriouseats.com/thmb/HzHajMoL7ja8FghYzexs56BB-bI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2017__02__20170210-vegan-creamed-spinach-15-940c8c9cae634a84b2489e823ac38da7.jpg", "ingredients": ["6 ounces cauliflower florets (170g; about 1/3 of a small head)", "6 ounces almond, soy, rice, or cashew milk (2/3 cup; 170ml)", "2 tablespoons (30ml) coconut oil", "1 medium onion, finely chopped (about 8 ounces; 225g)", "3 medium cloves garlic, minced", "1/2 teaspoon freshly grated nutmeg", "1 pound (450g) mature curly or flat-leaf spinach, washed well and roughly chopped", "Kosher salt and freshly ground black pepper"], "steps": [{"order": 0, "description": "Combine cauliflower and milk of choice in a small saucepan. Bring to a simmer over medium heat, cover, reduce heat to lowest setting, and let cook until cauliflower is completely tender, about 10 minutes. Using an immersion blender or countertop blender, blend into a smooth purée. Set aside.", "image_url": "https://www.seriouseats.com/thmb/OvkpG7-wDluLqcWAl5wvYD7_w9c=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__20170210-vegan-creamed-spinach-02-composite-290510292bbb401487f8f6cc0a13fbc7.jpg"}, {"order": 1, "description": "Heat coconut oil over medium heat in a large saucepan until melted. Add onion and cook, stirring frequently, until softened but not browned, about 4 minutes. Add garlic and cook, stirring constantly, until fragrant, about 30 seconds. Add nutmeg and stir to combine. Add spinach one handful at a time, stirring and folding until each handful of spinach is wilted, before adding the next.", "image_url": "https://www.seriouseats.com/thmb/IU_oZ9q46IkSPBdd74YIC1MFFHs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__20170210-vegan-creamed-spinach-07-composite-6dfe40701fe54f4293fc8225f64c28dd.jpg"}, {"order": 2, "description": "Add cauliflower purée to spinach mixture and stir to combine. Bring to a bare simmer and cook, stirring occasionally, until spinach is completely tender and mixture is creamy. Season to taste with salt and pepper and serve.", "image_url": null}]}
{"name": "Vegan Carbonara Pasta Recipe", "description": "A vegan version of pasta carbonara that&#39;s silky and rich, dotted with meaty bits, plus the characteristic lactic tang of Pecorino Romano, but with no dairy products whatsoever.", "servings": "Serves 4", "mainImageUrl": "https://www.seriouseats.com/thmb/qoVYb-zFByFqnnieqCWSIOsJFrY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2017__02__20170210-vegan-carbonara-spaghetti-vicky-wasik-14-b61984f5bd474450a51eea7cd104af16.jpg", "ingredients": ["7 ounces silken tofu (1/2 of a 14-ounce block; 200g)", "1/2 cup (120ml) sauerkraut brine (see note)", "1/4 cup nutritional yeast (1/2 ounce; 15g)", "1 tablespoon (15ml) white miso", "Generous pinch cayenne pepper or red chili flakes", "3 generous dashes (about 1/4 teaspoon) smoked paprika", "2 teaspoons (8g) freshly ground black pepper", "1 tablespoon (15ml) white wine vinegar or fresh juice from 1 lemon", "Kosher salt", "1/2 cup (120ml) extra-virgin olive oil, divided", "4 ounces (115g) king oyster mushrooms, stems and caps sliced into 1/2-inch &#34;lardons&#34;", "1 pound (450g) dry spaghetti or penne"], "steps": [{"order": 0, "description": "In a blender, combine tofu, sauerkraut brine, nutritional yeast, miso, cayenne or chile flakes, smoked paprika, black pepper, and vinegar or lemon juice. Blend at high speed, stopping to scrape down sides if necessary, until a very smooth, silky sauce forms. Season with salt. Add 1/4 cup (60ml) olive oil and blend in at low speed just until emulsified.", "image_url": "https://www.seriouseats.com/thmb/RvixcfdINQoRmmD6B8g5mSKA9FI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__images__2017__02__20170210-vegan-carbonara-spaghetti-vicky-wasik-collage1-4d4a7f2d62b04a5193207cf99a4a045e.jpg"}, {"order": 1, "description": "In a large sauté pan, heat remaining 1/4 cup (60ml) olive oil over medium-high heat until shimmering. Add mushrooms and cook, stirring, until browned, about 6 minutes.", "image_url": null}, {"order": 2, "description": "In a pot of salted boiling water, cook pasta until just al dente. Transfer pasta to pan with mushrooms, reserving pasta-cooking water. Pour on just enough creamy sauce to coat all the pasta, then add about 1/4 cup (60ml) pasta-cooking water. Cook over medium heat, stirring, until sauce forms a silky glaze that coats pasta. Serve.", "image_url": "https://www.seriouseats.com/thmb/GMMxJ0SD80LAl1lcxjlWqA9t7YY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__images__2017__02__20170210-vegan-carbonara-spaghetti-vicky-wasik-collage2-299444704575434c8de6fe9f7b77cbfa.jpg"}]}
{"name": "Vegan Pancakes Made With Aquafaba Recipe", "description": "In the world of vegan cooking, nothing has shaken things up like aquafaba—the recently coined term for the liquid inside a can of cooked beans. In a stand mixer, that liquid can be transformed into a creamy, fine, stable foam with the texture, density, and many of the cooking properties of an egg white–based meringue. Today, we&#39;re using it to make light, fluffy pancakes.", "servings": "Makes 16 pancakes", "mainImageUrl": "https://www.seriouseats.com/thmb/JPC-__3iApSA-qnexjCvI-seIys=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2016__03__20160324-aquafaba-pancake-oatmeal-vegan-21-be18a21398ee40838a03224153ce49ae.jpg", "ingredients": ["For the Basic Dry Pancake Mix:", "10 ounces all-purpose flour (about 2 cups; 280g)", "2 teaspoons (8g) baking powder", "1/2 teaspoon (3g) baking soda", "1 teaspoon (4g) kosher salt", "For Each Batch of Pancakes:", "4 tablespoons (60ml) liquid from 1 can of low-sodium chickpeas (reserve remaining liquid and chickpeas for another use)", "4 tablespoons (60g) sugar", "1 2/3 cups (about 14 ounces; 400ml) almond, rice, or soy milk", "1/4 cup (60ml) vegetable oil, plus more for cooking", "2 teaspoons (10ml) vanilla extract", "2 teaspoons (3g) zest from 1 lemon", "2 teaspoons (10ml) cider vinegar or distilled white vinegar", "Vegan butter substitute and maple syrup, for serving"], "steps": [{"order": 0, "description": "For the Dry Mix: In a large bowl, combine flour, baking powder, baking soda, and salt and whisk to combine.", "image_url": null}, {"order": 1, "description": "For the Pancakes: Place chickpea liquid and sugar in the bowl of a stand mixer fitted with a whisk attachment. Whisk on high speed until stiff peaks form, about 6 minutes. Meanwhile, combine almond milk, vegetable oil, vanilla extract, lemon zest, and vinegar in a bowl. Add dry mix to wet mix and fold with a rubber spatula to combine (the mixture should remain lumpy). Fold in whipped chickpea liquid, being careful not to let it deflate too much.", "image_url": "https://www.seriouseats.com/thmb/2u0Vp1vdXu286JRqR0ffoDuL-L8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__20160324-aquafaba-pancake-oatmeal-vegan-04-composite-b7f70d8b60c94851ab550d27f5f08b74.jpg"}, {"order": 2, "description": "Heat a large heavy-bottomed nonstick skillet over medium heat for 5 minutes (or use an electric griddle). Add a small amount of vegan butter or oil to skillet or griddle and spread with a paper towel until no visible butter or oil remains. Reduce heat to low. Use a 1/4-cup dry measure to place 4 pancakes in skillet and cook until bubbles start to appear on top and the bottoms are golden brown, about 3 minutes. Carefully flip pancakes and cook on second side until golden brown and completely set, about 3 minutes longer. Serve pancakes immediately, or keep warm on a wire rack set on a rimmed baking sheet in a warm oven while you cook the remaining 3 batches. Serve with warm maple syrup and vegan butter.", "image_url": null}]}
{"name": "Veal Saltimbocca (Roman Sautéed Veal Cutlets With Prosciutto and Sage) Recipe", "description": "Veal saltimbocca, a Roman specialty, is a simple dish of sautéed veal cutlets, layered with prosciutto and fresh sage, and served with a buttery, lemony pan sauce. It&#39;s quick and easy to make, but to make it truly great, you have to pay attention to the details.", "servings": "Serves 4", "mainImageUrl": "https://www.seriouseats.com/thmb/LhSSr6DQLzbmKecPJqBISlAFBqQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__images__2017__01__20161212-veal-saltimbocca-vicky-wasik-27-3d92a49e41bf4c62be447f60fe061daa.jpg", "ingredients": ["8 veal cutlets (about 1 pound; 450g)", "Kosher salt and freshly ground black pepper", "8 large, thin slices prosciutto (about 1/4 pound; 115g)", "1 bunch fresh sage, divided (about 1/4 ounce; 7g)", "Cornstarch, for dredging (about 1/2 cup)", "3 tablespoons (45ml) extra-virgin olive oil, divided", "2 tablespoons (30g) unsalted butter", "1/3 cup (80ml) dry white wine", "Fresh juice from 1 lemon, to taste", "1 teaspoon soy sauce (5ml), preferably usukuchi (light soy sauce) (optional; see note)"], "steps": [{"order": 0, "description": "Arrange cutlets on a work surface, cover with a sheet or two of plastic wrap, and pound each with a meat pounder or the bottom of a small heavy saucepan or skillet until no more than 1/4-inch thick throughout. Season lightly on one side only with salt and pepper.", "image_url": "https://www.seriouseats.com/thmb/N3YPa2wRZuGv8DeeXC1hT-ygjOY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__images__2017__01__20161212-veal-saltimbocca-vicky-wasik-collage1-9e118d7e53b34027a0418c21b525fce0.jpg"}, {"order": 1, "description": "Flip veal cutlets so that the salted side is down. Pick eight of the largest sage leaves from your bunch and lay one in the center of each cutlet; if the sage leaves are small, use two per cutlet.", "image_url": null}, {"order": 2, "description": "Lay a slice of prosciutto on top of each cutlet, sandwiching the sage leaves flat between them. Using two wooden toothpicks per cutlet, fasten the prosciutto to the cutlets (the easiest way to do this is to push the toothpicks down through the prosciutto and just into the veal, then back up through the prosciutto again, much like fastening them together with a safety pin).", "image_url": "https://www.seriouseats.com/thmb/EoPfds4OjSlGF5TJMJqwiMDj9lo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__images__2017__01__20161212-veal-saltimbocca-vicky-wasik-collage2-6b3bff227b6749c1bec6e21124fab593.jpg"}, {"order": 3, "description": "Pour about 1/2 cup of cornstarch into a wide, shallow bowl. Dredge the underside of each prosciutto-topped cutlet in the cornstarch, shaking off the excess.", "image_url": null}, {"order": 4, "description": "In a large skillet or sauté pan, heat 2 tablespoons olive oil over high heat until shimmering. Add 4 of the cutlets, prosciutto-side up, and cook, swirling the pan occasionally, until the cutlets are lightly browned on the bottom and the last traces of pink are visible on top at the edges. Using a thin metal spatula, flip all of the cutlets prosciutto-side down, then flip them back immediately. Transfer to a clean platter. Lower heat at any time while cooking the cutlets to prevent burning.", "image_url": "https://www.seriouseats.com/thmb/tUqFT5CY270SXUO2kd6ZTEngqFk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__images__2017__01__20161212-veal-saltimbocca-vicky-wasik-collage4-b105322de2104a969e4df441d7591085.jpg"}, {"order": 5, "description": "Add remaining 1 tablespoon olive oil to the skillet. Add remaining 4 veal cutlets and repeat as in Step 5, then transfer to the platter.", "image_url": null}, {"order": 6, "description": "Lower heat to medium-low and add butter and a few sprigs of sage to the skillet and cook until butter is melted. Add white wine. Bring to a simmer over medium heat, stirring and scraping up any browned bits, then continue to cook, stirring and swirling constantly, until sauce is emulsified and slightly thickened (exact time can vary significantly depending on your skillet size and burner power; increase the heat at any time if it seems to be taking too long, or lower the heat if it&#39;s reducing too quickly).", "image_url": "https://www.seriouseats.com/thmb/eJkf1rJea0FmhE_hRn_zS5xjGIM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__images__2017__01__20161212-veal-saltimbocca-vicky-wasik-collage5-d326a00bc3ad4f628bf069a4e3164b3e.jpg"}, {"order": 7, "description": "Season with salt and pepper, then stir in 1 teaspoon of lemon juice. Taste and add another teaspoon (or more) of lemon juice, if desired. Stir in soy sauce, if using. If the sauce breaks at any point, whisk in a tablespoon or two of water to bring it back together. Discard sage sprigs. Pour sauce all over veal cutlets and serve right away.", "image_url": null}]}
{"name": "Vanilla Sprinkle Cookies Recipe", "description": "These vanilla cookies are covered in sprinkles, just like your local Italian-American bakery used to make.", "servings": "makes about 2 dozen cookies", "mainImageUrl": "https://www.seriouseats.com/thmb/0mSamwQuo4GrymYJbJy9mDNqL2E=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2013__07__20130703-cookiemonstersprinklecookies2-edit-949c856caad446709ba2be4eb1c76f65.jpg", "ingredients": ["2 cups (10 ounces) all purpose flour", "1/2 teaspoon baking soda", "1/2 teaspoon salt", "3/4 cup (1 1/2 sticks) unsalted butter, at room temperature", "1/2 cup sugar", "1/2 cup confectioners sugar", "1/4 cup canola oil", "1 egg", "2 teaspoons vanilla", "About 1 cup rainbow sprinkles"], "steps": [{"order": 0, "description": "In a medium bowl, combine flour, baking soda, and salt; set aside. In the bowl of a stand mixer fitted with a paddle attachment, cream together butter, oil, sugar, and confectioners&#39; sugar until fluffy, about 3 minutes. Add egg and vanilla and beat to combine. Add dry ingredients and mix just until dough comes together. Dough will be very soft but wrap it in plastic wrap and refrigerate for at least one hour.", "image_url": null}, {"order": 1, "description": "Adjust oven rack to upper and lower-middle positions and preheat oven to 350°F (180°C). Line 2 rimmed baking sheets with parchment paper.", "image_url": null}, {"order": 2, "description": "Fill a shallow bowl with sprinkles. Use a 2-ounce cookie scoop to form cookies into balls. Roll each ball in sprinkles to cover then transfer to prepared baking sheets. Bake until cookies are golden at the edges, about 20 minutes. Let cool 5 minutes then transfer to a wire rack to finish cooling. Cookies will keep in an airtight container for up to 3 days.", "image_url": null}]}
{"name": "Ajo Blanco (Spanish Chilled &#34;White Gazpacho&#34; Bread and Almond Soup) Recipe", "description": "Sometimes called &#34;white gazpacho,&#34; this elegant cold soup is thickened with almonds and bread and brightened with a splash of sherry vinegar.", "servings": "Makes about 6 cups (1.4L)", "mainImageUrl": "https://www.seriouseats.com/thmb/iy0nteEXNbnrBF3XsFhZh27c9-0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2017__07__20170707-ajo-blanco-cold-soup-vicky-wasik-8-5f154dece1fd48f8816d561ad3087b90.jpg", "ingredients": ["1 cup blanched or Marcona almonds (6 ounces; 170g), see note", "3 cups (720ml) cold water", "1 to 2 medium cloves garlic (depending on how strong you want the garlic flavor to be)", "1/2 pound (225g) fresh, crustless rustic bread (see note), cut into 1-inch cubes (about 3 cups)", "Kosher salt", "1 1/2 teaspoons (7ml) sherry vinegar, plus more if desired", "1 1/2 tablespoons (22ml) extra-virgin olive oil, plus more for garnish and for serving", "Green seedless grapes, crushed toasted almonds, and thinly sliced fresh mint leaves, for garnish"], "steps": [{"order": 0, "description": "In a blender, combine almonds with water and garlic and blend at high speed until milky; you may need to stop and scrape down sides of blender jar once or twice. Add bread and blend until very smooth. Season with salt, then blend in vinegar and olive oil. If using a less powerful blender, you may want to pass the soup through a fine-mesh strainer at this point; with a high-powered blender, that won&#39;t be necessary.", "image_url": "https://www.seriouseats.com/thmb/-hFeFk-Ru2Dpj6n6v-Ae_PkS8_Q=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__images__2017__07__20170707-ajo-blanco-cold-soup-vicky-wasik-3-c9a439b9e6c44cfd84c0cb4d58d6362b.jpg"}, {"order": 1, "description": "Transfer soup to a sealed container and refrigerate until very well chilled, at least 2 hours and up to 2 days.", "image_url": null}, {"order": 2, "description": "To Serve: Cut up grapes into smaller pieces and toss with almonds, mint, and just enough olive oil to coat. Season garnish with salt. Shake or stir soup well. Check consistency and thin with cold water, if desired. Adjust seasoning, adding more salt and/or vinegar, if desired. Pour into chilled serving bowls. Spoon grape garnish on top, lightly drizzling more olive oil onto each serving in a decorative manner. Serve.", "image_url": null}]}
{"name": "Classic Vanilla Ice Milk Recipe", "description": "Like sorbet, ice milk is light and refreshing on a hot summer&#39;s day, but with the creamy, soft consistency you&#39;ll find in the best ice cream.", "servings": "Makes about 5 cups", "mainImageUrl": "https://www.seriouseats.com/thmb/2tfumGvm4zvPVS6QH31N9-JnT5o=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2018__08__20180807-ice-milk-vicky-wasik-13-613a367887954bc2ae53038ddffe0677.jpg", "ingredients": ["9 1/4 ounces plain or very lightly toasted sugar (about 1 1/3 cups; 262g)", "1 1/4 ounces cornstarch (about 1/4 cup; 35g)", "1 3/4 ounces powdered milk (about 1/4 cup; 50g)", "1 teaspoon (4g) Diamond Crystal kosher salt (plus more if desired); for table salt, use about half as much by volume or the same weight", "28 ounces whole milk (about 3 1/2 cups; 795g), divided", "1/2 teaspoon vanilla extract"], "steps": [{"order": 0, "description": "Whisk sugar, cornstarch, powdered milk, and salt together in a 3-quart saucier. When no lumps of cornstarch remain, add exactly 14 ounces of the milk (about 1 2/3 cups; 396g) and whisk to combine. Cook over medium heat, whisking constantly but not vigorously, until it begins to simmer. This will take about 6 minutes; if the process seems to be moving slowly, simply turn up the heat. When the mixture comes to a boil, set a timer and continue cooking and whisking for exactly 1 minute. This ensures the cornstarch is fully hydrated.", "image_url": "https://www.seriouseats.com/thmb/f0G8KxRskfSt_Q8zcS_t6_yNhG4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2018__08__20180807-ice-milk-vicky-wasik-making-base-1500x1125-43ab2f74aab24aa2a1a7ff9784a36e70.jpg"}, {"order": 1, "description": "Immediately transfer mixture to a large bowl, then whisk in remaining milk, along with the vanilla (see note). Bearing in mind that the ice milk will taste substantially less sweet once frozen, season with an additional pinch of salt, if desired. Cover and refrigerate the base until cold, thick, and no warmer than 40°F (4°C), about 3 hours. (This process can be sped along with an ice bath if time is of the essence; in that case, a stainless steel bowl will help cool the base even faster.)", "image_url": "https://www.seriouseats.com/thmb/xeyUpShSlqFANK0JnfrE8nlzItQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2018__08__20180807-ice-milk-vicky-wasik-adding-cream-vanilla-1500x1125-4f8f558cf5d24345b4f0553ef986b2fb.jpg"}, {"order": 2, "description": "Churn in an ice cream maker according to the manufacturer’s directions. Meanwhile, place a quart-sized container and flexible spatula in the freezer. When the ice milk looks fluffy and thick, shut off the machine and, using the chilled spatula, scrape it into the chilled container. Enjoy as soft-serve, or cover with plastic pressed directly against the surface of the ice milk, then close lid and freeze until firm enough to scoop, about 4 hours. (The time will vary depending on the material and dimensions of the container.)", "image_url": "https://www.seriouseats.com/thmb/too_O4y3iAqh_TkF356DpY6tn3w=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2018__08__20180807-ice-milk-vicky-wasik-churned-1500x1125-858f6e5b6a7c45ebbe2422d03de322e8.jpg"}]}
{"name": "New England–Style Frozen Custard | The Food Lab", "description": "True New England-style frozen custard (which is to say, ice cream) without the need to buy an ice cream machine.", "servings": null, "mainImageUrl": "https://www.seriouseats.com/thmb/P7Ekw3YYAMl1sMHvPXq6jYFpMJY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__20100716-ice-cream-primary-116e49e446f44b45b18a801aac2a6998.jpg", "ingredients": ["8 large egg yolks", "1 cup sugar", "2 teaspoons vanilla extract", "1/4 teaspoon kosher salt", "1 (12-ounce) can evaporated milk", "2 cups heavy cream"], "steps": [{"order": 0, "description": "In a large bowl or stand mixer fitted with the whisk attachment, whisk egg yolks, sugar, vanilla, and salt until pale yellow and mixture falls off of whisk in thick ribbons, about 5 minutes. Set aside. Stirring constantly, heat evaporated milk in a medium saucepan on stovetop until it comes to a simmer. Slowly add hot milk to egg mixture, whisking constantly, until fully incorporated. Transfer mixture back to saucepan and heat, whisking constantly, to 180°F (82°C) (it should become thick and custardy). Do not overheat, or eggs will scramble. Chill mixture completely.", "image_url": null}, {"order": 1, "description": "Whip 1 cup heavy cream with whisk or in stand mixer until doubled in volume. Add whipped cream to egg mixture and fold with whisk just until no lumps remain. Pour mixture into ice cube trays and freeze for 4 hours, or until solid.", "image_url": null}, {"order": 2, "description": "Combine frozen cubes of ice cream (use a spoon or a dull knife to remove them) and remaining heavy cream in food processor and process until smooth, about 30 seconds, scraping down sides and breaking up lumps as necessary during process. Transfer mixture to quart container, and freeze for at least 4 more hours before serving.", "image_url": null}]}
{"name": "Vanilla Bean Simple Syrup Recipe", "description": "Making your own vanilla syrup at home is easy. Makes a great addition to coffee, tea, or cocktails.", "servings": "Makes 1 cup", "mainImageUrl": "https://www.seriouseats.com/thmb/GwTAEBgzCOi42C8jyP1FfuI9jik=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2013__07__Vanilla20bean20simple20syrup-1e2f290f39e44830873ae862306ae18a.jpg", "ingredients": ["1 cup water", "1 cup sugar", "1 vanilla bean"], "steps": [{"order": 0, "description": "Add sugar and water to a small saucepan. Slice vanilla bean down the center and scrape out the black seeds. Add the seeds and pod to the liquid mixture. Heat over medium high heat, stirring occasionally until sugar has dissolved completely and mixture has come to a boil, about 10 to 15 minutes. Remove from heat and pour into a sterile glass container. Store in the refrigerator for up to one week.", "image_url": null}]}
{"name": "Ajiaco (Colombian Chicken and Potato Soup) Recipe", "description": "All potatoes originated in the Andes, and Colombia has quite a selection of them, the best being the small, yellow, creamy, buttery papas Criollas. They&#39;re eaten deep fried, salt roasted, boiled, or—my wife&#39;s favorite method—cooked into ajiaco, a classic chicken and potato soup from the mountains around Bogotá.", "servings": "4 to 6", "mainImageUrl": "https://www.seriouseats.com/thmb/-bNSGtLxPSHmwJHTYr5YdKs8Xxk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/ajiaco-colombian-potato-soup-hero-24ae1887fec444b5870127bed64f6ce6.jpg", "ingredients": ["2 quarts homemade chicken stock (or low-sodium canned stock)", "1 whole bone-in, skin-on chicken breast, split (12 to 16 ounces total)", "1 large onion, split in half", "2 bay leaves", "2 pounds russet potatoes (about 2 medium) peeled and cut into rough 1-inch chunks", "2 pounds papas Criollas (about 20 potatoes), peeled", "1 pound Red Bliss potatoes (about 2 small), peeled, split into quarters lengthwise, and cut into 1/2-inch slices", "1/4 cup dried guascas (see note)", "2 ears corn, shucked and broken into 3 pieces each", "1 small onion, finely diced (about 3/4 cup)", "2 tablespoons chopped cilantro", "1 serrano or 1/2 jalapeño chile, seeded and finely minced", "Kosher salt and freshly cracked black pepper", "1/2 cup sour cream, thinned with 1 tablespoon milk", "1/2 cup capers, rinsed, drained, and roughly chopped", "1 ripe avocado, preferably smooth, light-green fuerte variety, sliced into wedges"], "steps": [{"order": 0, "description": "Combine chicken stock, chicken breast, onion, bay leaves, potatoes, and guascas in a large saucepot or Dutch oven. Add more water if necessary to cover solids by 1-inch. Bring to a boil over high heat. Reduce to a simmer and cook until chicken breast is cooked through, about 10 minutes. Transfer chicken breast to plate and set aside until cooled to room temperature.", "image_url": "https://www.seriouseats.com/thmb/ig8FWj6-u8eL2qBTrSFVrYd77zE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/ajiaco-colombian-potato-soup-Step1-4d2c4730a42a43549203a45a21740116.jpg"}, {"order": 1, "description": "Continue to simmer potatoes until russets and papas Criollas are completely tender and falling apart, about 45 minutes longer, adding more water as necessary. Discard onion and bay leaves. Using whisk, mash potato pieces against side of pot and stir vigorously to thicken soup. The soup should be thick, with large chunks of potatoes still remaining.", "image_url": "https://www.seriouseats.com/thmb/3HeS2j42El8BPKiQ_tTTHlr53Nk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/ajiaco-colombian-potato-soup-Step2-01ae3d0f4fd349f883cc2fe5a278cc0e.jpg"}, {"order": 2, "description": "Add corn cobs and continue to cook, stirring occasionally, until corn is cooked and soup is thickened to the consistency of thick heavy cream, about 15 minutes longer. Remove from heat.", "image_url": "https://www.seriouseats.com/thmb/YJkKzcGiaSV2YAHD-McQSJ0Jb9s=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/ajiaco-colombian-potato-soup-Step3-f23a9536172e42ce979d4ce6888ced88.jpg"}, {"order": 3, "description": "While soup is cooking, make the aji : Combine onion, cilantro, and chile pepper in small serving bowl and add water until just covered. Season generously with salt and stir to combine. Set aside. Discard chicken skin and bones. Shred meat into bite-size pieces and set aside in serving bowl.", "image_url": "https://www.seriouseats.com/thmb/_L73S5G-qnTQmm_1RZo9UaYC89E=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/ajiaco-colombian-potato-soup-Step4-b984046ea8864f089418b08dacf10333.jpg"}, {"order": 4, "description": "Season soup to taste with salt and pepper. Serve immediately, passing picked chicken, chopped capers, sour cream, and aji table-side for diners to add to their bowl. Serve avocado slices on the side.", "image_url": null}]}
{"name": "Aji Amarillo (Green Peruvian Dipping Sauce)", "description": "A fiery, creamy green sauce made with jalapeños and aji amarillo that&#39;s perfect for fries and grilled chicken.", "servings": "makes about 1 cup", "mainImageUrl": "https://www.seriouseats.com/thmb/85NDR2sjipkfhgI6UJtCIF4Gtx0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__20100302pio-pio-sauce1-6fc9409391004adcb28a8f389f5e3697.jpg", "ingredients": ["2 fresh jalapeños, including seeds and ribs, roughly chopped", "1 tablespoon aji Amarillo paste (see note)", "1 cup freshly picked cilantro leaves and small stems", "2 tablespoons grated cotija cheese or Parmesan cheese", "1 medium clove garlic, minced (about 1 teaspoon)", "1 tablespoon vegetable oil", "1 teaspoon white vinegar", "1/2 teaspoon juice from 1 lime", "1/2 cup mayonnaise", "Kosher salt and freshly ground black pepper"], "steps": [{"order": 0, "description": "Combine jalapeños, aji amarillo, cilantro, cotjia, garlic, oil, vinegar, and lime juice in a blender. Blend on high speed until smooth paste forms. Add mayonnaise and blend until homogenous. Transfer to a bowl and season to taste with salt and pepper. Serve with French fries or grilled chicken.", "image_url": null}]}
{"name": "Uovo in Raviolo (Runny Egg Yolk Ravioli) Recipe", "description": "Picture this: gorgeous oversized ravioli filled with a ring of creamy ricotta surrounding a perfectly intact, perfectly runny yolk. They&#39;re rich, delicious, and freaking beautiful.", "servings": "Makes 10 large ravioli, serving 4 or 5 as a main course", "mainImageUrl": "https://www.seriouseats.com/thmb/ET1SOrO7_kivmMpMlYb0c_PRKpY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2015__03__20150225-egg-yolk-ravioli-primary-niki-achitoff-gray201-16c146ffde264f49a941b4b3ad19c776.jpg", "ingredients": ["For the Ravioli:", "5 ounces fresh ricotta cheese (see note)", "1 ounce freshly grated Parmesan cheese", "Pinch freshly grated nutmeg", "1/2 teaspoon fresh juice from 1 lemon", "Kosher salt and freshly ground black pepper", "1/2 recipe Classic fresh egg pasta", "10 large eggs", "For the Pan Sauce:", "2 ounces pancetta, roughly chopped, divided", "1 medium shallot, finely chopped, divided", "1/2 cup dry white wine, divided", "4 tablespoons unsalted butter, divided", "2 teaspoons fresh juice from 1 lemon, divided", "1 tablespoon finely chopped parsley, for garnish"], "steps": [{"order": 0, "description": "For the Ravioli: Lay a clean kitchen towel or a triple layer of lint-free paper towels on a rimmed baking sheet. Spread ricotta evenly over surface of towels. Top with a second clean kitchen towel or triple layer of paper towels. Press with hands or a second rimmed baking sheet and let stand until excess moisture has been absorbed, 5 minutes. Transfer ricotta to a medium bowl (it should come right off the towels).", "image_url": null}, {"order": 1, "description": "Stir Parmesan cheese, nutmeg, and 1/2 teaspoon lemon juice into ricotta. Season to taste with salt and pepper. With a spoon, transfer filling into a pastry bag fitted with a 1/4-inch round tip or a zipper-lock bag with a 1/4-inch hole cut from a bottom corner. Refrigerate.", "image_url": null}, {"order": 2, "description": "Meanwhile, divide dough into 2 even sections. Working one section at a time, with remaining section tightly wrapped in plastic, roll dough through machine until sheet is just under 1/16 of an inch thick (typically second-to-last setting on roller). For a detailed description of this process, see steps 5 through 10 of our fresh pasta recipe . Cut sheet in half to create 2 pieces of dough roughly 15 inches long and 5 inches across.", "image_url": "https://www.seriouseats.com/thmb/F2Bqnt9qL_-NJ1AxuC3wvxbfHPE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__images__2014__12__20141222-pasta-making-vicky-wasik-40-6490dc804e0b49b7a74dd731d1340d13.jpg"}, {"order": 3, "description": "Lay dough sheets out on a lightly floured surface. Using a 3 1/2-inch round cookie cutter, cut out circles as close together as possible; you should have 10 rounds of dough from the 2 sheets (if you don&#39;t, re-roll dough scraps and cut more circles). Cover 5 of the dough rounds with a kitchen towel to keep moist and discard any remaining dough scraps.", "image_url": "https://www.seriouseats.com/thmb/RVXffi_0qIRIGO9xF5_eMq05UrU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__1-f023d5b0e5554fb4a04b2296bfe2852e.jpg"}, {"order": 4, "description": "Use pastry bag to gently squeeze out a ring of filling approximately 1 1/2 inches in diameter onto each of the 5 uncovered dough rounds. Then pipe a second ring directly on top of each of the first ones.", "image_url": "https://www.seriouseats.com/thmb/omDfIdq3MAxOUoGxX-maNqxNXQ0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__images__2015__02__20150225-egg-yolk-ravioli-piped-filling-niki-achitoff-gray-dcde56fffdf94e70bb4c70b220f828f6.jpg"}, {"order": 5, "description": "Working one at a time, separate 5 egg yolks from whites and gently slide yolk into center of ricotta fillings.", "image_url": "https://www.seriouseats.com/thmb/CoySGjpxU5t6hz1V7bmX-nRfKQU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__20150225-egg-yolk-ravioli-yolk-and-filling-niki-achitoff-gray201-397a836ea16a4e208bb4558fb9eaa818.jpg"}, {"order": 6, "description": "Remove towel from the other 5 dough rounds, and, working one at a time and using a pastry brush dipped in water, very lightly wet the edge of each dough round. Set dough rounds on top of each raviolo, moistened-side down. Slowly working your way around each raviolo, press and stretch the top dough rounds to make the edges meet with bottom dough rounds. Press down gently on each filling to remove air bubbles, being careful not to press on yolks themselves, then press edges to seal. Transfer ravioli to floured parchment paper, cover with kitchen towel, and repeat Steps 3 through 7 with remaining portion of dough.", "image_url": "https://www.seriouseats.com/thmb/-R5ki6ut6fQqVW_lOeK_sOEsdAs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__4-a96dfecf82c1436f9f3d2587a65534f7.jpg"}, {"order": 7, "description": "For the Pan Sauce: Bring unsalted water to a boil in a large pot. Meanwhile, in 2 large sauté pans, heat half of pancetta in each over medium-high heat, stirring occasionally, until fat is rendered and pancetta is lightly browned, about 4 minutes. Using a slotted spoon, transfer pancetta to a plate. Add half of shallot to each pan and cook, stirring, for 30 seconds. Add half of wine to each pan and cook, scraping up any browned bits, until wine is almost completely evaporated, about 1 minute. Remove from heat and return pancetta to each pan.", "image_url": null}, {"order": 8, "description": "When water is boiling, gently slide ravioli into pot. Boil for 1 minute 30 seconds (ravioli will be slightly undercooked). Drain, reserving 1 cup pasta water. Meanwhile, return skillets pan to low heat and melt half of butter in each. Evenly divide lemon juice, pasta water, and ravioli between both skillets. Swirl pans gently to until sauce is emulsified, approximately 1 minute.", "image_url": null}, {"order": 9, "description": "Transfer 2 to 3 ravioli to each plate and spoon pan sauce on top. Sprinkle with parsley and serve.", "image_url": "https://www.seriouseats.com/thmb/2BGhCVd8aQ40gDXe1S1KKhHw944=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__20150225-egg-yolk-ravioli-closeup-niki-achitoff-gray-d7e9c6cc894c4744ad0c3dc1885d12c3.jpg"}]}
{"name": "Tuna Poke (Hawaiian Raw-Tuna Salad) Recipe", "description": "This super-simple tuna poke brings together fresh fish and salty seaweed for a quick and refreshing one-bowl meal.", "servings": "Serves 4 to 6 as an appetizer, or 2 to 3 as a main course with steamed rice", "mainImageUrl": "https://www.seriouseats.com/thmb/Se9LvzR0mMXGyMOw9ut2BaIAttA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2016__06__20160608-poke-tuna-hamachi-octopus-salmon-hawaii-recipe-06-eb4cc2684cef44df9f9bb98b87b8ea40.jpg", "ingredients": ["2 teaspoons (about 1g) dried wakame (see note)", "1 teaspoon (about 0.5g) dried hijiki (see note)", "12 ounces (340g) raw sashimi-grade tuna, cut into 1/2-inch cubes", "3 ounces (85g) sweet onion, such as Maui or Vidalia, cut into 1/4-inch dice", "1 scallion, thinly sliced", "1 teaspoon (about 3g) white or black sesame seeds, or a mix", "4 teaspoons (20ml) soy sauce, more or less to taste", "2 teaspoons (10ml) toasted sesame oil, more or less to taste", "1 teaspoon (5ml) honey, more or less to taste", "Crushed red pepper, to taste (optional)", "Kosher salt", "Steamed rice (if eating as a meal)"], "steps": [{"order": 0, "description": "Place wakame and hijiki in separate small bowls. Cover with boiling water and let rest until rehydrated and tender, about 5 minutes. Drain and press with paper towels. Roughly chop wakame. Add wakame and hijiki to a large bowl.", "image_url": null}, {"order": 1, "description": "Add tuna, onion, scallion, sesame seeds, soy sauce, sesame oil, honey, and optional crushed red pepper to bowl. Season with a small pinch of kosher salt and gently fold to combine. Taste and adjust with more soy sauce, sesame oil, honey, or crushed red pepper as desired. Let sit 5 minutes at room temperature, then serve on its own or on top of steamed rice.", "image_url": "https://www.seriouseats.com/thmb/LbKHUUjEf7iXSYnhQ3jMcZsJKXE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__images__2016__06__20160608-poke-tuna-hamachi-octopus-salmon-hawaii-recipe-09-e254a5ac2fdc4c5598b28e84e830dc41.jpg"}]}
{"name": "Ultra-Fluffy Mashed Potatoes", "description": "Our recipe tells you how to use one incredibly simple technique to produce the fluffiest and lightest mashed potatoes you&#39;ll ever eat.", "servings": "Serves 8 to 12", "mainImageUrl": "https://www.seriouseats.com/thmb/tau6px4nP95rD-4UWJ8YnelHjXM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20241107-SEA-Thanksgiving-MHG-118-MashedPotatoes-MorganHuntGlaze-02-566bfd1adb0d4f228784f833cda03eda.jpg", "ingredients": ["4 pounds (1.8kg) russet potatoes", "2 cups (475ml) whole milk", "12 tablespoons unsalted butter (1 1/2 sticks; 6 ounces; 170g), room temperature, cut into 1/2-inch pats", "Kosher salt and freshly ground black pepper"], "steps": [{"order": 0, "description": "Peel potatoes and cut into 1- or 2-inch cubes. Transfer to a pot of cold water and rinse, changing water 2 or 3 times until it runs clear. Cover potatoes with fresh cold water and season generously with salt.", "image_url": "https://www.seriouseats.com/thmb/PuMrvrv_FypWYREI4j_cU6dq7aw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20241106-SEA-Ultra-Fluffy-Mashed-Potatoes-Lozano_step_1_075-b3865d67122348168c31af42e975bb2a.jpg"}, {"order": 1, "description": "Set potatoes over medium-high heat and bring to a boil, then reduce heat to maintain a gentle simmer. Cook until potatoes are completely tender, about 15 minutes after reaching a simmer.", "image_url": "https://www.seriouseats.com/thmb/WRI11V70cdDFMjG_jrG1LduI8ZI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20241106-SEA-Ultra-Fluffy-Mashed-Potatoes-Lozano_step_2_076-6429f919317447859bfdd62827622c48.jpg"}, {"order": 2, "description": "Drain potatoes in a colander and rinse under hot running water for 30 seconds to wash away excess starch. Allow potatoes to steam for 1 minute to remove excess moisture.", "image_url": "https://www.seriouseats.com/thmb/7uv8drjrjIIanOzuNPGITYsnyCA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20241106-SEA-Ultra-Fluffy-Mashed-Potatoes-Lozano_step_3_094-55c84ad1386d4f27b97612544cd08a58.jpg"}, {"order": 3, "description": "Set a ricer or food mill over now-empty pot and pass potatoes through.", "image_url": "https://www.seriouseats.com/thmb/w4z1wJ0TthBym43-lWxWKaqraxY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20241106-SEA-Ultra-Fluffy-Mashed-Potatoes-Lozano_step_4_095-14547c61f31540359d78cbeeee824792.jpg"}, {"order": 4, "description": "Add butter and gently fold into potatoes.", "image_url": "https://www.seriouseats.com/thmb/QFMcZAkVndAIbwcx7QXVmLfeXrU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20241106-SEA-Ultra-Fluffy-Mashed-Potatoes-Lozano_step_5_096-237a585355ae462f9bff6ad2ca59ff11.jpg"}, {"order": 5, "description": "Mound potatoes into the center of the pot and pour milk all around. Set over medium heat and bring milk to a simmer before gently folding it into the potatoes. If looser potatoes are desired, add additional milk in a similar fashion around the mashed potato mass and bring it to a simmer before folding into potatoes. Season with salt and pepper, then serve.", "image_url": "https://www.seriouseats.com/thmb/BAGp5ahtOpHZg9MFIq5_B6VSsWI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20241106-SEA-Ultra-Fluffy-Mashed-Potatoes-Lozano_step_6-54ff2f57cc1e438285d632757c2ba495.jpg"}]}
{"name": "Adobo-Marinated Grilled Pork Chops Recipe", "description": "Filipino adobo is a classic dish, usually of stewed chicken or pork in a tangy, flavorful sauce made from cane vinegar, soy sauce, and aromatics. But the building blocks of the adobo sauce also make a great marinade for grilled meats, like the pork chops here.", "servings": "Serves 2", "mainImageUrl": "https://www.seriouseats.com/thmb/kPjvyVrVvFbz0Kh9tumlVyFDFik=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2017__07__20170621-adobo-cane-vinegar-marinated-pork-chops-vicky-wasik-4-8976816f13854e839298ace8e5d9f4d3.jpg", "ingredients": ["1/2 cup (120ml) cane vinegar, preferably Datu Puti brand", "1/3 cup (80ml) soy sauce", "1/2 cup (120ml) water", "3 medium cloves garlic, crushed", "1/2 teaspoon whole black peppercorns", "1 bay leaf", "Two (12-ounce; 334g) bone-in pork chops, about 1 1/2 inches thick", "Warm cooked sticky rice, for serving (see note)"], "steps": [{"order": 0, "description": "In a medium saucepan, combine vinegar, soy sauce, water, garlic, peppercorns, and bay leaf and bring to a boil. Let marinade cool to room temperature.", "image_url": null}, {"order": 1, "description": "Place pork chops in a heavy-duty zipper-lock bag and pour marinade on top. Seal, pressing out air from bag, and refrigerate at least 8 and up to 24 hours.", "image_url": null}, {"order": 2, "description": "Light 1 chimney full of charcoal. When all charcoal is lit and covered with gray ash, pour out and spread coals evenly over half of coal grate. Alternatively, set half the burners of a gas grill to high heat. Set cooking grate in place, cover grill, and allow to preheat for 5 minutes. Clean and oil grilling grate.", "image_url": null}, {"order": 3, "description": "Grill pork chops over direct heat, turning occasionally, until well browned outside and 135°F (57°C) in the center for medium, about 10 minutes. If pork chops threaten to burn before they&#39;re done in the center, move them to cooler side of grill to finish cooking. Let rest 5 minutes before serving with sticky rice.", "image_url": null}]}
{"name": "Ultra-Crispy Slow-Roasted Pork Shoulder", "description": "Pull-apart tender meat and ultra-crisp skin: slow-roasted pork may not be the most gorgeous looking, but the flavor more than makes up for it.", "servings": "serves 8 to 12", "mainImageUrl": "https://www.seriouseats.com/thmb/UgnMZ75GDGmjbQa4sKO3XQcT5d8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/ultra-crispy-slow-roasted-pork-shoulder-recipe-8-32feb57c16e44e6a80230f1e9eb15fb8.jpg", "ingredients": ["1 whole bone-in, skin-on pork shoulder, 8 to 12 pounds total", "Kosher salt and freshly ground black pepper"], "steps": [{"order": 0, "description": "Adjust oven rack to middle position and preheat oven to 250°F (121°C).", "image_url": null}, {"order": 1, "description": "Line a rimmed baking sheet with heavy duty aluminum foil (see notes) and set a wire rack inside it. Place a piece of parchment paper on top of the wire rack. Season pork on all sides liberally with salt and pepper and place on parchment paper. Transfer to oven and roast until knife or fork inserted into side shows very little resistance when twisted, about 8 hours total.", "image_url": "https://www.seriouseats.com/thmb/5eSdoIoC_Pr8UsX0nAeIKlpdpP8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/ultra-crispy-slow-roasted-pork-shoulder-recipe-Collage-Step2-48b500d00c764ff19e8e7401972b51f9.jpg"}, {"order": 2, "description": "Remove pork from oven and tent with foil. Let rest at room temperature for at least 15 minutes and up to 2 hours. Increase oven to 500°F (260°C) and allow to preheat. Return pork to the oven and roast until skin is blistered and puffed, rotating every 5 minutes, about 20 minutes total. Remove from oven, tent with foil and allow to rest an additional 15 minutes. Serve by picking in the kitchen or just bring it to the table and let guests pick meat and crispy skin themselves, dipping into sauce of their choice on the side (see notes).", "image_url": "https://www.seriouseats.com/thmb/GsjZV6B5qHvYpKgMuN4cV6r9qUE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/ultra-crispy-slow-roasted-pork-shoulder-recipe-Collage-Step3-365493c92ff84a4499a31fc0bc055aed.jpg"}]}
{"name": "Ultra-Crispy Roast Potatoes Recipe", "description": "These potatoes are parboiled, then tossed roughly in a bowl with a metal spoon until their surfaces are roughed and scratched up. All those microscopic nooks and crannies make for an extra-crunchy exterior.", "servings": "Serves 8 to 10", "mainImageUrl": "https://www.seriouseats.com/thmb/mJ6jbHV9xiVhBCucEmXbW_q6mxA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2015__10__ultra-crispy-roast-potatoes-28189eb8fffd485c9047962b1f9e7606.jpg", "ingredients": ["4 1/2 pounds (2kg) russet potatoes (see note), rinsed, peeled if desired, and cut into 2-inch chunks", "Kosher salt", "1 tablespoon (15ml) white vinegar", "1/4 cup (60ml) duck fat (see note)", "Freshly ground black pepper", "12 sprigs thyme"], "steps": [{"order": 0, "description": "Adjust oven racks to lower and upper positions and preheat oven to 500°F (260°C). Place potatoes in a large saucepot and cover with cold water by 1 inch. Add 2 tablespoons (28g) salt and vinegar. Bring to a boil over high heat, reduce to a simmer, and cook until exteriors are tender, about 5 minutes. Potatoes should show slight resistance when poked with a paring knife or a cake tester. Drain potatoes and transfer to a large bowl.", "image_url": null}, {"order": 1, "description": "Add fat to bowl with potatoes. Season with pepper and more salt to taste, then toss with a large metal spoon until exteriors are slightly bashed up and coated in a thin layer of potato/fat paste. Divide potatoes evenly between 2 heavy rimmed baking sheets. Spread thyme sprigs over potatoes.", "image_url": "https://www.seriouseats.com/thmb/4o0B4SockowMUPFeSMEWX5ZQPRg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__images__20111102-ultra-crispy-roast-potatoes-2-a18547dd6a6d46bc807c0004f6f21918.jpg"}, {"order": 2, "description": "Transfer baking sheets to oven and roast until bottoms of potatoes are crisp and golden brown, about 20 minutes total, swapping trays top for bottom and rotating them once halfway through roasting. Using a thin metal spatula, flip potatoes and roast until second side is golden brown, another 15 to 20 minutes. Discard thyme sprigs and serve.", "image_url": "https://www.seriouseats.com/thmb/zv5V85xI61paAWY8SWgEpwz4Blg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__images__20111102-ultra-crispy-roast-potatoes-3-7c3a62fdb16041c9a1f99e875ac6451c.jpg"}]}
{"name": "Waffle Iron Hash Browns Recipe", "description": "Using the waffle iron to make hash browns gives you crunchy bits outside and silky smooth potato inside, all without having to fuss over potatoes in a pan.", "servings": "Serves 4", "mainImageUrl": "https://www.seriouseats.com/thmb/LTRoS8taIcNde5295uzYOtjIdk4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/waffle-iron-hash-browns-potato-recipe-hero-04-0965f820669b44d790b1882d8725cc0e.JPG", "ingredients": ["2 russet (baking) potatoes, about 10 ounces each, peeled and shredded", "1/2 teaspoon kosher salt", "3/4 teaspoon freshly ground black pepper", "2 teaspoons unsalted butter"], "steps": [{"order": 0, "description": "Preheat waffle iron. If it has temperature controls, set it to medium.", "image_url": "https://www.seriouseats.com/thmb/ky2gDa-p8G6PtF1-HkHxusCwspo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/waffle-iron-hash-browns-potato-recipe-step-01-046e413e2c0d459da56914c2f418f6b8.JPG"}, {"order": 1, "description": "Squeeze shredded potato with a towel until it’s as dry as possible.", "image_url": "https://www.seriouseats.com/thmb/oUx15B8lkrO6_AIZPjxEBpqyhho=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/waffle-iron-hash-browns-potato-recipe-step-02-38c17429b61541288a3f96720ea740b8.JPG"}, {"order": 2, "description": "In a mixing bowl, combine shredded potato, salt, and pepper.", "image_url": "https://www.seriouseats.com/thmb/wEVjPLF6HNIahtbDWXbTB85YXTg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/waffle-iron-hash-browns-potato-recipe-step-03-0cf9cfe2456d4f15b6bfe38b527383a0.JPG"}, {"order": 3, "description": "Using a silicone brush or paper towel, carefully grease both sides of waffle iron with butter.", "image_url": "https://www.seriouseats.com/thmb/7b19ZA1QNrx7-MA_S-Kln9XO_tE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/waffle-iron-hash-browns-potato-recipe-step-04-1-61c71c2c993d4b529fe60cf23c79afe8.JPG"}, {"order": 4, "description": "Pile shredded potatoes into waffle iron, over-stuffing it a bit, and close lid. (The pressure of the lid will compress the potatoes and help them emerge as a cohesive, waffled unit.) Cook for 2 minutes, then press down on lid to further compress potatoes (be careful: lid may be hot).", "image_url": "https://www.seriouseats.com/thmb/q9qDbrC3AKH82Zp3NTB2rXvrO9M=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/waffle-iron-hash-browns-potato-recipe-step-05-dd7c699880d1499a84667d3a062990e1.JPG"}, {"order": 5, "description": "Continue cooking potatoes for 5 minutes longer, then begin checking them: They are ready when potatoes are golden brown all over, about 1 to 2 minutes longer. Serve hot with eggs or any other breakfast foods.", "image_url": "https://www.seriouseats.com/thmb/h_zbLvo4Tfp76_ZWr6Ao_je6M5c=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/waffle-iron-hash-browns-potato-recipe-step-06-60a30eb3af0e4cf39e58ec53d31b4869.JPG"}]}
{"name": "Waffle Iron Churros Recipe", "description": "Want to eat churros every morning? Then these waffled churros are for you. Plus, the nooks and crannies of the waffled churros provide space for the chocolate sauce to pool.", "servings": "Serves 4", "mainImageUrl": "https://www.seriouseats.com/thmb/fP4S3Qua3HNcIzQCIMJRL17jOmk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20222222-waffle-iron-churros-mariel-delacruz-beauty-8af9d1b403e34fe29d453895ab8b9a27.jpg", "ingredients": ["For the Batter:", "1/2 cup water", "4 tablespoons unsalted butter", "1/4 teaspoon salt", "1 tablespoon sugar", "1/4 teaspoon cinnamon", "1/2 cup all-purpose flour", "2 large eggs", "For the Topping and Chocolate Sauce:", "1/2 cup sugar", "1 teaspoon cinnamon", "1/4 cup heavy cream", "2 ounces semi-sweet chocolate", "1 teaspoon corn syrup", "Nonstick cooking spray", "1 tablespoon unsalted butter, melted"], "steps": [{"order": 0, "description": "For the Batter: In a small saucepan, bring water, butter, salt, sugar, and cinnamon to a simmer over high heat.", "image_url": "https://www.seriouseats.com/thmb/3StrZl_zkair6WPQsFyKaswkzYA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20220222-waffle-iron-churros-mariel-delacruz-step-1-c47d94ade23a412b95c70bcddf673191.jpg"}, {"order": 1, "description": "When butter has melted and sugar and salt have dissolved, lower heat to medium, add flour, and stir rapidly. The batter will form quickly as the flour absorbs the water mixture. Continue to cook over medium heat, stirring, for 1 minute.", "image_url": "https://www.seriouseats.com/thmb/wX9VU38rTHWAMYGTgcG2xV9teY0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/waffleironchurro-collage-12535b79e43d421ba28e68207002fc81.jpg"}, {"order": 2, "description": "Remove saucepan from heat and allow mixture to stand for 5 minutes. Add eggs one at a time to batter mixture, stirring until each is incorporated. The batter will be very stiff and look a bit like buttercream frosting.", "image_url": "https://www.seriouseats.com/thmb/6aTFjQoj0OHOWfLdIQGd-jf3Ihs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20220222-waffle-iron-churros-mariel-delacruz-056-52a404c655e244e2ae87b4744432e2eb.jpg"}, {"order": 3, "description": "Meanwhile, For the Topping and Chocolate Sauce: Mix sugar and cinnamon on a plate for dipping. In a saucepan over low heat, combine cream, chocolate, and corn syrup and stir frequently until chocolate begins to melt. Turn off heat and set chocolate mixture aside.", "image_url": "https://www.seriouseats.com/thmb/xOjD2L7A0vALBdn1oNlVF0FM_I8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20220222-waffle-iron-churros-mariel-delacruz-059-cd9d83325bd64dd6b7617df8d0a6ad97.jpg"}, {"order": 4, "description": "Preheat the waffle iron. (Set it to medium if it has temperature settings.) Coat both sides of the waffle iron with nonstick cooking spray.", "image_url": "https://www.seriouseats.com/thmb/l74dMwasrnxbeiIenT2GhiTSYH4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20220222-waffle-iron-churros-mariel-delacruz-Step5-8ec15bac600646beadb9f87b70fabe29.jpg"}, {"order": 5, "description": "Place about 1/4 cup of batter on each section of waffle iron. Do not overstuff waffle iron—the batter will expand considerably. (Err on the side of using less batter before you see how much it spreads out and rises.) Close the lid and cook until churros are golden brown, 5 to 10 minutes. Transfer churros to a plate and repeat with remaining batter.", "image_url": "https://www.seriouseats.com/thmb/nZADKti31YmcF3vHo1dr41rrSK8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20220222-waffle-iron-churros-mariel-delacruz-Step6-Collage-7b6fce9b19fd4ca3ae587c11e0e7a19f.jpg"}, {"order": 6, "description": "Brush churros with melted butter and then dip them in cinnamon sugar. Serve warm with chocolate sauce for dipping.", "image_url": "https://www.seriouseats.com/thmb/_6UDZbnHaZAvJlDAO-DLBcRHyKc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/20220222-waffle-iron-churros-mariel-delacruz-Step7-d77782403a7f450db300c3578439d725.jpg"}]}
{"name": "Waffle Cones", "description": "These golden-brown ice cream cones are sturdy enough to support your favorite scoops, yet delicate and crisp thanks to a blend of brown sugar and honey.", "servings": "1 heaping cup (11 ounces) batter, for about eight 5 1/2-inch waffle cones", "mainImageUrl": "https://www.seriouseats.com/thmb/FGAyIHdddSfVKDcbsB6fvCmlgxM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2019__05__20190501-waffle-cones-vicky-wasik-26-fac925a23b644f64ab96ea3917f018fe.jpg", "ingredients": ["3 ounces egg whites (about 1/3 cup plus 1 tablespoon; 85g)", "1 3/4 ounces white sugar (about 1/4 cup; 50g)", "1 1/4 ounces brown sugar (about 3 tablespoons; 35g)", "1 ounce honey (2 shy tablespoons; 28g)", "1 ounce roasted hazelnut oil, see note (about 2 heaping tablespoons; 28g)", "1/4 ounce water (about 1 1/2 teaspoons; 7g)", "1/4 ounce rum, vanilla, or additional water (about 1 1/2 teaspoons; 7g)", "1/4 teaspoon (1g) Diamond Crystal kosher salt; for table salt, use about half as much by volume or the same weight", "1/4 teaspoon baking soda", "3 ounces bread flour, sifted (about 2/3 cup, spooned; 85g)", "Neutral cooking spray, such as Pam Original, for greasing the iron"], "steps": [{"order": 0, "description": "At least 30 minutes in advance, plug in the waffle maker and preheat to 300°F (150°C); on machines that lack specific settings, start with the medium setting and adjust as needed along the way. If a machine does not allow for temperature control, the ideal time for a given amount of batter will need to be determined individually.", "image_url": null}, {"order": 1, "description": "In a medium bowl, combine egg whites, sugar, brown sugar, honey, hazelnut oil, water, rum or vanilla, salt, and baking soda. With a balloon whisk, mix vigorously for a full minute to ensure the baking soda is perfectly homogenized into the batter. Undermixing at this stage can produce waffle cones with a very uneven color and texture.", "image_url": "https://www.seriouseats.com/thmb/iWL0xWORzr11dvBYTPjYtRW9cIE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2019__05__20190501-waffle-cones-vicky-wasik-batter-1500x1125-7c726a54ec494f759a59c8a92e110adc.jpg"}, {"order": 2, "description": "Sift in bread flour, and whisk until very well combined. With a flexible spatula, scrape and fold the batter several times to ensure perfect uniformity, paying particular care to the batter splashed up the sides. Rushing this step can produce waffle cones with an uneven texture. Let the batter stand 10 minutes before proceeding to the next step; if not briefly rested, the dough may be too thin, lacy, and brittle.", "image_url": null}, {"order": 3, "description": "Spritz the plates of the waffle iron with a neutral pan spray, then add approximately 1 1/4 ounces (2 tablespoons) batter onto the center. Close the iron firmly and cook until the wafer is uniformly golden brown, about 85 seconds to 2 minutes. The exact cooking time and temperature will vary drastically from machine to machine; the idea is to find a setting and time that will cook the wafer at a gentle pace, helping drive out moisture without browning too fast. When cooked too fast, the wafer will be brittle and difficult to shape. When cooked too slow, the wafer will be pale, and will not crisp fully once cool.", "image_url": "https://www.seriouseats.com/thmb/xy0UWCxxp7gMdEgZx3RqKtA_3Mo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2019__07__20190729-waffle-cones-vicky-wasik2-1500x1125-e7182ba9ec734d07ad54423885c1a189.jpg"}, {"order": 4, "description": "To Shape a Waffle Cone: Place a hot wafer on a relatively non-conductive work surface, such as a clean kitchen towel or a cutting board. Set the waffle cone form on top, so that its tip is about 1/4 inch from the edge of the wafer, around the 10 o&#39;clock mark. Fold the upper portion of the wafer over the form, and press firmly at the tip to create a seal. Roll the form over, working bit by bit to keep the wafer tight against the form, until you reach the outer edge. Hold the waffle cone firmly in place, seam side down, until cool enough to maintain its own shape, 30 to 45 seconds. Shaping the waffle cone is a skill, and will require a certain degree of practice to master. Transfer shaped cone to a wire rack to cool completely, about 15 minutes.", "image_url": "https://www.seriouseats.com/thmb/367B_AjmfnvWkF8hUVPYugfB1BY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2019__05__20190501-waffle-cones-vicky-wasik-rolling-cone-1500x1125-43561b04a387457da999700a00840721.jpg"}, {"order": 5, "description": "To Shape a Waffle Bowl: Place a small bowl or ramekin, preferably one with smooth, rounded edges, upside down on a work surface, and have a second, identical bowl or ramekin at the ready. Immediately after griddling, place a hot wafer over the inverted ramekin, then place the second ramekin on top and gently press to nestle the two together. If desired, the excess wafer can be shaped by hand, to create a &#34;frill&#34; around the edges. When the wafer is cool enough to hold its own shape, remove from the ramekins (if left too long, it may stick to either ramekin).", "image_url": "https://www.seriouseats.com/thmb/5chYLjgdAcHRTHL10lZeOCenqpk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2019__05__20190501-waffle-cones-vicky-wasik-14-1500x1125-44b341dec96a4b7792552ea9cf424bee.jpg"}, {"order": 6, "description": "Repeat cooking and shaping procedure with remaining batter, spraying the iron with cooking spray in between each wafer. As soon as the waffle cones or bowls have cooled to room temperature, immediately transfer to an airtight container. The waffle cones and bowls are extremely susceptible to the effects of humidity, and can begin softening in as little as 15 minutes if left in the open. Likewise, if stored in a container while warm, the waffle cones and bowls may steam themselves and soften. But if properly cooked and well protected from air, the cones and bowls will keep for a week or more at cool room temperature. Small sandwich-sized zip-top bags are ideal for protecting and storing individual cones or bowls.", "image_url": null}]}
{"name": "Vodka Pizza", "description": "Pizza with vodka sauce is a richer, creamier, spicier alternative to traditional tomato sauce pies.", "servings": "Serves 4 to 6 (makes 3 pies)", "mainImageUrl": "https://www.seriouseats.com/thmb/5Str9Erg6_LQ2FaEzrXV_eUg_Wo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2013__04__20130320-vodka-pizza-2a-4518f3c690654147ac13cd3a93522aed.jpg", "ingredients": ["2 tablespoons extra-virgin olive oil, plus more for drizzling", "4 medium cloves garlic, minced (about 4 teaspoons)", "1 teaspoon dried oregano", "1/2 teaspoon red pepper flakes", "1 (28-ounce) can whole peeled tomatoes, roughly broken up by hand", "1 cup heavy cream", "1/3 cup vodka", "Kosher salt and freshly ground black pepper", "1 recipe Basic New York Pizza Dough, divided and risen at least 2 hours", "1 pound fresh mozzarella (preferably buffalo milk), torn into rough 3/4- to 1-inch chunks and drained in a fine mesh strainer set over a bowl", "12 to 16 basil leaves", "Kosher salt"], "steps": [{"order": 0, "description": "Heat olive oil in a medium saucepan over medium heat until shimmering. Add garlic, oregano, and pepper flakes and cook, stirring constantly, until fragrant, about 1 minute. Add tomatoes. Increase heat to high, bring to a boil, then reduce to a bare simmer. Cook, stirring occasionally, until reduced by 1/4, about 20 minutes. Add heavy cream, increase heat to bring to a boil, reduce to a simmer, and continue to cook until reduced again by 1/4, about 20 minutes longer. Add vodka and cook for 7 minutes. Remove from heat and season to taste with salt and pepper.", "image_url": null}, {"order": 1, "description": "Let sauce cool slightly, then transfer half of sauce to the jar of a blender. Blend, starting on lowest speed and gradually increasing to high until completely smooth, about 2 minutes total. Strain through a fine-mesh strainer into a medium bowl. Repeat with remaining half of sauce. (For storing extra sauce, see Make-Ahead and Storage below).", "image_url": null}, {"order": 2, "description": "At least 45 minutes before baking, place a baking stone or steel on an oven rack set to the top position and preheat oven to 550°F (290°C).", "image_url": null}, {"order": 3, "description": "Turn single dough ball out onto lightly flour surface. Gently press out dough into rough 8-inch circle, leaving outer 1-inch higher than the rest. Gently stretch dough by draping over knuckles into a 12 to 14-inch circle about 1/4-inch thick. Transfer to pizza peel.", "image_url": null}, {"order": 4, "description": "Spread approximately 3/4 cup of sauce evenly over surface of crust, leaving 1/2 to 1-inch border along edge. Place 8 to 10 chunks of mozzarella evenly over surface of pizza and scatter with 4 to 5 basil leaves. Drizzle with about 1 tablespoon extra-virgin olive oil and sprinkle with salt. Slide pizza onto stone or steel and bake until cheese is melted and crust underbelly is spotty brown, 6 to 12 minutes total. Remove from oven with metal pizza peel, transfer to cutting board, slice, and serve. Repeat steps 3 and 4 with remaining ingredients to make 2 additional pizzas.", "image_url": null}]}
{"name": "Frisco Recipe", "description": "The Frisco is the product of a long evolutionary process in 20th century mixology. Originating no later than the early 1930s--that&#39;s the earliest reference I&#39;ve found for it, anyway--the drink crawled out of the cocktail equivalent of the primordial soup as a short, sharp burst of rye whiskey with a slight touch of the French herbal liqueur Benedictine and a twist of lemon peel for excitement.", "servings": null, "mainImageUrl": "https://www.seriouseats.com/thmb/ak8RUsQpJNjoowpZXSUTTmGE0Sk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__20110118strainerprimary-0a043598148849389c89bc970140c8fe.jpg", "ingredients": ["2 ounces rye whiskey", "3/4 ounce fresh lemon juice", "3/4 ounce Benedictine"], "steps": [{"order": 0, "description": "Combine ingredients in a cocktail shaker and fill with ice. Shake well for 10 seconds and strain into a chilled cocktail glass.", "image_url": null}]}
{"name": "Vinegar Coleslaw", "description": "This sweet and tangy vinegar coleslaw is a great accompaniment to rich barbecue.", "servings": null, "mainImageUrl": "https://www.seriouseats.com/thmb/eqHqJ2wAqILSf16JWO7Dxp-PPjU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/SEA-vinegar-coleslaw-recipe-hero-64a3e9a9ae0f4b0b8e2ac21801f8aada.jpg", "ingredients": ["For the Dressing:", "1 cup apple cider vinegar", "1 cup sugar", "3 tablespoons extra-virgin olive oil", "1 teaspoon finely minced garlic (about 1 medium clove)", "1 teaspoon freshly ground black pepper", "1 teaspoon celery seeds", "For the Slaw:", "1 large head green cabbage (about 3 1/2 pounds), finely shredded on a mandoline or by hand", "1 large carrot, peeled and grated on the large holes of a box grater", "1 medium yellow onion, finely sliced on a mandoline or by hand", "2/3 cup sugar", "1/3 cup kosher salt"], "steps": [{"order": 0, "description": "For the Dressing: In a small bowl, whisk together vinegar, sugar, oil, garlic, salt, black pepper, and celery seeds until sugar is dissolved.", "image_url": "https://www.seriouseats.com/thmb/RMiqG4qvy7abwulvsE-H32h5qT8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/SEA-vinegar-coleslaw-recipe-step-01-d7f77997735a4d7c818ce6f1b9c7d31b.jpg"}, {"order": 1, "description": "For the Slaw: Combine cabbage, carrots, and onion in a large bowl. Sprinkle with sugar and salt and toss to combine. Let stand 5 minutes, then transfer to a large colander and rinse thoroughly under cold running water.", "image_url": "https://www.seriouseats.com/thmb/CJLR1ttweJI_PUW0wbbF7XvxDFA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/SEA-vinegar-coleslaw-recipe-step2-15a2b5b846cc415bbd0ddaf112ccb4f3.jpg"}, {"order": 2, "description": "Transfer vegetables to a salad spinner and spin dry. Alternatively, transfer to a large rimmed baking sheet lined with a triple layer of paper towels or a clean kitchen towel and blot mixture dry with more towels. Return to large bowl.", "image_url": "https://www.seriouseats.com/thmb/Lw2aja2h-0ftqhIeXz3LTmTOjz4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/SEA-vinegar-coleslaw-recipe-step-03-4aa51afdb88a449daff91858798074aa.jpg"}, {"order": 3, "description": "Pour dressing over vegetables and toss to coat. Adjust seasoning to taste with salt and sugar.", "image_url": "https://www.seriouseats.com/thmb/T8hLV-Tx0P_DE4e5g0wLpVc0jv8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/SEA-vinegar-coleslaw-recipe-step-04-7e04ed15ea934189b7b990e1322f732b.jpg"}]}
{"name": "Homemade Bagel Bites", "description": "If you can&#39;t understand the allure of made-from-scratch Bagel Bites, there&#39;s nothing I can say or do to convince you. This is a recipe for the hardcore fans, those of us who&#39;ve longed for bite-size pizza poppers that taste as good as we remember—chewy, cheesy, salty, and crisp.", "servings": "Makes thirty-two 1 1/2–inch bagel pizzas", "mainImageUrl": "https://www.seriouseats.com/thmb/zx_xD_D7q41h5RdNOAyAoxqx6ig=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2017__01__20170128-bagel-bites-cheese-pepperoni-vicky-wasik-6-0c90262d24f940fc84030b3d5826319e.jpg", "ingredients": ["Homemade Bagel dough", "1 ounce barley malt syrup (4 teaspoons; 30g), optional", "Quick and Easy Italian-American Red Sauce", "Salt, pepper, and fennel seed to taste", "12 ounces finely shredded mozzarella cheese (3 cups; 340g)", "6 ounces pepperoni, such as Vermont Smoke &amp; Cure (1 link; 170g)"], "steps": [{"order": 0, "description": "For the Mini Bagels: Prepare dough as directed, then divide into 16 equal portions, about 1 1/2 ounces or 43g each. Cup a portion of dough beneath your palm and work in quick, circular motions to form a tight skin around the ball, with only a tiny seam along the bottom. If the seam is large or irregular, continue rounding until the bottom is nearly smooth. Cover with plastic and let rest 15 minutes. Poke a hole into the center of each portion with a damp fingertip, then gently stretch into a 1 1/2–inch ring, wetting your hands in cold water as needed to prevent sticking. Arrange on a well-greased, parchment-lined half sheet pan, cover with plastic, and refrigerate 24 to 36 hours, depending on your schedule.", "image_url": "https://www.seriouseats.com/thmb/LE6p8BBXnBmlMbHTusbSpNEQcOU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__images__2017__01__20170128-bagel-bites-cheese-pepperoni-vicky-wasik-1-3dd8c93f51fd4feea22cbcd394373ee2.jpg"}, {"order": 1, "description": "To Boil and Bake: Adjust oven rack to lower-middle position and preheat to 425°F (220°C). Nest a wire baking rack in a half sheet pan, then cover with parchment. Fill a stainless steel pot with about 3 inches of water, stir in malt syrup (if using), and bring to a boil over high heat. Meanwhile, line a baking sheet or cutting board with a thick layer of paper towels. Working with three or four at a time, boil the bagels, about 15 seconds per side. Place on paper towels, then immediately transfer to the prepared half sheet pan. (If left on the paper towels too long, the bagels will stick; if this happens, quickly dip the bagel back into the hot water, and the wet paper towel will peel right off.) Bake until blistered and golden brown all over, about 18 minutes. Cool at least 15 minutes before proceeding to the next step, or store mini bagels up to 36 hours in a paper bag.", "image_url": null}, {"order": 2, "description": "To Finish: Adjust oven rack to lower-middle position and preheat to 450°F (230°C). Split mini bagels horizontally with a serrated knife, arrange half on a parchment-lined baking sheet, and toast only until their surface is a little dry, about 5 minutes. Top each with a few tablespoons of red sauce, followed by a sprinkle of salt, pepper, and fennel seeds, followed by a generous mound of cheese and a small handful of diced pepperoni. Bake until the cheese is melted and golden brown, about 16 minutes, and serve immediately. Repeat with remaining bagel halves for round two.", "image_url": "https://www.seriouseats.com/thmb/k1P3zNBtkLqzmH8SJVClzlODZOE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__images__2017__01__20170128-bagel-bites-cheese-pepperoni-vicky-wasik-4-5055a6aa1c2844908ac6c1be055e5233.jpg"}]}
{"name": "Vieux Carré", "description": "Born in New Orleans, this stiff cocktail of rye and Cognac is a drink to sip and savor.", "servings": "makes 1 cocktail", "mainImageUrl": "https://www.seriouseats.com/thmb/SdKxO8f6aGQhh2tw5GvNyRhAbK8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__recipes__images__2015__04__20150323-cocktails-vicky-wasik-vieux-carre-6f64176c70994cdea68e588b780a0d1d.jpg", "ingredients": ["1/2 teaspoon Benedictine", "1 dash Peychaud’s Bitters", "1 dash Angostura Bitters", "3/4 ounce rye whiskey", "3/4 ounce cognac", "3/4 ounce sweet vermouth"], "steps": [{"order": 0, "description": "Combine all ingredients in a mixing glass and fill with ice; stir well for 20 seconds and strain into an ice-filled old fashioned glass. Garnish with a cherry.", "image_url": null}]}
{"name": "30-Minute Tuscan White Bean Soup", "description": "The key is plenty of rosemary and a hunk of rind from some good Parmigiano-Reggiano tossed in while it simmers. That and plenty of good olive oil for drizzling.", "servings": "Makes 2 quarts, serving 8", "mainImageUrl": "https://www.seriouseats.com/thmb/f7c_rh5wPl3l3iuZ4Eh0WbDWiWY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/__opt__aboutcom__coeus__resources__content_migration__serious_eats__seriouseats.com__2018__02__tuscan-white-bean-soup-kenji-b8a1393168304f0995d48c3d373ba983.jpg", "ingredients": ["2 tablespoons extra-virgin olive oil, plus more for serving", "1 medium onion, finely diced (about 1 cup)", "2 medium carrots, finely diced (about 1 cup)", "2 ribs celery, finely diced (about 1 cup)", "4 cloves garlic, minced on a microplane grater", "1/2 teaspoon dried red pepper flakes", "1 quart homemade or low-sodium canned chicken broth", "2 (15-ounce) cans white beans (cannellini or great northern), with their liquid", "4 6-inch sprigs rosemary, leaves finely chopped and stems reserved", "1 (3-4 inch) chunk parmesan rind (optional)", "2 bay leaves", "3 to 4 cups roughly chopped kale or swiss chard leaves", "Kosher salt and freshly ground black pepper", "Parmigiano-Reggiano for serving"], "steps": [{"order": 0, "description": "Heat olive oil in a large saucepan over medium-high heat until shimmering. Add onions, carrots, and celery and cook, stirring frequently, until softened but not browned, about 3 minutes. Add garlic and dried red pepper flakes and cook, stirring constantly until fragrant, about 1 minute. Add chicken broth, beans and their liquid, rosemary stems, parmesan rind, and bay leaves. Increase heat to high, and bring to a boil. Reduce to a bare simmer, add kale, cover and cook for 15 minutes.", "image_url": null}, {"order": 1, "description": "Discard the bay leaves and rosemary stems. Use a hand blender to roughly puree part of the beans until desired consistency is reached. Alternatively, transfer 2 cups of soup to a blender or food processor and process until smooth (start on low speed and increase to high to prevent blender blow-out). Return to the soup and stir to combine. Season to taste with salt and pepper.", "image_url": null}, {"order": 2, "description": "Ladle into bowls, sprinkle with reserved chopped rosemary leaves, drizzle with extra-virgin olive oil and a grating of Parmigiano-Reggiano, and serve with crusty toasted bread.", "image_url": null}]}
